{"id":1094,"date":"2017-06-21T14:31:51","date_gmt":"2017-06-21T18:31:51","guid":{"rendered":"http:\/\/achievion.com\/?p=1094"},"modified":"2017-06-27T14:45:43","modified_gmt":"2017-06-27T18:45:43","slug":"startup-101-dont-let-financing-woes-hold-back-dream","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/startup-101-dont-let-financing-woes-hold-back-dream.html","title":{"rendered":"Startup 101: Don’t Let Financing Woes Hold You Back From Your Dream"},"content":{"rendered":"<p><span style=\"font-weight: 400\">Many first-time entrepreneurs have it all wrong. They have brilliant ideas that they unfortunately believe that no one will invest in. In fact, this couldn&#8217;t be further from the truth.<\/span><span style=\"font-weight: 400\"><br \/>\n<\/span><span style=\"font-weight: 400\"><br \/>\n<\/span><span style=\"font-weight: 400\">While the financial burden of a starting a business might be one of the main things that is holding you back, you should know that there are actually a lot of financing opportunities that may be available to you. <\/span><span style=\"font-weight: 400\"><br \/>\n<\/span><span style=\"font-weight: 400\"><br \/>\n<\/span><span style=\"font-weight: 400\">There are thousands of successful startups out there and investors are always looking for new opportunities. To help you get started, we&#8217;ve put together this brief guide on how to attract financing for your startup.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">Form an LLC<\/span><\/h2>\n<p><span style=\"font-weight: 400\">The first step to finding investors for your business should be selecting a business entity for your business. While you can operate a business as a sole proprietorship, it will make it much easier for you to attract investors if you form a limited liability company (LLC). An LLC is a business structure that combines the pass-through taxation of a partnership or sole proprietorship with the limited liability of a corporation.<\/span><\/p>\n<p><span style=\"font-weight: 400\">An LLC isn’t a taxable business entity on its own. You’ll still need to elect to have your LLC treated as a corporation, partnership, or sole proprietorship for tax purposes.<\/span><\/p>\n<p><span style=\"font-weight: 400\">Most new tech entrepreneurs should elect to have their new businesses treated as a corporation. A corporation is preferred by investors because of limited liability and the easy transferability of shares. <\/span><\/p>\n<p><span style=\"font-weight: 400\">As a corporation, shares of stock can be transferred to new investors in your business. Later, if your business expands, larger offers can then be made to the public via the services of brokerage firms and stock exchanges.<\/span><\/p>\n<p><span style=\"font-weight: 400\">The steps to form an LLC can vary depending on the state in which you will conduct business. Therefore, you should make sure that you check with your state tax authorities to determine what steps you’ll need to take in order to legally operate your business. <\/span><\/p>\n<p><span style=\"font-weight: 400\">Generally, the steps to form an LLC are the following:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400\"><span style=\"font-weight: 400\">Choose an available business name that complies with the rules that your state has for naming LLCs;<\/span><\/li>\n<li style=\"font-weight: 400\"><span style=\"font-weight: 400\">File the required paperwork, commonly called the articles of organization and pay the filing fee required by your state;<\/span><\/li>\n<li style=\"font-weight: 400\"><span style=\"font-weight: 400\">Create an operating agreement for your LLC. This agreement covers all of the concerns related to the management, shareholder interests, and rights and responsibilities of the members of your LLC;<\/span><\/li>\n<li style=\"font-weight: 400\"><span style=\"font-weight: 400\">Certain states also require that you publish a notice of intent to form an LLC;<\/span><\/li>\n<li style=\"font-weight: 400\"><span style=\"font-weight: 400\">You may need to obtain additional permits and a business license.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400\">After the setup of your LLC is complete, your state may also require that you pay an annual franchise tax in order to maintain your LLC, along with initial reports, and ongoing tax filings. <\/span><\/p>\n<h2><span style=\"font-weight: 400\">Equity Investors<\/span><\/h2>\n<p><span style=\"font-weight: 400\">Here are the different types of investors that may be interested in growing your business at its different stages:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400\"><b>Family and Friends. <\/b><span style=\"font-weight: 400\">Family and friends are the people that you will likely turn to as your first source of funding for your business. If this option is available to you, it will likely be the easiest way to obtain seed capital for a new business. <\/span><\/li>\n<li style=\"font-weight: 400\"><b>Angel Investors.<\/b><span style=\"font-weight: 400\"> Angel investors are high net-worth private individuals who agree to invest their personal money in a business in exchange for convertible debt or a share of ownership in the company. Sometimes angel investors organize into groups or networks to pool their investment capital.<\/span><\/li>\n<li style=\"font-weight: 400\"><b>Venture capital.<\/b><span style=\"font-weight: 400\"> Venture capital firms generally invest in many different companies at once in order to spread out their risk. If you do manage to attract the attention of an investment firm, it will likely be a venture capital firm. In addition, venture capital firms solely focus on companies in the technology sector. They usually invest in 50% or less of the equity of a company. These investments are usually capped at $10 million or less.<\/span><\/li>\n<li style=\"font-weight: 400\"><b>Private equity.<\/b><span style=\"font-weight: 400\"> Private equity firms typically only buy mature companies that are already established. Therefore, funding from a private equity firm is usually not available to a startup. In addition, private equity firms generally buy 100% ownership of the companies in which they invest. As a result, the private equity firm has total control of the company after the investment has been made.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400\">These scenarios are the common cases. There are always exceptions to the rules when it comes to angel investors, private equity firms, and venture capital firms so it is important to research firms carefully before approaching potential investors.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">Business Incubators<\/span><\/h2>\n<p><span style=\"font-weight: 400\">Business incubators are designed to prepare companies for growth by providing guidance and mentorship. They can provide office space, access to financing, business skills training, and professional networks. A business incubator can provide all of the necessary tools that your business needs during the startup phase. <\/span><\/p>\n<p><span style=\"font-weight: 400\">When you join a startup incubator, your business will be physically located in one central workspace alongside many other startup companies. In many cases, the startups in the business incubator also receive venture capital funding from the same investor group. You will be permitted to stay within the space for as long as your business needs to or until it has grown to the scale that it needs to relocate to its own space. <\/span><\/p>\n<p><span style=\"font-weight: 400\">These programs can last for many years depending on the nature of the business and can be valuable for your business, especially if you need help beyond simply finding seed capital for your business. When you join a business incubator, the mentoring usually provided by entrepreneurial investors who&#8217;ve already experienced success. You can also benefit from the shared learning experience as a result of working alongside your startup CEO peers.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">Why Can’t I Just Take Out a Small Business Loan?<\/span><\/h2>\n<p><span style=\"font-weight: 400\">A small business loan is a traditional method for obtaining financing for your business. However, banks tend to be very strict about the businesses that they lend to and likely won’t approve you for a small business loan without a personal guarantee. <\/span><\/p>\n<p><span style=\"font-weight: 400\">That means that you&#8217;ll be left to pay off the debt even if your business fails. In addition, loan repayments are fixed in most cases. That means that you won&#8217;t have the option to adjust your loan payments if you&#8217;ve just opened your business or your sales decline, which can put a serious dent in your cash flow.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">Have an Idea For a Custom App?<\/span>‎<\/h2>\n<p><span style=\"font-weight: 400\">If you want to learn more about what we can do at Achievion to help you build your business, <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400\">contact us<\/span><\/a><span style=\"font-weight: 400\"> today. We’ll chat with you about your app idea and help you draw up a plan for bringing your vision to life.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1100,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[66],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1094"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1094"}],"version-history":[{"count":4,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1094\/revisions"}],"predecessor-version":[{"id":1097,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1094\/revisions\/1097"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1100"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1094"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1094"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1094"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}