{"id":1121,"date":"2017-07-18T13:01:59","date_gmt":"2017-07-18T17:01:59","guid":{"rendered":"http:\/\/achievion.com\/?p=1121"},"modified":"2017-07-20T09:22:43","modified_gmt":"2017-07-20T13:22:43","slug":"3-ways-find-angel-investors-startup","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/3-ways-find-angel-investors-startup.html","title":{"rendered":"3 Ways to Find Angel Investors for Your Startup"},"content":{"rendered":"<p><span style=\"font-weight: 400\">Angel investors have truly opened up the world of technology funding. While traditional lending methods are still viable methods for obtaining seed capital, angel investors have become the holy grail of business funding for most entrepreneurs. <\/span><span style=\"font-weight: 400\"><br \/>\n<\/span><\/p>\n<p><span style=\"font-weight: 400\">According to the <\/span><a href=\"http:\/\/angelresourceinstitute.org\/media-kits.php\"><span style=\"font-weight: 400\">Angel Resource Institute&#8217;s<\/span><\/a><span style=\"font-weight: 400\"> 2016 Annual HALO Report, which provides analysis and trends on US angel and angel group activity, California remains the top state in the U.S. for angel-funded deals. However, angel investors and angel groups are active across the country and internationally, making it possible for you to find angel investors no matter where you live.<\/span><\/p>\n<p><span style=\"font-weight: 400\">Although angel investor activity is growing, if you want to obtain the capital that you need to take your startup to the next level, you&#8217;ll still need to do some leg work. As an entrepreneur, you need to build and develop relationships with potential investors before you ever make a single pitch. To help you get started, here are 3 ways to find angel investors and a few tips to help you ensure that you find the right match in your investors.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">1. Networking<\/span><\/h2>\n<p><span style=\"font-weight: 400\">You need to be patient if you want to find an angel investor. Angel investors don&#8217;t only invest seed capital in your startup, they are also making an investment in you and your employees. As a result, they&#8217;ll want to get to know you before any deals are. That&#8217;s why the best way to find an angel investor is the traditional way: through networking. <\/span><\/p>\n<p><span style=\"font-weight: 400\">Research who the investors are for your industry and get to know the people in your local business community, including attorneys, accountants, and bankers, who may be able to offer a personal introduction to the right connections. You may find that your efforts pay off once you&#8217;re introduced the person who is willing to make an angel investment in your company.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">2. Angel Investor Platforms<\/span><\/h2>\n<p><span style=\"font-weight: 400\">Many entrepreneurs and investors have turned to online websites, such as <\/span><a href=\"https:\/\/angel.co\/\"><span style=\"font-weight: 400\">AngelList<\/span><\/a><span style=\"font-weight: 400\"> or <\/span><a href=\"https:\/\/gust.com\/\"><span style=\"font-weight: 400\">Gust<\/span><\/a><span style=\"font-weight: 400\">. These websites connect entrepreneurs with angel investors who are willing to financially back their startups. These sites work like online dating sites. You&#8217;ll need to create a profile about yourself and your company for angel investors to browse and select companies that interest them. <\/span><\/p>\n<p><span style=\"font-weight: 400\">You can also look at investor profiles to see who&#8217;s invested in startups like yours previously. However, with these sites there is no magic bullet for obtaining funding. Investors will still want to get to know you and they&#8217;ll also likely want recommendations about your company from a trusted source before they decide to do business with you. However, if you are looking to get a better idea of who might be able to help you grow your business, angel investor websites offer a great start.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">3. Angel Associations<\/span><\/h2>\n<p><span style=\"font-weight: 400\">An angel group, or angel network, is a group of angel investors who pool their resources in order to invest in a diverse or larger numbers of companies. Angel groups meet regularly and choose companies to invest in by inviting entrepreneurs to make pitches before their group. <\/span><\/p>\n<p><span style=\"font-weight: 400\">If you want to find angel groups, <\/span><a href=\"https:\/\/www.angelcapitalassociation.org\/\"><span style=\"font-weight: 400\">The Angel Capital Association (ACA)<\/span><\/a><span style=\"font-weight: 400\">, a professional alliance of angel groups in North America, offers a website with a <\/span><a href=\"https:\/\/www.angelcapitalassociation.org\/directory\/\"><span style=\"font-weight: 400\">searchable database<\/span><\/a><span style=\"font-weight: 400\"> of over 400 angel groups. By finding a group in your local area, you can see who you might already have connections to as a result of your current involvement in your local business community.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">Narrowing Down Your Prospects<\/span><\/h2>\n<p><span style=\"font-weight: 400\">While these online resources make it easy to locate a list of names, the real challenge is getting your foot in the door to even pitch any of these individuals or groups. Once you&#8217;ve located some individual angel investors or groups, you&#8217;ll need to ask yourself to following questions to help you narrow down your targets:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400\"><b>What other companies have they invested in? <\/b><span style=\"font-weight: 400\">Angels typically invest in the same types of companies. <\/span><\/li>\n<li style=\"font-weight: 400\"><b>Do you have business relationships with or potential contacts at the funded companies? <\/b><span style=\"font-weight: 400\">Angel investors like when the companies they invest in help each other out. It increases the chances that both ventures will be successful. You can increase the odds that your startup will get funded if you can show that you bring something to the table that might help other companies that the angel investor has funded previously.<\/span><span style=\"font-weight: 400\"><br \/>\n<\/span><\/li>\n<li style=\"font-weight: 400\"><b>What legal or accounting firms does the angel group use? <\/b><span style=\"font-weight: 400\">Getting to know someone at the law firm or accounting firm that the angel investor uses can help you to find contact for a potential introduction or allow you to get a better idea of the ROI that the angel group wants to see in yourself.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400\">Your chances of finding an angel investor who can provide the funding that you need will also be much better if you keep the profile of a typically angel investor in mind:<\/span><\/p>\n<p><span style=\"font-weight: 400\">Angel investors generally have a net worth in excess of $1,000,000. They have prior successful entrepreneurial experience and generally look to invest in industries which they are familiar with. Although some angel investors like to cash out in just a few years, most expect that it will take at least five to seven years before their investments full pay off.<\/span><\/p>\n<p><span style=\"font-weight: 400\">As you can see, finding an angel investor isn&#8217;t the easiest task. however, your efforts will really pay off once you find someone who is interested in investing in your business. In addition to providing the capital that your business needs, the experience and advice an angel investor can provide will be critical to the success of your company.<\/span><\/p>\n<h2><span style=\"font-weight: 400\">Have a &#8220;Money Maker&#8221; App Idea?‎<\/span><\/h2>\n<p><span style=\"font-weight: 400\">If you need help with refining your app idea so that it meets the expectations of potential investors, Achievion Solutions can help. <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400\">Contact us<\/span><\/a><span style=\"font-weight: 400\"> today for a free 30 minute consultation.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1128,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[66],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1121"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1121"}],"version-history":[{"count":5,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1121\/revisions"}],"predecessor-version":[{"id":1126,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1121\/revisions\/1126"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1128"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}