{"id":1243,"date":"2017-10-15T12:10:01","date_gmt":"2017-10-15T16:10:01","guid":{"rendered":"http:\/\/achievion.com\/?p=1243"},"modified":"2017-10-21T14:53:45","modified_gmt":"2017-10-21T18:53:45","slug":"use-ico-fund-app-project","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/use-ico-fund-app-project.html","title":{"rendered":"Should You Use an ICO to Fund Your App Project?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">According to <\/span><a href=\"https:\/\/www.coindesk.com\/ico-tracker\/\"><span style=\"font-weight: 400;\">CoinDesk ICO Tracker<\/span><\/a><span style=\"font-weight: 400;\">, organizations have raised over $1.8 billion through initial coin offerings (ICOs) since January 2017, exceeding the amount of money raised through traditional venture capital investment as of June 2017.<\/span><\/p>\n<p>This method of raising funds for app startups has gained popularity lately in the cryptocurrency world because company issued cryptocoins <span style=\"font-weight: 400;\">offer <\/span>a number of useful features by providing the same anonymity as ordinary cryptocurrency, the potential for subdivision or consolidation, as well as, the ability to be bought and sold on cryptocurrency exchanges.<\/p>\n<p><span style=\"font-weight: 400;\">However, an ICO comes with substantial risks of which security and regulatory compliance are major concerns. Here are a few things to consider to help you decide if you should use an ICO to fund your next app project.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What Is an ICO?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The ICO, short for initial coin offering, is in some ways similar to an initial public offering. The main difference is that in an ICO, a company sells cryptocurrency tokens, also called cryptocoins or Altcoins, instead of stock. Generally, there is a set number of tokens that is sold and a time limit for the sale. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Once the company has reached the set limits, the sale is complete and the owners can then use the tokens to make investments in the company. Tokens can be traded amongst investors and they also have a value that can decrease or increase after the ICO. If the ICO is successful the value of the tokens increases and the largest investors can reap the most benefits, which is similar to the boost in share price that occurs after an IPO.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, unlike stocks, tokens don&#8217;t give their owners an ownership stake in the company that issued the tokens. Instead, each token is actually a smart contract that can have other benefits according to the company&#8217;s terms. For example, <\/span><a href=\"https:\/\/storj.io\/tokensale.html\"><span style=\"font-weight: 400;\">Storj<\/span><\/a><span style=\"font-weight: 400;\"> — a decentralized storage solution — which completed a successful ICO in May 2017, opted to make its tokens exchangeable for storage space on its platform.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Security <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Security is a major concern if you plan to launch an ICO with the best example of a major security failure being the disaster that occurred during the crowdsale of decentralized VC fund, <\/span><a href=\"https:\/\/qz.com\/730004\/everything-you-need-to-know-about-the-ethereum-hard-fork\/\"><span style=\"font-weight: 400;\">DAO<\/span><\/a><span style=\"font-weight: 400;\">. When this ICO took place, a hacker managed to exploit a bug in the code stealing a large chunk of the funds that had been raised to support the development of more than 50 projects on The DAO. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a result, Ethereum was forked into a new software version in order to restore the funds, which lead to a large drop in the price of Ethereum following the fork. In addition, many lawyers argued that the way in which this ICO was set up could make the creator, token holders, exchanges, miners, and even The Ethereum Foundation itself liable for the hack. They also believe that the ICO was not in compliance with the securities laws of several countries.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">ICO Regulations Vary By Country<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">One important thing to keep in mind when deciding if an ICO is right for your company is the fact that an ICO may still be subject to regulations regarding securities. At the present moment, ICOs are subject to regulation in the United States, Canada, and Brazil. The <\/span><a href=\"https:\/\/www.coindesk.com\/securities-exchange-commission-us-securities-laws-may-apply-token-sales\/\"><span style=\"font-weight: 400;\">US Securities and Exchange Commission<\/span><\/a><span style=\"font-weight: 400;\"> has issued a statement saying that the offering and sale of digital tokens &#8220;are subject to the requirements of the federal securities law.&#8221;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, while some countries have continued to allow ICOs while issuing public studies, other countries have placed even further restrictions. <\/span><a href=\"https:\/\/www.cnbc.com\/2017\/09\/04\/chinese-icos-china-bans-fundraising-through-initial-coin-offerings-report-says.html\"><span style=\"font-weight: 400;\">China<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/www.theverge.com\/2017\/9\/29\/16384718\/south-korea-ban-initial-coin-offerings-bitcoin-cryptocurrency-icos\"><span style=\"font-weight: 400;\">South Korea<\/span><\/a><span style=\"font-weight: 400;\">, both of which have outright banned ICOs, have gone as far as to call ICOs vehicles of fraud. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Therefore, if you plan to offer an ICO for your company, it is important that you ensure that your ICO isn&#8217;t illegal and that your company is in compliance with securities laws. In addition, your ICO will need to comply with money laundering regulations, including blocking certain geographies.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Get Funding From Investors Outside of the VC Scope<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Despite the potential risks, ICOs make it possible for projects to get funded that are unattractive to VCs who most often seek out projects that have aggressive profit motives. Now you have an opportunity to raise funds from non-VC investors without having to first achieve the milestones with regard to product delivery and user acquisition that VCs look for.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">ICOs also attract Bitcoin and Ether millionaires who have the funds to invest in new projects and don&#8217;t necessarily want to convert their Bitcoin or Ether wealth to offline currencies, where they will be required to pay capital gains taxes. Given that there is a <\/span><a href=\"http:\/\/www.marketwatch.com\/story\/what-delivered-the-best-return-of-2017s-first-half-bitcoin-and-ethereum-2017-06-28\"><span style=\"font-weight: 400;\">$42 billion total valuation<\/span><\/a><span style=\"font-weight: 400;\"> for Bitcoin and <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2017-07-10\/secret-millions-for-0x00a651d43b6e209f5ada45a35f92efc0de3a5184\"><span style=\"font-weight: 400;\">$23 billion total valuation<\/span><\/a><span style=\"font-weight: 400;\"> for Ether, many analysts speculate that a large portion of these funds are being held in individual wallets, ripe for investment.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Cost Efficiency<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">ICOs are much cheaper than IPOs because they do not require as much documentation. However, if you want your ICO to be successful, you&#8217;ll still need to tackle all of the financial regulation and risk concerns which could still mean that your company incurs substantial costs. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">That said, an ICO has another significant benefit in that the issuance of a cryptocoin is a branding and marketing opportunity to get exposure in itself, which means that you likely won&#8217;t have to spend as much money to gain traction with potential investors if your app idea is something that will peak the interest of individual investors.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">An ICO is also cost-effective in the sense that VC funding often comes along with significant intrusion on the founder&#8217;s original vision for the app. As a result, an ICO will allow you to proceed with the app that you originally intended to build with little to no input from outside voices who only have short-term profits in mind rather than the long-term viability of your product.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Get Funding for Your App<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">At Achievion Solutions, we can help you explore all of the funding options available for your app. If you are interested in learning more about ICOs, contact us today to <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">schedule a free consultation<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1271,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1243"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1243"}],"version-history":[{"count":26,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1243\/revisions"}],"predecessor-version":[{"id":1272,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1243\/revisions\/1272"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1271"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1243"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1243"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1243"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}