{"id":1276,"date":"2017-11-01T15:24:44","date_gmt":"2017-11-01T19:24:44","guid":{"rendered":"http:\/\/achievion.com\/?p=1276"},"modified":"2017-11-08T09:11:38","modified_gmt":"2017-11-08T14:11:38","slug":"blockchain-technology-right-solution-app","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/blockchain-technology-right-solution-app.html","title":{"rendered":"Is Blockchain Technology the Right Solution for Your App?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Blockchain technology is getting a lot of attention right now in the startup world. While Bitcoin currency can still be considered one of the most prominent examples of the application of blockchain, many startups are rushing to find ways to build apps based on blockchain technology, collectively known as decentralized apps (Dapps).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Given that $1.67 billion has already been invested in <\/span><a href=\"https:\/\/www.coindesk.com\/1-6-billion-all-time-ico-funding-climbs-as-record-500-million-invested-in-july\/\"><span style=\"font-weight: 400;\">blockchain projects<\/span><\/a><span style=\"font-weight: 400;\"> via initial coin offerings (ICOs), the market for Dapps is only expected to continue to grow. Clearly, blockchain technology has some very useful applications for a variety of industries, including finance, healthcare, defense, government, law, and energy. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Despite the promise that this technology offers, the truth is that it may or may not be the right solution for your business. Here are the advantages and disadvantages of blockchain that you should consider to help you identify whether your app project is well-suited to blockchain technology.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Key Benefits of Blockchain Technology<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Blockchain has the potential to disrupt many industries which is why it is getting so much buzz. To provide a general overview of what blockchain has to offer, blockchain technology offers some key benefits for apps, namely:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Transparency.<\/b><span style=\"font-weight: 400;\"> Blockchain technology ensures transparency because changes can only be made to a blockchain if the majority of the network agrees to the changes, given that a huge amount of computing power is required in order to make changes to a blockchain server.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Security.<\/b><span style=\"font-weight: 400;\"> The decentralized nature of blockchain technology ensures that it is highly resistant to all types of malicious attacks, including DDoS attacks. Blockchains also lack the single point of failure that often cause traditional apps to crash because blockchain blocks cannot be controlled by a single individual or entity.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>User Empowerment.<\/b><span style=\"font-weight: 400;\"> With a blockchain app, every user retains direct control over all of their information and transaction history. As a result, blockchain has the potential to make identity theft extremely difficult or even obsolete.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Faster Business Transactions. <\/b><span style=\"font-weight: 400;\">Blockchain technology solves two important problems, namely ensuring that no one individual has control over the information stored in the blockchain and avoiding duplicate digital transactions. As a result, transaction validation can occur in just seconds so that there is no waiting time or a need for transaction validation from a centralized authority. It will also automatically block a transaction if the transaction information is corrupted in some way.<\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">Examining the Difficulties of Building Dapps<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">While blockchain technology has some incredible potential, there are also some very real hurdles to building Dapps. As a relatively new technology, the infrastructure to build Dapps remains underdeveloped. There are no stacks in place so blockchain developers must rely on their own custom tools and standards. As of right now, there are still no widely adopted security standards or best practices for developers to follow, although there are projects underway to combat these issues.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Therefore, before you begin building a blockchain app, it is important for you to consider whether your app is really a good fit for the technology. Your needs might just be as well or even better served by traditional relational databases, such as MySQL. Testing and debugging a blockchain app is also infinitely more difficult than performing these actions for a traditional app which could potentially make developing, testing, and supporting a Dapp a lot more expensive than you might think.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition, there are also legal ramifications to consider. Traditional apps that involve contractual agreements or financial transactions currently rely on banks, other heavily regulated organizations, and governments to guarantee the integrity and legality of those transactions. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In contrast, there is no such level of legal backing for blockchains. As a result, most of these compliance-related expenses will fall on your startup. You’ll then have to determine whether or not the potential return on investment will justify these expenses.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Understanding the Approaches to Building Blockchain Apps<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">App development for a blockchain app begins with the same questions that you would have about developing any other app. What problem are you trying to solve? Who are your users? Who is the competition? How will you stand out in the marketplace?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a result, when you choose to build your app on blockchain, it is really just another implementation choice akin to making security, performance, and programming language decisions. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Developing an app on a blockchain generally involves <\/span><a href=\"https:\/\/github.com\/DavidJohnstonCEO\/DecentralizedApplications\/blob\/master\/README.md\"><span style=\"font-weight: 400;\">three main approaches<\/span><\/a><span style=\"font-weight: 400;\">:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Platform Dapps.<\/b><span style=\"font-weight: 400;\"> Building a platform Dapp involves building a new blockchain and token system. Real world examples of projects of this type include <\/span><a href=\"https:\/\/ethereum.org\/\"><span style=\"font-weight: 400;\">Ethereum<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/bitcoin.org\/\"><span style=\"font-weight: 400;\">Bitcoin<\/span><\/a><span style=\"font-weight: 400;\">, which are blockchain platforms that developers can build their own projects on. This is the best solution if you want other developers to be able to use your platform to build their own apps and services.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Software Dapps.<\/b><span style=\"font-weight: 400;\"> Software Dapps utilize pre-existing blockchain platforms, such as Ethereum. This is the best option if you want to use an app to address a specific problem. However, using an existing platform means that you will have to accept that bugs and limitations of that platform. A real world example of a Software Dapp is <\/span><a href=\"https:\/\/golem.network\/\"><span style=\"font-weight: 400;\">Golem<\/span><\/a><span style=\"font-weight: 400;\">, which runs on the Ethereum platform.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Specialized Software Dapps. <\/b>A <span style=\"font-weight: 400;\">Specialized Software Dapp has the ability to integrate with other blockchain apps or protocols. A real world example of a Specialized Software Dapp is the cloud-storage app <\/span><a href=\"https:\/\/storj.io\/\"><span style=\"font-weight: 400;\">StorJ<\/span><\/a><span style=\"font-weight: 400;\">. With this approach, you&#8217;ll get the benefits of using blockchain while also being able to leverage the features of the blockchain&#8217;s open-source community projects.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">If you’re just getting started, it may take some time for you to evaluate all of the potential options and approaches to building a blockchain app. You’ll also need to determine whether or not your app project meets the criteria that make it a good candidate for blockchain.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Hire Experienced Blockchain Developers<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">With such a wide-range of possibilities, it&#8217;s no wonder that blockchain has the potential to become a revolutionary technology that will change the way that apps are built. However, building a blockchain-powered app requires a high level of expertise. As a result, hiring app developers who have experience with blockchain technology is the best choice. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">At Achievion, we have blockchain app developers with solid experience in designing and building distributed software and apps. Our team can guide you in recognizing new opportunities for your business with blockchain and help you to determine how to best implement your app project idea. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you&#8217;re ready to explore the possibilities of the blockchain for your app, <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">contact us today<\/span><\/a><span style=\"font-weight: 400;\"> and let&#8217;s schedule a time to discuss your project.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1285,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1276"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1276"}],"version-history":[{"count":7,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1276\/revisions"}],"predecessor-version":[{"id":1284,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1276\/revisions\/1284"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1285"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1276"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1276"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1276"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}