{"id":1339,"date":"2018-01-15T15:51:24","date_gmt":"2018-01-15T20:51:24","guid":{"rendered":"http:\/\/achievion.com\/?p=1339"},"modified":"2018-02-21T21:32:12","modified_gmt":"2018-02-22T02:32:12","slug":"relationship-big-data-machine-learning","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/relationship-big-data-machine-learning.html","title":{"rendered":"What Is the Relationship Between Big Data and Machine Learning?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Big data is the world’s most valuable resource but how can we truly understand it and what can it be used for? Due to the increased penetration of technology into the modern world, the amount of data that has been produced has skyrocketed.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Several research firms agree that the size of the digital universe will continue to double every two years, creating exponential data growth toward 2020 and beyond. These vast volumes of data make up what has been termed &#8216;Big Data&#8217; where data about individuals, groups, and periods of time are combined into larger groups or longer periods of time.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">&#8220;Data is clearly the new oil,&#8221; says <\/span><a href=\"http:\/\/www.cbc.ca\/news\/technology\/data-is-the-new-oil-1.4259677\"><span style=\"font-weight: 400;\">Jonathan Taplin<\/span><\/a><span style=\"font-weight: 400;\">, director emeritus of the USC Annenberg Innovation Lab and the author of Move Fast and Break Things: How Google, Facebook and Amazon Cornered Culture and Undermined Democracy. It may seem very exciting to imagine the potential of all of this data. Now machine learning is helping to transform that potential into real-life use cases.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here is a brief look into the value of machine learning in big data analytics and a few applications of this methodology that have the potential to transform entire industries in the coming years.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What Is Machine Learning?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Machine learning is a branch of artificial intelligence that involves allowing an algorithm to learn the model via trial and error rather than by having a programmer write a specific formula that is designed to produce a specific outcome. The algorithm is then capable of refining itself as new data becomes available. Machine learning not a subdiscipline of data science. In fact, it is actually a tool or method of doing data science more efficiently. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Machine learning requires data and the more data that is available the better. In fact, training a machine learning algorithm on a small or unrepresentative data set will actually yield biased results. Although, big data and machine learning are not directly related, they can have some real benefits when used together. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Where Machine Learning Offers an Advantage<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There are generally three scenarios in which big data and machine learning intersect to deliver exceptional results:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>The data set is too large to be processed by a human expert.<\/b><span style=\"font-weight: 400;\"> Sometimes the value of data diminishes over time. By the time a team of human analysts has the opportunity to work through it, it has aged past the point of being useful. In other cases, the data might be flowing into a system too rapidly for it to be processed. <\/span><\/li>\n<li style=\"font-weight: 400;\"><b>There is ambiguity in the data set. <\/b><span style=\"font-weight: 400;\">While machine learning is not yet capable of dealing with uncertainty and inconsistency in a system to the same level that a human expert might be able to, it has been able to draw some meaningful conclusions from ambiguous data.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Programming a specific solution is impossible or impractical. <\/b><span style=\"font-weight: 400;\">In some cases, the code that would be needed to address a specific solution is so large that programming it would be highly inefficient or impossible. In these cases, machine learning offers a viable alternative.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">All of these scenarios indicate that the calculation model for analyzing a large data should be adjusted accordingly to adapt to changes. In order to address these concerns, developers can implement distributed computing by using big data technologies, such as Apache Mahout, R-Hadoop, or Spark. Then the output is fed to machine learning algorithm for modeling or learning generation.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What Kinds of Big Data Problems Can Be Solved by Machine Learning?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In practice, there are many use cases for machine learning in processing large volumes of data. Here are some examples of applications that have already been deployed:<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Data Security<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Malware is a major global problem. In 2017, <\/span><a href=\"https:\/\/securelist.com\/ksb-overall-statistics-2017\/83453\/\"><span style=\"font-weight: 400;\">Kaspersky Lab<\/span><\/a><span style=\"font-weight: 400;\"> said that it had detected 15,714,700 unique malicious objects. However, Deep Instinct, an institutional intelligence company found that each piece of new malware has roughly the same code as previous versions. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The only difference was 2-10% variations. Applying machine learning to these malware file data sets can quickly detect which files are malware with a high level of accuracy. In other instances, machine learning algorithms can look for patterns in how cloud data is accessed in order to report anomalies that could potentially be security breaches.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Financial Trading<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The finance industry, as well as, individuals around the world who trade want to be able to predict what financial markets will do in the future in order to turn a profit. Nearly all of the top trading firms already use proprietary systems to predict and execute trades at high speeds and high volume. Machine learning makes it possible for these algorithms to process large quantities of data at the speed required to execute even low probability trades that could turn a huge profit.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Public Health<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Machine learning can be used to uncover the risk factors for disease in large populations. In fact, the company, Medecision, has already developed an algorithm that was able to identify eight variables for predicting avoidable hospitalizations in diabetes patients.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Marketing Personalization<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Understanding customers’ behavioral patterns in order to figure out the triggers that lead to sales is still a major hurdle for the marketing industry. Machine learning can help companies to better understand their customers in order to deliver more personalized brand experiences to them. According to <\/span><a href=\"https:\/\/www.mckinsey.com\/business-functions\/digital-mckinsey\/our-insights\/marketings-holy-grail-digital-personalization-at-scale\"><span style=\"font-weight: 400;\">McKinsey<\/span><\/a><span style=\"font-weight: 400;\">, personalization can reduce acquisition costs by as much as 50% and lift revenues by up to 15% while increasing the efficiency of marketing spend by as much as 30%.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The Future of Machine Learning and Big Data<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Currently, the size of global markets for machine learning based solutions is limited. However, as big data analysis is applied to machine learning procedures, machines and devices will become smarter which will allow them to perform better. As the performance of these systems improve, market adoption will increase, thus creating a larger demand for these solutions in many industries.<\/span><\/p>\n<p><b>Are you ready to take on the future? <\/b><span style=\"font-weight: 400;\">Achievion can help your company excel in a changing world. Contact us and let&#8217;s discuss how we can design an integrated machine learning solution that will perform as expected and can be re-trained as needed. <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">Set up a free consultation today<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1351,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[85,83],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1339"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1339"}],"version-history":[{"count":12,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1339\/revisions"}],"predecessor-version":[{"id":1457,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1339\/revisions\/1457"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1351"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1339"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1339"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1339"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}