{"id":1443,"date":"2018-02-15T15:33:36","date_gmt":"2018-02-15T20:33:36","guid":{"rendered":"http:\/\/achievion.com\/?p=1443"},"modified":"2018-02-21T21:30:07","modified_gmt":"2018-02-22T02:30:07","slug":"5-use-cases-machine-learning-software-development","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/5-use-cases-machine-learning-software-development.html","title":{"rendered":"5 Use Cases for Machine Learning in Software Development"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Machine learning represents a new era in software development where computers, gadgets, and other devices no longer require special programming in order to complete tasks. While we are just at the beginning of the formation of machine learning technology, machine learning has already become a reality that we are experiencing the effects of. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A September 2017 research report by <\/span><a href=\"http:\/\/markets.businessinsider.com\/news\/stocks\/Machine-Learning-Market-Worth-8-81-Billion-USD-by-2022-1002371256\"><span style=\"font-weight: 400;\">MarketsandMarkets<\/span><\/a><span style=\"font-weight: 400;\"> predicts the machine learning market will grow to $8.81 billion by 2022. Developing software or an app and providing it with machine learning algorithms can make a significant difference in your business and establish your company as a market leader. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To help you understand the potential for market leadership with machine learning, here are 5 use cases for machine learning in software development and the brands that are benefiting from it.  <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Online Search<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Online search is perhaps the most famous use case of machine learning. Google and its competitors are using machine learning to improve the way in which the search engines deliver results. While Google&#8217;s core algorithm is not machine learning-based, the company has <\/span><a href=\"https:\/\/searchengineland.com\/google-uses-machine-learning-search-algorithms-261158\"><span style=\"font-weight: 400;\">confirmed<\/span><\/a><span style=\"font-weight: 400;\"> that machine learning is used as a part of its ranking system signals.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Data Security<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">With huge amounts of data being generated and transferred over networks, it is becoming increasingly difficult for cybersecurity experts to monitor everything. As a result, some potential threats and even actual breaches have gone unnoticed until it is too late. The solution to this problem may lie in attended machine learning to avoid false positives and alerts. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In fact, Finnish security vendor <\/span><a href=\"https:\/\/www.f-secure.com\"><span style=\"font-weight: 400;\">F-Secure<\/span><\/a><span style=\"font-weight: 400;\"> is already taking a bet on this model with its <\/span><a href=\"https:\/\/www.f-secure.com\/en\/web\/business_global\/rapid-detection-service\"><span style=\"font-weight: 400;\">Rapid Detection Service<\/span><\/a><span style=\"font-weight: 400;\">. It&#8217;s goal is to reduce the amount of time it takes organizations to discover a breach. The system gathers data from a combination of software installed on customer workstations and network sensors. The data is then analyzed using machine learning in order to distinguish normal behaviors from anomalies. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Fraud Detection<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The rise of chargebacks, botnet attacks, and identity theft is leading companies to look beyond using data that is publicly available to identify their customers. As a result, machine learning is being looked as means of deploying more intelligent fraud detection by using user behavior rather than publicly available identification information to detect anomalies. <\/span><\/p>\n<p><a href=\"https:\/\/newsroom.mastercard.com\/press-releases\/mastercard-rolls-out-artificial-intelligence-across-its-global-network\/\"><span style=\"font-weight: 400;\">Mastercard’s Decision Intelligence<\/span><\/a><span style=\"font-weight: 400;\"> is a real-time authorization decisioning solution that applies thousands of data points and sophisticated modeling techniques to help increase the accuracy of approvals of genuine transactions. Mastercard has deployed the technology across its global network with the aim of reducing fraudulent transactions. It works by assigning a score to every transaction, which is then used to help judge future payments.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, false declines remain a huge problem for the industry. According to a <\/span><a href=\"https:\/\/www.javelinstrategy.com\/press-release\/false-positive-card-declines-push-consumers-abandon-issuers-and-merchants\"><span style=\"font-weight: 400;\">2015 study<\/span><\/a><span style=\"font-weight: 400;\"> by the research consulting firm Javelin, about 15% of all cardholders have experienced a false decline for a legitimate purchase. Of these cardholders, nearly 40% abandoned their card for the purchase after the false decline.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Healthcare<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Machine learning algorithms are capable of spotting patterns more than their human counterparts. As a result, machine learning can be used in healthcare to identify trends in disease for large populations. Machine learning has also been proven to be effective for diagnosis in medical imagine. Several projects, including <\/span><a href=\"https:\/\/www.ibm.com\/watson\/health\/\"><span style=\"font-weight: 400;\">IBM&#8217;s Watson<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/www.microsoft.com\/en-us\/research\/project\/medical-image-analysis\/\"><span style=\"font-weight: 400;\">Microsoft&#8217;s InnerEye<\/span><\/a><span style=\"font-weight: 400;\"> are currently exploring the use of machine learning in healthcare.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, a challenge of using machine learning in healthcare is a &#8220;black box problem&#8221; where the machine learning algorithm can not provide an explanation as to how it arrived at a diagnosis even when it is correct. That makes the use of machine learning more challenging in healthcare because doctors do not want to make vital decisions without a firm understanding of how the algorithm arrived at its conclusion.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Marketing Personalization<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The more that marketers understand about their customers, the better they can serve them. A <\/span><a href=\"https:\/\/www.mckinsey.com\/business-functions\/mckinsey-analytics\/our-insights\/the-age-of-analytics-competing-in-a-data-driven-world\"><span style=\"font-weight: 400;\">recent McKinsey study<\/span><\/a><span style=\"font-weight: 400;\"> uncovered that “U.S. retailer supply chain operations who have adopted data and analytics have seen up to a 19% increase in operating margin over the last five years.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a result, marketing personalization can reveal patterns about how customers interact with a brand by analyzing a combination of third-party data and customer behavior data. In addition, these algorithms can react to data in real-time in order to provide more customized and relevant content and offers.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Marketers can also deploy machine learning algorithms that analyze consumers&#8217; online activity and compare it with millions of other users in order to determine what users might be interested in buying next. These algorithms become smarter over time and the recommendations become more personalized which increases the likelihood that the recommendations will result in more sales.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Using historical customer purchasing data, machine learning algorithms can also help to increase sales for a brand by predicting when certain customers will need to purchase certain products. For example, consider a customer who shops online for groceries and buys certain products at approximately the same time every week or month. This rule is identified and validated by the algorithm so that the company can send these individuals reminders to purchase these items again.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In fact, Target saw <\/span><a href=\"https:\/\/shift.newco.co\/how-to-use-machine-learning-to-sell-better-8f909ab425b4\"><span style=\"font-weight: 400;\">15-30% revenue growth<\/span><\/a><span style=\"font-weight: 400;\"> through their use of predictive models based on machine learning. Target used trends that indicate pregnancy among its customers to send coupons related to pregnancy and parenting to customers whose buying patterns fit the model.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Smart Implementation of Machine Learning<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In the past few years, machine learning applications have topped the list of technology projects for funding and press. With all of this excitement, we at Achievion have found that most executives are having a hard time figuring out exactly what role machine learning should play in their businesses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We&#8217;ve written this article not to provide a complete catalog of potential applications but to highlight how current and future uses of machine learning have the potential to transform your organization.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With this in mind, we invite you to see how Achievion can help deliver a productivity boost to your machine learning endeavors. <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">Contact us today<\/span><\/a><span style=\"font-weight: 400;\"> to request a free consultation and let&#8217;s discuss your project.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1455,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[85],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1443"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1443"}],"version-history":[{"count":7,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1443\/revisions"}],"predecessor-version":[{"id":1456,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1443\/revisions\/1456"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1455"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1443"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1443"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1443"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}