{"id":1621,"date":"2018-05-14T14:49:19","date_gmt":"2018-05-14T18:49:19","guid":{"rendered":"http:\/\/achievion.com\/?p=1621"},"modified":"2018-05-14T19:07:58","modified_gmt":"2018-05-14T23:07:58","slug":"potential-pitfalls-smart-contracts","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/potential-pitfalls-smart-contracts.html","title":{"rendered":"What Are the Potential Pitfalls of Smart Contracts?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Smart contracts represent the next step in the evolution of blockchain technology from a transaction protocol to a utility with many use cases. Smart contracts provide a worthwhile solution in instances where there are frequent transactions that occur among several parties along with a variety of manual tasks or duplicative tasks that would otherwise be performed by third-party intermediaries. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, implementing smart contracts also comes with a number of risks. It is important to understand these considerations when evaluation potential applications for your business. Here are the potential pitfalls of smart contracts that you should be aware of.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">No Standardization<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Currently, there are no standards that smart contract protocols must adhere to. With a range of languages for smart contracts, including Solidity, C#, and Java, smart contracts must become standardized if they are to become more mainstream.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">While this is something that the entire industry must work toward, getting developers on board is a serious limitation at this point. Even the most well-known and well-funded blockchain <\/span><span style=\"font-weight: 400;\">projects are struggling to find developers who are proficient in Solidity, Ethereum&#8217;s contract-oriented programming language for writing smart contracts.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Unintended Consequences After Deployment<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In order to protect your business, you have to be 100% sure that your smart contracts can not be undertaken by using legally binding traditional contract mechanisms. Remember, smart contracts can not be modified after they are deployed. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a result, your business will be left to deal with unexpected behaviors or unintended consequences of the smart contract. One way you could try to protect your business from these issues is to include get-out or cessation clauses within the smart contract. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, unless you&#8217;re explicit in regards to the parties that are permitted to invoke them you could also create unintended consequences that result in your business becoming more vulnerable to exploitation. Therefore, you must make certain that the code of a smart contract has been extensively tested before the smart contract is deployed.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A prime example of a smart contract failure occurred in 2016 when the Decentralized Autonomous Organization (DAO) announced that a hacker triggered a recursive send vulnerability in an Ethereum smart contract which resulted in a <\/span><a href=\"https:\/\/www.gartner.com\/smarterwithgartner\/why-blockchains-smart-contracts-arent-ready-for-the-business-world\/\"><span style=\"font-weight: 400;\">total loss of $150 million<\/span><\/a><span style=\"font-weight: 400;\"> and the birth of the first Ethereum fork. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Security Vulnerabilities<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">While the address and code of a smart contract can not be modified since it is permanently written on the blockchain, there are security vulnerabilities that can put the execution of a smart contract at risk. Given that it could take literally thousands of years to uncover all of the potential vulnerabilities of smart contracts, security is paramount.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition to the DAO attack, in July 2017, users of the <a href=\"https:\/\/twitter.com\/ParityTech\/status\/927850992145719296\">Parity wallet were exposed to a hack<\/a> which ended up costing users about 30 million dollars. This was the result of a combination of both insecure visibility modifiers, as well as, the misuse of <\/span><i><span style=\"font-weight: 400;\">delegate<\/span><\/i><span style=\"font-weight: 400;\"> call with arbitrary data. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A user managed to remove the library code which froze the funds in all Parity multi-sig wallets deployed after July 20, 2017. This hack is only one of many examples of the <\/span><a href=\"https:\/\/medium.com\/loom-network\/how-to-secure-your-smart-contracts-6-solidity-vulnerabilities-and-how-to-avoid-them-part-1-c33048d4d17d\"><span style=\"font-weight: 400;\">known exploits in the Solidity code<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While a hard fork is often recommended for reversing the consequences of a hack, the potential legal ramifications are enormous. In addition, a hard fork might not work in every instance, especially if the developers can not gain a consensus in favor of a hard fork. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Smart Contracts May Not Be Legally Enforceable<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">When it comes to contract law, in most countries the concept of a &#8220;smart contract&#8221; simply does not exist. That is because smart contracts by nature can not deal with ambiguity which is a major reason why they may not be considered as legally enforceable in many jurisdictions.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some of the issues that smart contracts present are ones that the contract law has not yet determined. For example: Who are the parties? What was the exact agreement? Was there mutual consideration? Did a strategic breach of contract occur? Were there good faith efforts to mitigate or excuses made for a breach? Did the smart contract only deliver partial performance?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition, a contract might also be considered void if it contains provisions that are in direct violation of existing public policy. In fact, <\/span><a href=\"https:\/\/blockchainatberkeley.blog\/should-smart-contracts-be-legally-enforceable-599b69f73aea\"><span style=\"font-weight: 400;\">Andrew Glidden<\/span><\/a><span style=\"font-weight: 400;\">, a JD student at the University of California, Berkeley, argues that smart contracts should not be considered as contracts but simply evidence that a contract exists.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The Race to Connect Smart Contracts to the Real World<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Although there are many issues that still need to be resolved with smart contracts, all of these drawbacks are evidence of a technology that is still in its early stages. Smart contracts still offer many advantages including speed, the lack of potential third-party interference, reliability, time and cost savings, and the removal of the human error factor. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Naturally, many other businesses have already come to the same conclusion: the potential benefits of smart contracts vastly outweigh the risks. That means the time to hire smart contract developers is now. With the right approach, your business can start to reap the benefits of smart contracts in the near future.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We here at Achievion are world-class at helping connect you with the blockchain development talent that you need to grow. Just <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">fill out our contact form<\/span><\/a><span style=\"font-weight: 400;\">, and we&#8217;ll be happy to review your project to see if we can help!<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1642,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1621"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1621"}],"version-history":[{"count":20,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1621\/revisions"}],"predecessor-version":[{"id":1643,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1621\/revisions\/1643"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1642"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1621"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1621"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1621"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}