{"id":1676,"date":"2018-05-28T06:21:20","date_gmt":"2018-05-28T10:21:20","guid":{"rendered":"http:\/\/achievion.com\/?p=1676"},"modified":"2018-05-23T10:59:20","modified_gmt":"2018-05-23T14:59:20","slug":"public-vs-private-blockchain-differences","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/public-vs-private-blockchain-differences.html","title":{"rendered":"Public vs Private Blockchain: These Are the Differences"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">If you are looking into an application of blockchain or distributed ledger technology for your organization, then it is essential for you to understand the differences between public and private blockchains.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Recently, an <\/span><a href=\"https:\/\/securityintelligence.com\/news\/ibm-study-blockchain-adoption-on-the-rise\/\"><span style=\"font-weight: 400;\">IBM study<\/span><\/a><span style=\"font-weight: 400;\"> found that one-third of C-level executives are using or considering adopting blockchain technology in their organizations.<\/span> <span style=\"font-weight: 400;\">As more organizations start to roll out their own blockchain networks, it is inevitable that blockchains will directly or indirectly influence every aspect of the organization&#8217;s operations.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">While both public and private blockchains have things in common being that that they are both decentralized peer-to-peer networks, use consensus, and provide some level of guarantee with regard to the immutability of the ledger, there are some significant differences.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here is an overview of the most important differences between public versus private blockchains.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Public Blockchain<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A public blockchain is permission-less and all of the transaction data is accessible to everyone without exception. Anybody can download the blockchain and view its entire history. Public blockchains work best in a trust-less environment.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">All Participants Are Known <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Public blockchains allow anyone to join and participate in the blockchain. Public blockchains often feature incentives that encourage people to join the network. As a result, the number of participants may grow over time indefinitely. In addition, on public blockchains that allow smart contracts, such as Ethereum, anyone can develop and run a decentralized app (dApp). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, public blockchains can develop a tendency towards centralization. For example, the <\/span><a href=\"https:\/\/www.buybitcoinworldwide.com\/mining\/pools\/\"><span style=\"font-weight: 400;\">top 5 mining pools own larger than 81%<\/span><\/a><span style=\"font-weight: 400;\"> of the total hash power in the Bitcoin network. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Total Consensus Required for Updates<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">With universal access to the public blockchain&#8217;s transaction data, public blockchains leave few opportunities for later changes to be made. In order to changes the rules, the community needs to come to a consensus among every single participant in order to make updates. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Scalability Based on the Number of Nodes<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Public blockchains rely on a substantial amount of computational power in order to scale. This is due to the fact that majority of public blockchains depend on proof of work, which is a complex cryptographic problem that each node within the network must solve, in order to achieve consensus. As a result, public blockchains can become slow and highly inefficient.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Private (Permission-based) Blockchain<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Unlike public blockchains, private blockchains operate in the same fashion as a centralized organization. The entity that owns the blockchain is responsible for giving participants the power to participate in a range of activities. It will also play a role in maintaining the blockchain. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Private blockchains offer some unique features including:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Different permission levels<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Control over the level of exposure of the transaction data to the public<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Control over membership<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The ability to decide when updates are made<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The option to run the blockchain as a stand-alone system or integrated within an existing system<\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Greater Scalability and Efficiency<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Throughput is the measure of the number of transactions that are processed in a certain period of time. In the context of blockchain, throughput refers to the average number of transactions are the are appended to blocks within the blockchain per second.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Private blockchains provide much higher throughput as compared to most public blockchains because their consensus design does not have to include incentives for all participants. As a result, the scalability of a private blockchain focuses on throughput instead of the number of nodes.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Private Blockchains Depend on Trust<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">It&#8217;s important to understand that the permissioning feature of private blockchains that limits access to transaction data is not a built-in security feature. In fact, this feature actually makes private blockchains insecure unless there is a high level of trust among the members. That is because the publicly available transaction data can be altered by leading members. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This is important because the key advantage of blockchain technology lies in decentralization. Decentralization is what makes the blockchain censorship-free. However, for certain applications it is simply not reasonable or safe for all transactions to be exposed to the public.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Consortium Blockchains<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Consortium blockchains are a subset of private blockchains. This simply means that the consensus mechanism for the blockchain is predefined by the leaders or owners of the blockchain network. As an example, consider a scenario in which a group of financial institutions must provide consensus in order for transactions on a blockchain to be considered valid. The consensus mechanism may require that 7 out 10 banks approve the transaction. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This scenario facilitates compliance in that it can allow for regulatory bodies to become a part of the consortium. As a result, private blockchains are ideal for applications in which the leading organization is required to submit to regulatory authority.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Not A One-Size-Fits-All Solution<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Given the sensitive nature of some data, private blockchains are the clear choice for institutions.  However, private blockchains are not a one-size-fits-all solution for restricting access to transaction data. As a result, priorities and problems will need to be analyzed in order to design a blockchain that is specifically designed to serve these demands.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As an example, the access control mechanism for a private blockchain can vary: existing participants to be given the control to decide on which future entrants are allowed to join the blockchain. On the other hand, participants may be required to obtain licenses for participation from a regulatory authority. Finally, a consortium could make the decisions regarding allowed participants and governance.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a result, the solution that is ideal for an organization may depend on the exact industry that the organization is in. In some cases, a minimal degree of private control is helpful while in other cases a strict governance model may need to be created.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The Next Step to Implementing Blockchain-based Solutions<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">With a growing need for faster transaction authentication and settlement while minimizing error rates, the blockchain market will experience significant growth. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In fact, the global blockchain market is expected to worth $7.59 billion by 2024, according to a <\/span><a href=\"https:\/\/www.grandviewresearch.com\/press-release\/global-blockchain-technology-market\"><span style=\"font-weight: 400;\">report by Grand View Research<\/span><\/a><span style=\"font-weight: 400;\">. Due to the rapidly progressing digitization of most industries, it can be assumed that blockchain will become a major component of your innovation strategy.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">At the moment, there is also a high demand for blockchain developers, which is why you need to start establishing your strategic advantages now. At Achievion, we can help you learn more about public versus private blockchains, as well as, their potential applications for your business. <\/span><\/p>\n<p><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">Contact us today<\/span><\/a><span style=\"font-weight: 400;\"> to schedule a consultation and complete review of your upcoming blockchain project.<\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1686,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1676"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1676"}],"version-history":[{"count":9,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1676\/revisions"}],"predecessor-version":[{"id":1685,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1676\/revisions\/1685"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1686"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1676"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1676"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1676"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}