{"id":1714,"date":"2018-06-04T17:16:18","date_gmt":"2018-06-04T21:16:18","guid":{"rendered":"http:\/\/achievion.com\/?p=1714"},"modified":"2018-06-05T10:22:42","modified_gmt":"2018-06-05T14:22:42","slug":"choosing-right-governance-model-enterprise-blockchain","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/choosing-right-governance-model-enterprise-blockchain.html","title":{"rendered":"Choosing the Right Governance Model for Your Enterprise Blockchain"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Blockchains are complex systems made up of inputs from multiple parties. In addition, the blockchain is constantly evolving in order to integrate new technology, improve network efficiency, and patch vulnerability. However, how these factors should come together to alter and maintain the blockchain is a matter of governance.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What Is Blockchain Governance?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Block governance refers to all of the actions that are involved in the decision-making processes surrounding creating, updating, and revising the rules surrounding an enterprise blockchain. These rules can involve code, such as smart contracts. They can also involve laws, processes, or blockchain member responsibilities.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Why Blockchain Governance Matters<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In the future, enterprise blockchain offers the opportunity to create vastly different power structures within your business unlike the highly centralized models of today that do not serve in the best interests of all parties. In fact, a completely centralized system defeats the purpose of using blockchain in the first place. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When it comes to enterprise blockchain, most things shouldn&#8217;t be a democracy. Establishing effective blockchain governance is essential for mitigating conflicts over blockchain protocols. However, the success of any blockchain governance depends entirely on the desired outcomes of the organization for the the blockchain. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition, with the rapid pace at which blockchain technology is moving, establishing the right governance model for your enterprise blockchain is essential to your company&#8217;s success.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">From our experience here are some of the factors you should consider when choosing your enterprise blockchain governance model:<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Who Do You Want to To Join the Network?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In an enterprise blockchain, there are restrictions on who has the authority to join the network and make changes to the ledger. As a result, these parties are generally organized into three groups:<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Readers<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Readers are the lowest on the spectrum of permissioned parties and are generally giving this role for the purpose of viewing data without the ability to modify the ledger.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Writers<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">For mid-level of permissioned user types, writers have the ability to both read and write data to the ledger. However, a writer is not granted permission to add new members to the blockchain or change the current access permissions of existing members.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Operators<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">These are the highest-level users of the consortium, with the ability to grant access to new members. In enterprise blockchains, operators may be restricted to a specific group or organization. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition, blockchains may or may not be set up to grant all operators equal voting rights when it comes to making decisions about allowing new members to join the network.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Should All Members Have Equal Power?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A <\/span><a href=\"https:\/\/www.ibm.com\/blogs\/blockchain\/2018\/02\/who-has-the-power-in-enterprise-blockchains\/\"><span style=\"font-weight: 400;\">recent IBM article<\/span><\/a><span style=\"font-weight: 400;\"> discussed the challenges that come with permissioned blockchains and identified two models for assigning members within a blockchain. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In the United Nations Model, all members are added to the network as operators where they share equal voting rights. This model works best when the network is small and the members have all been carefully vetted. The main drawback to this model is that blockchain processes can be stalled by a single vote. In addition, managing the size of the network and communication issues could create scalability concerns as the network grows.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, there is another model to consider, the Benevolent Dictator Model, which assigns only a few members as operators while giving all other members lower permission-levels. While the operator is responsible for publishing the governance model, all members are required to review and approve or decline the governance model. In the event that a member decides not to approve a decision, they have the ability to create their own blockchain network.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Finally, a Watchdog Hybrid Model works across both the United Nations Model and Benevolent Dictator Model as a means of mitigating the risk of transactions that fail to meet established regulations. Thus, this model creates the role of the auditor in order to ensure that all transactions are valid and accurate.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Incentives<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Within a blockchain, each group also has its own incentives. However, these incentives are not always completely aligned with the other groups in the system. For example, the groups may propose changes that are primarily advantageous for their own group. According to <\/span><a href=\"https:\/\/medium.com\/@FEhrsam\/blockchain-governance-programming-our-future-c3bfe30f2d74\"><span style=\"font-weight: 400;\">Fred Ehrsam<\/span><\/a><span style=\"font-weight: 400;\">, co-founder of Coinbase, the calls for changes typically manifest when there is a change in the reward structure of the blockchain or balances of power.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">On-chain Governance<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Enterprise blockchains may opt to handle these change requests through a combination of offline coordination, as well as, online modifications. In addition, there is the option of an on-chain governance system which works solely online by making code updates. The main benefit of on-chain governance is that it can produce faster turnaround times for changes. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In fact, <\/span><a href=\"https:\/\/www.hyperledger.org\/announcements\/2018\/01\/30\/hyperledger-releases-hyperledger-sawtooth-1-0\"><span style=\"font-weight: 400;\">Hyperledger Sawtooth<\/span><\/a><span style=\"font-weight: 400;\"> is one of the blockchain platforms that offers on-chain governance, which means that this a feature that enterprises already have access to in implementing a private blockchain for business.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Hybrid Governance Models<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In conclusion, most companies that require enterprise blockchains will likely end up implementing a hybrid governance model. That means that the blockchain contains features of both permissioned, as well as, permissionless blockchain governance styles. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The main benefit of this approach is that it does not consolidate power within only one organization. That allows companies to also serve a wider range of blockchain members by allowing or restricting access to the blockchain per the company&#8217;s needs.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Let&#8217;s Talk<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">We&#8217;ve written quite a bit already about how blockchain is transforming industries right now. The next step would be to start planning your enterprise blockchain now. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, if you would prefer to have an expert help, <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">contact us today<\/span><\/a><span style=\"font-weight: 400;\"> for a review of your project. We can help you make realistic decisions on how to implement blockchain for your business.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1724,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1714"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1714"}],"version-history":[{"count":8,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1714\/revisions"}],"predecessor-version":[{"id":1723,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1714\/revisions\/1723"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1724"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1714"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1714"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1714"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}