{"id":1770,"date":"2018-06-18T04:52:12","date_gmt":"2018-06-18T08:52:12","guid":{"rendered":"http:\/\/achievion.com\/?p=1770"},"modified":"2018-07-03T08:35:14","modified_gmt":"2018-07-03T12:35:14","slug":"ai-business-hype-vs-reality","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/ai-business-hype-vs-reality.html","title":{"rendered":"AI for Business: Hype vs Reality"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Startups and tech giants alike have all hopped aboard the AI hype train with the goal of making AI for business a reality. While there is plenty of hype, the reality is a lot more complicated. Here is why AI is currently receiving so much hype and the current state of AI for business.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The AI Hype Machine<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Many technologists see the rise of AI as inevitable. Companies that have access to massive amounts of data, such as Google, Facebook, and Amazon, are making headlines for their technological advances that wouldn&#8217;t have even been possible just 10 years ago. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">These innovations include personalized recommendations, voice-controlled personal assistants, and self-driving cars. As a result of these highly visible consumer-facing implementations of AI, the hype has naturally extended to the promise of AI for all aspects of business.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The past few years have marked the start of a new hype cycle in AI. However, many of the recent advancements of AI for business are actually impacting industries like healthcare, finance, and cybersecurity.<\/span><\/p>\n<p><a href=\"https:\/\/www.gartner.com\/newsroom\/id\/3810968\"><span style=\"font-weight: 400;\">Gartner’s latest CIO survey<\/span><\/a><span style=\"font-weight: 400;\"> of 3,160 CIOs from 98 countries, found that 21% of CIOs are already piloting AI initiatives or have short-term plans for them. Another 25% have medium- or long-term plans. Accenture also lists AI as a top strategic trend in their report <\/span><a href=\"https:\/\/www.accenture.com\/us-en\/insight-technology-trends-2018\"><span style=\"font-weight: 400;\">Technology Vision 2018<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In one of the largest M&amp;A deals in AI, Roche Holding acquired NY-based <\/span><a href=\"https:\/\/www.cbinsights.com\/company\/flatiron-health\"><span style=\"font-weight: 400;\">Flatiron Health<\/span><\/a><span style=\"font-weight: 400;\"> for $1.9 billion in February 2018. Google tops the list of acquirers of AI startups, having made 14 acquisitions to date, according to <\/span><a href=\"https:\/\/www.cbinsights.com\/research\/top-acquirers-ai-startups-ma-timeline\/\"><span style=\"font-weight: 400;\">CB Insights<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The Reality of AI for Business Today<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">What is the state of AI for business today? By looking at social media, you might get the impression that if your business isn’t already completely dependent on AI, your company is a dinosaur. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While it&#8217;s true that computer intelligence is advancing at a faster pace than human intelligence, much of the opportunity that AI offers has yet to be realized. The truth is that AI still has some significant hurdles to overcome.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">AI Is Challenging to Implement<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Implementing AI isn&#8217;t as simply as installing software. While many organizations are used to IT procurement selecting from a range of solutions and simply implementing the best one, AI is a lot more complex. Unlike software, AI requires extensive <a href=\"http:\/\/achievion.com\/blog\/business-ready-ai.html\">planning<\/a>, a specialized workforce, and data that isn&#8217;t readily available. There are also some serious costs involved in AI adoption that may extend to all areas of the business and not simply the IT department.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">AI also requires a high level of research and development in order to make the technology work. There is a lot of strategic work that will need to be done to fundamentally shift how the business operates to enable an effective AI implementation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition, companies will also need to consider how they will overcome the hurdle of customer and employee skepticism about AI.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">AI Algorithms Are a Black Box<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">In most cases, business problems are extremely complex. Not only do they often involve multiple parties, there is also rarely a clear winner or loser in the outcomes of most business decisions. As a result, implementing AI for business decision-making is actually much harder than it initially seems.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">First, AI systems are incapable of understanding the data that it analyzes. AI cannot distinguish the difference between correlation and causation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The second problem is that AI algorithm designers have no idea how an algorithm arrives at any conclusion. AI algorithms don&#8217;t act like programs and they don&#8217;t act like humans, which means that an AI algorithm is essentially a &#8220;black box.&#8221;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With brand safety and regulatory concerns to consider, businesses simply can&#8217;t afford to rely on decisions made by AI algorithms unless they can provide clear explanations of how they arrived at their conclusions. Businesses must be able to understand the logic behind every decision.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">AI’s black box problem is one major reason why AI hasn’t advanced enough yet to be allowed to make decisions for business without intervention. Although, researchers are already working to <\/span><a href=\"https:\/\/thenextweb.com\/artificial-intelligence\/2018\/02\/27\/bye-bye-black-box-researchers-teach-ai-to-explain-itself\/\"><span style=\"font-weight: 400;\">teach AI algorithms to explain themselves<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Adopt AI Now or Wait?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Although AI is still progressing through its current hype cycle, there are real opportunities for AI to achieve widespread implementation. In fact, its future use is expected to span industries and will likely overhaul entire industries within the next 15 years. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, the decision to adopt AI or now is not black and white. As with any technology adoption cycle, there are five categories of business adopters: innovators, early adopters, early majority, late majority and laggards.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For most businesses, becoming an innovator will not be an option given the uncertainties and significant costs that are involved. On the other hand, being a laggard will mean that the rest of your industry is already reaping the benefits of AI and your competition is ahead of you in the AI game. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Instead, finding middle ground is likely the best approach. If you want to learn more about real AI applications created by leaders in your industry, Achievion can help you explore how these organizations are delivering ROI. We’ll also help you to develop a strategic plan for AI that makes sense for your business.<\/span><\/p>\n<p><a href=\"http:\/\/achievion.com\/contactus\"><span style=\"font-weight: 400;\">Contact us<\/span><\/a><span style=\"font-weight: 400;\"> now to schedule a free consultation and let’s discuss your business.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1782,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[85],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1770"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1770"}],"version-history":[{"count":6,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1770\/revisions"}],"predecessor-version":[{"id":1781,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1770\/revisions\/1781"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1782"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1770"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1770"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1770"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}