{"id":1850,"date":"2018-07-23T07:47:04","date_gmt":"2018-07-23T11:47:04","guid":{"rendered":"https:\/\/achievion.com\/?p=1850"},"modified":"2018-09-04T09:21:24","modified_gmt":"2018-09-04T13:21:24","slug":"7-blockchain-strategy-planning-considerations","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/7-blockchain-strategy-planning-considerations.html","title":{"rendered":"7 Blockchain Strategy Planning Considerations"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Blockchain technology is rapidly becoming a must-have future-proofing strategy for businesses in many industries. It has the potential to become a game-changer for any business where security and trust come at a premium. The world’s top companies, including IBM, Google, and Goldman Sachs, already recognize that the technology could become a differentiating factor that creates significant competitive advantage. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Although the potential of blockchain is vast, so is the uncertainty. Blockchain is so new and complex that it can be difficult to determine how to implement it effectively. Instead of simply forging ahead, businesses should proceed deliberately with careful strategic planning. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As you develop your blockchain strategy, consider these 7 strategic planning considerations.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">1. Understand Blockchain&#8217;s Use Cases<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A successful blockchain strategy doesn’t occur in a vacuum. Instead, companies need to understand that their industry expertise and capabilities influence the decision to pursue a specific blockchain use case. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">McKinsey has identified <\/span><a href=\"https:\/\/www.mckinsey.com\/business-functions\/digital-mckinsey\/our-insights\/blockchain-beyond-the-hype-what-is-the-strategic-business-value\"><span style=\"font-weight: 400;\">6 distinct use cases<\/span><\/a><span style=\"font-weight: 400;\"> for blockchain that address two critical needs:<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Record Keeping<\/span><\/h3>\n<ol>\n<li><b> Static registry.<\/b><span style=\"font-weight: 400;\"> The blockchain serves as a distributed database for the purpose of storing reference data.<\/span><\/li>\n<li><b> Identity.<\/b><span style=\"font-weight: 400;\"> The blockchain is used as a distributed database of identity-related information.<\/span><\/li>\n<li><b> Smart contracts.<\/b><span style=\"font-weight: 400;\"> There are a set of conditions recorded to the blockchain such that automated, self-executing actions are triggered when the predefined conditions are met.<\/span><\/li>\n<\/ol>\n<h3><span style=\"font-weight: 400;\">Transactions<\/span><\/h3>\n<ol start=\"4\">\n<li><b> Dynamic registry. <\/b><span style=\"font-weight: 400;\">The blockchain serves as a dynamic distributed database that continuously updates as assets are exchanged via a digital platform.<\/span><\/li>\n<li><b> Payments infrastructure. <\/b><span style=\"font-weight: 400;\">The blockchain is updated as cash or cryptocurrency payments are made among the blockchain&#8217;s participants.<\/span><\/li>\n<li><b> Other. <\/b><span style=\"font-weight: 400;\">These use cases are comprised of several of the other use cases or simply do not fit neatly into any of the previous categories.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Blockchain can be configured in a number of ways to meet the objectives a particular use cases. As a result, businesses must use strategic planning to uncover the use cases that will deliver the greatest returns. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">2. Engage All Stakeholders<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Most strategic planning processes involve obtaining input from the organization&#8217;s key stakeholders. However, blockchain is a technology that requires collaborative effort in order to be effective, not only from the organization’s executives, but from employees at all levels and  third-party stakeholders. That is why it is critical to ensure that all stakeholders are successfully identified and engaged. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Part of the strategic plan should also involve establishing a blockchain governance model. Blockchain governance is not only about who controls the blockchain, but it also establishes resolution mechanisms in the event of an anomaly.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Any company that seeks to benefit from blockchain&#8217;s potential should also consider joining or forming a blockchain consortium. According to <\/span><a href=\"https:\/\/www2.deloitte.com\/insights\/us\/en\/focus\/signals-for-strategists\/emergence-of-blockchain-consortia.html\"><span style=\"font-weight: 400;\">Deloitte<\/span><\/a><span style=\"font-weight: 400;\">, more than 40 consortia have been formed globally. In addition, among executives who are knowledgeable about blockchain, 18% already participate in a consortium, while 45% say they are likely to join one and 14% are considering forming one.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Joining consortia allows businesses to learn about blockchain trends, keep tabs on what competitors are doing, defend against new threats, and better prepare for implementing blockchain technology. Furthermore, achieving results may not even only depend on the company&#8217;s initial buy-in, but also in developing strategic alliances with the other industry players.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">3. Hire Outside Consultants<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Blockchain consultants can provide advice on the strategic implementation of blockchain technology based on research and cutting-edge analysis. With access to in-depth knowledge of blockchain technology, businesses benefit from working with experts who have practical, real-world experience with blockchain implementation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Hiring outside blockchain consultants can significantly reduce the likelihood of failure of your project, increase speed to market, and deliver cost savings. These results would simply be impossible to achieve otherwise given the fierce competition for blockchain talent and inability of most companies to attract it. In addition, blockchain consultants not only understand blockchain’s architecture, they also understand its scalability potential which will be required to help you achieve your long-term business goals.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">4. Plan for Short-term Returns<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Many companies see blockchain as a long-term business strategy without any consideration for short-term gains. Given that they often lack the foresight to determine what the ultimate results of a blockchain implementation will be, they risk not seeing a return on investment fast enough to avoid failure. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a result, companies must also consider what blockchain brings to the table over the short-term. In many cases, the answer is cost reduction. With short-term profitability achieved, projects can then be scaled up to deliver more transformative results for the future. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">5. Stay True to Your Vision<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">When your organization initially decided that it was time to explore implementing blockchain, your reasons for doing so were intended to be statements of the long-term goals of your organization. While changing market conditions may require you to adapt your strategy or refine your approach to implementing blockchain, staying focused on your long-term vision is paramount. If a change in the vision itself is required, make sure to do so with the understanding that blockchain technology itself is evolving.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">6. Conduct Ongoing Strategy Reviews<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A key factor impacting the success of your organization&#8217;s blockchain strategy is periodic analysis of implementation results and an ongoing review of your strategic plans. It is important that you regularly review the implementation plan and assess the progress that have been made. When deviations occur, there also need to be mechanisms in place for getting the plan back on track. When challenges arise, it may be necessary to adjust one or more of the objectives of your blockchain strategy.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">7. Timing Is Key<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Timing is critical if you want to develop an effective blockchain strategy for your business. There are significant new developments that are happening daily in this space. In addition to the developments that are happening in core capabilities at the industry level, there are also advances being made from an academic and regulatory perspective. <\/span><\/p>\n<p><strong>Achievion can help you make sense of it all by providing you with the tools you need to navigate risks and uncover opportunities. <a href=\"https:\/\/achievion.com\/contact\">Contact us today<\/a> for a free consultation and let&#8217;s create a strategy for implementing blockchain for your business.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1861,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1850"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1850"}],"version-history":[{"count":5,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1850\/revisions"}],"predecessor-version":[{"id":1862,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1850\/revisions\/1862"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1861"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1850"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1850"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1850"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}