{"id":1949,"date":"2018-10-25T14:08:36","date_gmt":"2018-10-25T18:08:36","guid":{"rendered":"https:\/\/achievion.com\/?p=1949"},"modified":"2018-10-25T14:08:36","modified_gmt":"2018-10-25T18:08:36","slug":"blockchain-solutions-sharing-economy","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/blockchain-solutions-sharing-economy.html","title":{"rendered":"Blockchain Solutions for the Sharing Economy"},"content":{"rendered":"<p>Also known as collaborative consumption, sharing economy is a concept highlighting an individual’s ability or preference to rent or borrow things rather than buy and own them. The concept of the sharing economy has really struck a chord with the consumers and it is expected that the global sharing economy will reach <a href=\"https:\/\/www.lloyds.com\/news-and-risk-insight\/press-releases\/2018\/04\/sharing-economy\"><u>$335 billion by 2025<\/u><\/a>, a substantial increase from the $15 billion in 2014.<\/p>\n<p>The original idea behind the internet\/technology-based ‘sharing economy’ was to connect communities of peers via the internet to allow them to share several underutilized resources. Perhaps, this is the reason blockchain solutions are being tipped as the next big thing for the sharing economy.<\/p>\n<p>In fact, one could go as far as to say that blockchain is the future of the sharing economy. There’s some solid reasoning behind this statement but we will leave it for later, right after we’ve discussed the evolution and limitations of the sharing economy.<\/p>\n<h2><strong><b>The Evolution and Limitations of the Sharing Economy<\/b><\/strong><\/h2>\n<p>One of the fastest growing business trends in history, the sharing economy has seen investments of more than <a href=\"https:\/\/www.bcg.com\/en-us\/publications\/2017\/strategy-accelerating-growth-consumer-products-hopping-aboard-sharing-economy.aspx\"><u>$23 billion into startups<\/u><\/a> with a share-based model. While it’s impossible to know the actual size of the sharing economy, there are many sharing platforms or services that provide us with the cues. Major contributors to the sharing economy are Uber and Airbnb—two of the fastest growing companies in the world.<\/p>\n<p>According to recent reports, the two companies had a combined market capitalization of $103 billion, which would have them ranked among the 40 wealthiest countries in the world. Uber is the major contributor here with <a href=\"https:\/\/www.recode.net\/2018\/2\/9\/16996834\/uber-latest-valuation-72-billion-waymo-lawsuit-settlement\"><u>$72 billion<\/u><\/a> but Airbnb does not fare too badly either with <a href=\"https:\/\/www.recode.net\/2017\/8\/8\/16113140\/top-10-most-valuable-startups-uber-spacex-wework-airbnb\"><u>$31 billion<\/u><\/a> market cap.The value of these major players is not the only indicator of the worth of the sharing economy.<\/p>\n<p>In 2016, the sharing economy in the U.S had a consumer base of <a href=\"https:\/\/www.statista.com\/statistics\/289856\/number-sharing-economy-users-us\/\"><u>44.8 million adults<\/u><\/a>. This is expected to grow to 86.5 million users by 2021. Additionally, <a href=\"http:\/\/www.mckinsey.com\/global-themes\/employment-and-growth\/independent-work-choice-necessity-and-the-gig-economy\"><u>Mckinsey<\/u><\/a> estimates that in the U.S and Europe alone, sharing platforms recruit 20% to 30% of the workforce, which adds up to roughly 162 million people.<\/p>\n<p>The concept of the sharing economy is not new as rural communities in ancient history have thrived using the same idea of ‘bartering’. The only difference is that today internet and mobile technology have made it easier than ever to manage share-based transactions. The sharing economy is an umbrella term that encompasses many systems including:<\/p>\n<ul>\n<li>P2P economy<\/li>\n<li>Collaborative consumption<\/li>\n<li>Coworking\/cobranding<\/li>\n<li>Crowdfunding\/crowdsourcing<\/li>\n<li>Freelancing<\/li>\n<\/ul>\n<p>The internet\/technology-based sharing economy has disrupted many traditional business sectors including transportation, consumer goods, professional and personal services, and healthcare. While the internet\/technology-based sharing economy has the potential to disrupt many more traditional business sectors, many people in China, U.S, and Europe remain skeptical about it.<\/p>\n<p>The skepticism is due to the limitations of the sharing economy. One of the biggest limitations of the sharing platforms is that they rarely allow users to connect with one another outside of the platform. The sole purpose of this is to protect corporate interests—the company gets its transaction fees for as long as it keeps users within a proprietary ecosystem.<\/p>\n<p>While this model helps protect the data and identity of the users, it doesn’t create an environment of trust that is critical for building global sharing communities. For example, while the company may claim otherwise, AirBnb does not allow a true peer-to-peer relationship on its platform as it hides the contact details of the people transacting on its network, thus preventing users from contacting outside of the platform.<\/p>\n<p>Not many companies in the sharing economy realize this, but unifying sharing platforms into a single ecosystem would provide users with a convenient solution, thus increasing the likelihood of the mass adoption of the sharing economy. Blockchain can help overcome the above limitations to the trigger mass adoption of the sharing economy.<\/p>\n<h2><strong><b>Why Blockchain is the Future of the Sharing Economy<\/b><\/strong><\/h2>\n<p>The decentralized nature of blockchain networks makes it possible for sharing providers to connect more directly with users in a true peer-to-peer (P2P) fashion. Not only that, blockchain can also energize and unlock the sharing economy by making it cheaper to create and operate an online platform. For example, transactions could be automatically executed using smart contracts or performed at lower cost by other small competing providers.<\/p>\n<p>Not only does blockchain provide an extra layer of security that has not been possible until now, the decentralized nature of the technology also helps reduce the cost of sharing. Currently those using sharing platforms such as AirBnb, Uber and others have to pay a transaction fee to these platforms. By eliminating the middlemen from the sharing economy, blockchain will allow users of the economy to avoid the above fees, thus helping them save money.<\/p>\n<h2><strong><b>Companies that are Integrating Blockchain into the Sharing Economy<\/b><\/strong><\/h2>\n<p>Internet-based sharing platforms have already disrupted the sharing economy. However, the future of the sharing economy is blockchain-based and following are some companies looking to make an impact on daily consumer life with blockchain-based sharing:<\/p>\n<h3><strong><b>ShareRing<\/b><\/strong><\/h3>\n<p>One company that has uncovered all the benefits of a blockchain-sharing economy integration is <a href=\"https:\/\/sharering.network\/en\"><u>ShareRing<\/u><\/a>. The company believes that integrating blockchain into the sharing economy would create a unique platform that could revolutionize the way goods and services are shared.<\/p>\n<p>The idea behind ShareRing is to create a blockchain which will allow a dual-coin mechanism. The name given to the network is ShareLedger.  The network will be driven by a utility token called ShareToken (SHR) which will be tradable on cryptocurrency exchanges.  SharePay (SHRP) will be directly exchangeable for fiat and used as a payment currency for daily transactions on the ShareRing platform. There are several benefits of this including:<\/p>\n<ul>\n<li>Liming exposure to price volatility risks associated with the utility token<\/li>\n<li>More accessible network for everyday users wanting to buy sharing services with fiat currency<\/li>\n<li>Bypassing foreign exchange fees imposed by banks and credit-card companies in cross-border transactions<\/li>\n<\/ul>\n<h3><strong><b>Bee Token<\/b><\/strong><\/h3>\n<p>An emerging crypto home-sharing solution, <a href=\"https:\/\/www.beetoken.com\/\"><u>Bee Token<\/u><\/a> is a decentralized network that is powered by cryptocurrency and runs on the blockchain. The purpose of this is to increase the security, accountability, and safety of direct exchanges between home providers and renters.<\/p>\n<h3><strong><b>Origin <\/b><\/strong><\/h3>\n<p>A blockchain-based organization, <a href=\"https:\/\/www.originprotocol.com\/en\"><u>Origin<\/u><\/a> aims to take decentralized sharing to the next level. The company wants to be the foundation for P2P marketplaces. To create an environment for smart contracts, where buyers and sellers perform transactions without any central authority, the company is building decentralized markets on the Origin protocol. The hope is that this protocol would allow organizations to build new marketplaces without the burden of the red tape and overhead fees that rule existing shared economy marketplaces.<\/p>\n<h2><strong><b>Final Word<\/b><\/strong><\/h2>\n<p>The internet has given rise to the sharing economy and today people are more willing to transact with one another. However, a stumbling block in the mass adoption of this practice are intermediaries, who, until recently, have controlled all interactions and transactions among people. The good news is that blockchain solutions are being built to remove the middlemen from the sharing economy and build true peer-to-peer marketplaces. However, this would increase the responsibility on technology providers such as Achievion to leverage the blockchain technology to build sophisticated mobile and web applications.<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1952,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1949"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1949"}],"version-history":[{"count":3,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1949\/revisions"}],"predecessor-version":[{"id":1953,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1949\/revisions\/1953"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1952"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1949"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1949"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1949"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}