{"id":1958,"date":"2018-11-15T13:56:54","date_gmt":"2018-11-15T18:56:54","guid":{"rendered":"https:\/\/achievion.com\/?p=1958"},"modified":"2018-11-15T16:47:34","modified_gmt":"2018-11-15T21:47:34","slug":"blockchain-can-secure-patient-health-data","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/blockchain-can-secure-patient-health-data.html","title":{"rendered":"How Blockchain Can Secure Patient Health Data"},"content":{"rendered":"<p>Healthcare is not just a ‘big’ industry; it is much bigger than what most people imagine it to be, as it has critical forward and backward links with the entire economy. In 2017, the U.S spending on healthcare was nearly $3.5 trillion, which is equivalent to the entire GDP of Germany—the 4<sup>th<\/sup> largest economy in the world. Moreover, Reuters predicts U.S healthcare spending to increase by <a href=\"https:\/\/www.reuters.com\/article\/us-usa-healthcare-spending\/u-s-healthcare-spending-to-climb-5-3-percent-in-2018-agency-idUSKCN1FY2ZD\"><u>5.3%<\/u><\/a> this year.<\/p>\n<p>If you found the above numbers as unexpected, then you will be pleasantly surprised to hear that the global spending on healthcare is expected to increase to <a href=\"http:\/\/www.healthdata.org\/news-release\/global-spending-health-expected-increase-1828-trillion-worldwide-2040-many-countries\"><u>$18.28 trillion<\/u><\/a> by 2040. This is equivalent to 1\/4<sup>th<\/sup> of the total global GDP in 2017. Anticipating this increased spending on healthcare, governments and healthcare providers are increasingly looking for any new technology that could help them save money while ensuring better patient care going forward. With the potential to improve efficiency and increase financial security in the healthcare sector, blockchain is a technology with important consequences on the industry.<\/p>\n<p>Originally developed to provide a decentralized digital currency called Bitcoin, blockchain can today be used to improve many of the systems that the global economy relies on. Within healthcare, blockchain promises to create more secure healthcare systems and ensure better protection of everything from drug supply chains to electronic medical records (EMR).<\/p>\n<h2><strong><b>Use Cases of Blockchain in Healthcare<\/b><\/strong><\/h2>\n<p>The use of blockchain in healthcare is not limited to the security of healthcare systems and the patient health data stored there. Instead, the use of blockchain can help the healthcare industry in a number of ways beyond security. From streamlining payment transactions to creating large transactional databases to verifying contractual agreements and linking numerous disparate pieces of information, the use cases for blockchain in healthcare deserve attention and that is exactly what is going to happen here. Following are some potential use cases for blockchain technology in healthcare:<\/p>\n<h3><b>1. <\/b><strong><b>Medical Records<\/b><\/strong><\/h3>\n<p>There was a time when doctors would pull out from their drawer a dreary looking folder with a visiting patient’s name written on the front. In case a patient visited their doctors quite frequently, they would find the folder loaded with different pieces of paper which made it look scarily full. And, this presented a danger to the patient’s health—what if the doctor gave the patient an injection or medication again because they weren’t sure if the patient had already taken the medicine or not?<\/p>\n<p>The good thing is that these concerns did not escape the sights of policy makers and healthcare providers and with the advent of computing technologies, the healthcare industry started transitioning from dusty old paper records to digitally stored electronic medical records (EMRs). Unfortunately, the EMRs did not quite live up to their promise. For instance, it was <a href=\"https:\/\/www.healthaffairs.org\/doi\/abs\/10.1377\/hlthaff.24.5.1103\"><u>predicted in 2005<\/u><\/a> that the adoption of EMRs could potentially save the healthcare industry billions of dollars every year. More than a decade has passed since then and the savings that were promised are yet to materialize.<\/p>\n<p>In addition to the above, there has been widespread dissatisfaction with EMRs, mainly because a single oversight or mistake by a doctor could result in casualties. The good news is that blockchain can succeed where other systems have failed, and it can do this by creating a steady and secure medical record that can be accessed by the patient or whoever the patient provides access to. Not only can this eliminate the gaps in medical history, but it could also minimize the time and money spent on gathering copies of records from various providers.<\/p>\n<h3><b>2. <\/b><strong><b>Data Security<\/b><\/strong><\/h3>\n<p>Blockchain is a smart way to restrict access to and protect patient health data as the technology can be used to prevent unauthorized individuals from accessing the information.<\/p>\n<h3><b>3. <\/b><strong><b>Clinical Trial Research<\/b><\/strong><\/h3>\n<p>With the blockchain technology, it is possible to streamline clinical trial patient recruitment which currently is an expensive and time-consuming process. This can be achieved by identifying patients who may be eligible for clinical trials by using the demographic, diagnostic, and therapeutic history contained in blockchain data.<\/p>\n<h3><b>4. <\/b><strong><b>Claims and Billing History<\/b><\/strong><\/h3>\n<p>By eliminating the series of validations and intermediaries involved in traditional transactions, blockchain helps to simplify the complex medical billing process. With blockchain, organizing claims processing and billing is easy because the blockchain technology created records that are constant, secure, and trackable. This not only saves time and money, but it also minimizes the risk of billing fraud. Additionally, you can use the blockchain technology to connect multiple claim types.<\/p>\n<h3><b>5. <\/b><strong><b>Linking Disparate Sources of Health-Related Data<\/b><\/strong><\/h3>\n<p>Provided an individual patient can be identified in multiple datasets, blockchain could be used to link medical record and healthcare claims data with the person’s biometric data obtained from various sources.<\/p>\n<h2><strong><b>How Blockchain Can Help Keep Patient Records Secure<\/b><\/strong><\/h2>\n<p>As technology advances, healthcare data security is becoming more and more vulnerable. In fact,1 in 4 data breaches occur in the healthcare industry. Additionally, healthcare breaches are estimated to have affected 1 in 13 patients between 2015 and 2019. The good news is that blockchain is promising to provide healthcare with a solution to cybersecurity. An example of this is the blockchain solution for securing electronic health records (EHRs).<\/p>\n<p>While EHRs have provided physicians with a better way to manage the data of their patients by converting paper data into digital records, they are not shared openly between systems. This means that, with EHRs, there’s no single source available where all individual patient health data resides. In such times, we need to have a fresh approach to improve data management and security in the healthcare industry.<\/p>\n<p>The need of the hour is a secure place where the complete medical history and other relevant information of a patient can be systemically stored for future use and analysis. The only technology that can provide this solution is blockchain. The future of data management and security, blockchain decentralizes health care record systems and eliminates the need for a ruling central authority.<\/p>\n<p>With decentralization of health care record systems, authorized individuals have access to the entire health data and history contained in it. Since health data must go through multiple check points for validation instead of a single gateway, this creates an atmosphere of reliability. With the current health care record system,the health data of a patient is submitted to and salvaged from single platform. This platform is unprotected and void of a multi-party validation framework.<\/p>\n<p>On the other hand, the patient is notified of the change and their validation is requested when a health record on the blockchain is altered. The awareness resulting from decentralized validation increases the level of security of patient health data, mainly because of the customizable nature of the blockchain technology. For these reasons and more, the use of blockchain is a great way to secure patient health data.<\/p>\n<p>At Achievion, we leverage blockchain technology to build sophisticated mobile and web applications.  Get in touch to know more.<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1972,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1958"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1958"}],"version-history":[{"count":4,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1958\/revisions"}],"predecessor-version":[{"id":2002,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1958\/revisions\/2002"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1972"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1958"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1958"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1958"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}