{"id":2656,"date":"2019-05-24T13:25:01","date_gmt":"2019-05-24T17:25:01","guid":{"rendered":"https:\/\/achievion.com\/?p=2656"},"modified":"2019-05-24T13:25:03","modified_gmt":"2019-05-24T17:25:03","slug":"the-presidential-ai-directive-and-its-implications-on-the-federal-agencies","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/the-presidential-ai-directive-and-its-implications-on-the-federal-agencies.html","title":{"rendered":"The Presidential AI Directive and Its Implications on The Federal Agencies"},"content":{"rendered":"\n<p>In February this year, the American President Donald Trump released an executive order on artificial intelligence (A.I). The executive order outlines how the U.S plans to approach A.I in the future. The aim of the Presidential AI directive is to establish the United States as a global leader in A.I technology.<\/p>\n\n\n\n<p>The <a href=\"https:\/\/www.whitehouse.gov\/presidential-actions\/executive-order-maintaining-american-leadership-artificial-intelligence\/\">Presidential AI directive<\/a>&nbsp;comes as a response to the strides made in AI technology by China and other competitor countries of the United States. From the health sector to the military, AI technology has far-reaching applications. <\/p>\n\n\n\n<p>Realizing this, the Chinese government released a <a href=\"https:\/\/www.technologyreview.com\/f\/609791\/china-has-a-new-three-year-plan-to-rule-ai\/\">plan for AI in 2017<\/a>&nbsp;and dedicated <a href=\"https:\/\/futurism.com\/china-building-2-1-billion-industrial-park-ai-research\">billions of dollars<\/a>&nbsp;towards its implementation. This has forced other countries, which includes the U.S, to come up with their own plan for AI technology. As a result, the executive order on AI was released in February this year. What is the executive order on AI and what are all its implications? Let’s find out.<\/p>\n\n\n\n<h2><strong>The Main Directives of the President’s Executive Order on A.I<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Today, artificial intelligence (A.I) is developing at a rapid pace. We are seeing the application of artificial intelligence everywhere, including health care, the military, finance, retail sales, and autonomous vehicles. A <a href=\"https:\/\/www.brookings.edu\/research\/how-artificial-intelligence-is-transforming-the-world\/\">2018 Brooking Institution report<\/a>&nbsp;finds that AI technology is transforming every aspect of life. Additionally, it is changing how we think about gathering information, analyzing it, and using the insights that we get to improve decision-making.<\/p>\n\n\n\n<p>Despite the above, most of the AI projects in the U.S are funded by private organizations. This is a shame when you consider that several of the most innovative tech companies in the world are based in the U.S. Moreover, the country has a large pool of talented people who are skilled in or have a reasonable understanding of AI technology. <\/p>\n\n\n\n<p>However, this should not put Americans into a false sense of security or a false sense of complacency. This is because the U.S government has simply not done enough to compete with the likes of China in the research and deployment of AI. Greg Brokerman, the co-founder of OpenAI, said in his address to the Congress that investments of the federal government in non-classified AI technology are no more than <a href=\"https:\/\/sciencebusiness.net\/news\/us-pledges-artificial-intelligence-research-push-theres-no-mention-more-funds\">$1.1 billion<\/a>. &nbsp;This does not seem like a lot compared to the <a href=\"https:\/\/fortunascorner.com\/wp-content\/uploads\/2019\/02\/CNAS-Understanding-Chinas-AI-Strategy-Greg-C.-Allen.pdf\">$150 billion<\/a>&nbsp;that China has proposed to spend on AI over the next decade.<\/p>\n\n\n\n<p>In addition to the above, it is worth noting that the Xi Jinping, the current president of China, has instructed his comrades to ensure that the country surpasses the United States in science and technology by 2030. This, along with the reluctance of the federal government to spend on AI, does not augur too well for the United States. The good news is that President announced released an executive order on AI in February that aims to ensure the position of the U.S as a global leader in technology well into the future. Referred to as the ‘American AI Initiative’, the Presidential executive order on A.I includes the following main directives.<\/p>\n\n\n\n<h3><strong>1.&nbsp;<\/strong><strong>Federal Investment<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>This directive is specifically for federal agencies. What does this directive on A.I instruct? It instructs the federal agencies to prioritize the establishment of AI research and development and that they should allocate funds accordingly. It also directs the agencies to look for opportunities to collaborate with private organizations and the academia on AI research and development.<\/p>\n\n\n\n<h3><strong>2.&nbsp;<\/strong><strong>Federal Resources<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>This directive pertains to the use of federal resources on AI research. The directive instructs the federal agencies to find ways to enable the people involved in AI research to use federal resources. This could be in the form of computing resources, models, and data. The agencies are directed to do this while maintaining confidentiality and security.<\/p>\n\n\n\n<h3><strong>3.&nbsp;<\/strong><strong>Guidelines for Regulation<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The third main directive of the President’s executive order on A.I is for the National Institute of Standards and Technology and the Office of Management and Budget. The directive instructs these two offices functioning under the U.S federal government to ensure the regulation of AI technologies by establishing the guidelines and standards for it. The purpose of this is to encourage an environment of innovation while maintaining privacy and protecting national security interests.<\/p>\n\n\n\n<h3><strong>4.&nbsp;<\/strong><strong>Preparing the Workforce<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>This directive of the President’s executive order on A.I instructs the federal agencies to provide researchers and students with educational grants and fellowships. Special priority is to be given to the researchers and students with an interest in AI. Also, the directive demands that preference is given to American citizens when possible.<\/p>\n\n\n\n<h3><strong>5.&nbsp;<\/strong><strong>Protecting American AI<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The fifth and final main directive of the President’s executive order on A.I is protecting American AI. This directive instructs the advisor on National Security to come up with an action plan to safeguard critical AI technology. This includes the technology that gives the United States the edge over adversarial nations and strategic competitors in national security and economics.<\/p>\n\n\n\n<p>These are the 5 main directives of the President’s executive order on A.I. The National Science and Technology Committee on Artificial Intelligence (A.I) will mainly coordinate the implementation of these directives.<\/p>\n\n\n\n<p>A term with no clear-cut definition, artificial intelligence (A.I) typically involves the use of software to make decisions that generally require judgment from humans. It is widely agreed that AI will transform the world in the future. According to a <a href=\"https:\/\/www.pwc.com\/gx\/en\/issues\/data-and-analytics\/publications\/artificial-intelligence-study.html\">PWC study<\/a>, more than $15 trillion could be added to the global GDP by artificial intelligence (A.I) by 2030.<\/p>\n\n\n\n<p>Some of the world leaders in AI technology happen to be based in the United States. In fact, the biggest innovations in A.I are happening right here in America. The only problem is that China is doing a lot more at the federal level to overtake American companies and become a global leader in A.I.<\/p>\n\n\n\n<h2><strong>The Implications of the Presidential AI Directive on Federal Agencies<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>While President Trump’s executive order on AI seems to be a step in the right direction, there are several concerns associated with the order. &nbsp;One of these concerns is that new research funds were not provisioned by the order. While the directive instructs the federal agencies to allocate money to AI research and development, it does not specify where this money will come from.<\/p>\n\n\n\n<p>The lack of details about the plan’s implementation is another major concern associated with the order. In order to find opportunities for action, much of the order relies on future agency reports. Additionally, no milestones have been established for evaluating the long-term progress of the order. There are concerns that the lack of concrete implementation mechanisms, dedicated funding, and coordination between agencies will result in the failure of the executive order.<\/p>\n\n\n\n<p>In addition to the above, many critics note that there’s no mention of immigration in the order. According to them, global talent is key to innovation in American technology companies and the harsh visa policy will simply drive them away. The benefits of this will be reaped by countries such as Canada. Many say that this omission may have been deliberate because the order clearly instructs the federal agencies to give preference to American citizens.<\/p>\n\n\n\n<p>While these concerns about the executive order on A.I may or may not come true in the future, following are some of the immediate implications of the Presidential AI Directive on federal agencies.<\/p>\n\n\n\n<h3><strong>1.&nbsp;<\/strong><strong>The Need to Convince Congress to Release Funds for ‘Federal Investment in AI’<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>‘Federal Investment in AI Research and Development’ is section 4 of the executive order on A.I. As explained above, the order directs the federal agencies to review budgets related to artificial intelligence (A.I). It also directs the agencies to develop requests for funding to submit to the Office of Management and Budget (OMB) in the coming fiscal years.<\/p>\n\n\n\n<p>However, the problem is that the executive order does allocate new funding for research, development, education, and security in the field of AI. This is because the order does not have the authority to do this. Instead, it needs Congress to take some action. If the Trump administration actually wants to address the AI issue, then it will have to work with the Congress to get the desired and sustained funding for its AI initiatives. However, this will be difficult in times of <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-03-11\/trump-2020-budget-sees-1-trillion-deficits-for-next-four-years\">$1 trillion budget deficit<\/a>.<\/p>\n\n\n\n<p>While private organizations have a clear incentive to dish out some money on AI projects, the investments they can make is nowhere close to the funding that could come from the U.S government. Therefore, it is in the interest of the country that the Congress and the Trump administration collaborate. This collaboration is necessary to find the right amount of government funding needed to maintain the U.S as the global leader in A.I. Perhaps, this can get the Congress and the government on the same page.<\/p>\n\n\n\n<h3><strong>2.&nbsp;<\/strong><strong>Confusion About the Role of the Attorney General on Privacy Protection<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The executive order puts great emphasis on the need to make better use of federal data to improve AI systems while maintaining the privacy of Americans at the same time. For example, the role that the senior privacy officers of the agencies need to play in this is clearly highlighted. However, the problem is that there is no clear directive on the attorney’s general’s role in this. <\/p>\n\n\n\n<p>We clearly believe that the Department of Justice and the attorney general should play a key role in ensuring the adherence of all federal agencies to the Constitution and the U.S laws that pertain to maintaining the privacy of Americans. While access to big data is needed for AI research and development, no one would want things to get out of hand like it did in the case of <a href=\"https:\/\/www.vox.com\/policy-and-politics\/2018\/3\/23\/17151916\/facebook-cambridge-analytica-trump-diagram\">Facebook<\/a>.<\/p>\n\n\n\n<p>Additionally, it is not feasible that agencies make decisions on key privacy questions. This is because they tend to make these decisions based on an analysis that is narrow-minded and overly aggressive. What they should be doing instead is making decisions based on the broader reputational, policy, and legal interest that are potentially at stake.<\/p>\n\n\n\n<p>The potential for abuse is significant since large datasets will be accessed by several agencies and their subcomponents. Additionally, they will be releasing these datasets to private companies, educational institutions, and federal contractors. For this reason, the government needs to issue some kind of a supplement directive that clearly shows the role of the Justice Department and the attorney general on privacy protection. If this does not happen, then the government will not be very effective in the bureaucratic confrontations that follow the order.<\/p>\n\n\n\n<h3><strong>3.&nbsp;<\/strong><strong>No Clear Definition of A.I for Executive Branch Agencies to Refer To<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>While the executive order is on A.I, there is no clear definition of the term for executive branch agencies to refer to. Since the order does not have a clear definition of A.I, it can be tough for the agencies to know what exactly AI means in the order. However, one can have sympathy for the drafters since there is no one, universal definition of artificial intelligence (A.I).<\/p>\n\n\n\n<p>However, federal agencies can determine an appropriate way to perform their duties under the new Presidential directive only if they are clear what the order is about. The lack of a clear definition of A.I in the executive order is a clear failure on part of the drafters. This is because this can have a negative impact on the government’s plan to fund the research and development of A.I in the country. Additionally, it can have an impact on privacy protection as related to AI. <\/p>\n\n\n\n<p>Therefore, the Trump administration should supplement the executive order to provide guidance to the federal agencies about what A.I refers to in the order. This will help the agencies in prioritizing, protecting, regulating, and finding AI research and development initiatives.<\/p>\n\n\n\n<h2><strong>Concluding Remarks<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>President’s executive order on AI is a step in the right direction. However, a lot more needs to be done to compete with China in the AI field. This includes convincing Congress to release funds for federal investment in AI, clearing the confusion about the role of the attorney general on privacy protection, and providing a clear-cut definition of A.I that executive branch agencies can refer to.<\/p>\n\n\n\n<p>Due to the challenges listed above, it appears that it may take some time for this directive to be implemented. At Achievion, we are going to follow the development of this directive and post follow-up articles as the news come in. Signed up for our newsletter to stay tuned.<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":2662,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[85],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2656"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=2656"}],"version-history":[{"count":2,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2656\/revisions"}],"predecessor-version":[{"id":2661,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2656\/revisions\/2661"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/2662"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=2656"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=2656"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=2656"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}