{"id":2947,"date":"2019-10-31T14:11:28","date_gmt":"2019-10-31T18:11:28","guid":{"rendered":"https:\/\/achievion.com\/?p=2947"},"modified":"2019-10-31T14:11:30","modified_gmt":"2019-10-31T18:11:30","slug":"ethical-ai-101-establishing-governance-mechanisms","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/ethical-ai-101-establishing-governance-mechanisms.html","title":{"rendered":"Ethical AI 101: Establishing Governance Mechanisms"},"content":{"rendered":"\n<p>This post is the fourth entry in our series on Ethical AI principles. <\/p>\n\n\n\n<p>In the <a href=\"https:\/\/achievion.com\/blog\/ethical-ai-101-ensuring-an-unbiased-ai.html\">previous post<\/a>, we discussed the 5<sup>th<\/sup> principle of the Ethical AI concept. This involved understanding the issues related to bias in AI, its causes, and the biggest challenges in fixing AI bias. We also looked at how deep learning models and AI systems can be made bias-free.<\/p>\n\n\n\n<p>In this post, we will discuss the 8<sup>th<\/sup> principle of Ethical AI, which calls for  “establishing global governance mechanisms.” While the Ethical AI Principle 8 only covers global AI governance mechanisms, we’ll now attempt to look at the principle from a local organizational perspective as well.<\/p>\n\n\n\n<p>We will discuss the seven critical requirements for trustworthy AI systems and how international standards can be used as a tool for AI governance. But before we do that, we will state AI governance, the challenge related to it, and the ways to overcome it. Let’s begin.<\/p>\n\n\n\n<h2><strong>What Is AI Governance?<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>A guide and legal framework for governing AI, AI governance ensures that the aim of researching and developing machine learning (ML) technologies is always to help humans use AI and ML systems in a fair way that is free from any bias.<\/p>\n\n\n\n<p>In addition to the above, another goal of AI governance is bridging the gap that currently exists between ethics and accountability in technological advancement. This is to prevent any potential violations of AI use and deal with matters related to ‘the right to information.’<\/p>\n\n\n\n<p>The need for AI governance has increased with the implementation of AI systems across many sectors, like healthcare, education, transportation, public safety, and economics. AI governance focuses mainly on three aspects relating to AI: autonomy, data quality, and justice.<\/p>\n\n\n\n<p>AI governance aims to find answers to questions relating to AI safety, identify relevant institutional and legal structures, clarify the role of ethical and moral intuitions with regards to AI, and establish personal data access and control. <\/p>\n\n\n\n<p>The overall purpose of AI governance is to establish the level of impact algorithms can have on every aspect of our life and identify the people responsible for monitoring it.<\/p>\n\n\n\n<h2><strong>Understanding the AI Governance Challenge<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>There are many benefits associated with the development and use of artificial intelligence (AI) systems. In fact, these systems have the potential to improve labor productivity and transform businesses in such a way that it enhances the quality of life. Perhaps, this is the reason why AI is being adopted across many sectors today. <\/p>\n\n\n\n<p>According to a recent report by McKinsey, the contribution of artificial intelligence (AI) to the global GDP could be as high as <a href=\"https:\/\/www.mckinsey.com\/featured-insights\/artificial-intelligence\/notes-from-the-ai-frontier-modeling-the-impact-of-ai-on-the-world-economy\">$13 trillion by 2030<\/a>. This is the reason the competition for AI supremacy among countries is heating up, with China and the United States leading the way.<\/p>\n\n\n\n<p>While many developed nations have created policies and frameworks for AI investment and development, the governance mechanisms and models needed to maximize the potential of AI and manage its risks are still missing.<\/p>\n\n\n\n<p>While most governments consider AI governance a matter not worthy of their time, there is an increased concern that AI technologies could lead to a host of problems, chiefly ethical ones, if they are not implemented in a responsible way and if the data within them is not managed properly.<\/p>\n\n\n\n<p>The good news is that some governments and international organizations have finally started to realize the seriousness of the matter. These governments and organizations have come up with ethical principles that outline how AI technologies need to be developed and used; the purpose of this is to minimize the risks that are brought upon by a lack of AI governance.<\/p>\n\n\n\n<h2><strong>How to Govern AI<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Properly governing artificial intelligence (AI) systems is easier said than done. However, this does not mean that effective AI governance is beyond the realm of possibility. Mark Latonero, a professor at the University of Southern California, provides some recommendations on how to govern AI in his research report, “<a href=\"https:\/\/datasociety.net\/wp-content\/uploads\/2018\/10\/DataSociety_Governing_Artificial_Intelligence_Upholding_Human_Rights.pdf\">Governing Artificial Intelligence: Upholding Human Rights &amp; Dignity<\/a>.”<\/p>\n\n\n\n<p>In his report, Latonero makes several recommendations to the stakeholders regarding AI governance. One of these recommendations is that companies should work towards communicating with local civil society groups effectively. He asks companies to focus on areas with a poor human rights record, especially. Latonero believes that this will ultimately lead to Human Rights Impact Assessments at every development stage of the AI system.<\/p>\n\n\n\n<p>For governments, a good way to start would be to acknowledge their human rights obligations towards citizens. Once this happens, there is a greater chance of governments giving priority to the protection of their citizen’s fundamental rights with respect to policies that relate to AI.<\/p>\n\n\n\n<p>In addition to the above, governments around the world should cooperate with each other to ensure that AI is developed and used in a way that does not compromise human rights. The UN, with its 193 member states, is the perfect platform for this.<\/p>\n\n\n\n<p>However, since human rights principles are not technical specifications, considerable work will be needed from all stakeholders for achieving the above-mentioned goals. This means that engineers, lawyers, social scientists, and computer scientists will also have to come together to ensure that human rights are a key consideration in the design, development, and use of AI systems.<\/p>\n\n\n\n<p>In addition to the above-mentioned experts, an effort will be needed from academia as well. They will need to explore the value of human rights law, humanitarian law, and ethics, their limitations, and the interactions between them as it relates to AI technology.<\/p>\n\n\n\n<p>The job of academia is to research and analyze the different trade-offs with regards to human rights in specific circumstances related to AI. On the other hand, the impact of AI on the ground needs to be explored by social scientists.<\/p>\n\n\n\n<p>Singapore is the first country that has taken all of these recommendations into account to come up with an <a href=\"https:\/\/www.pdpc.gov.sg\/Resources\/Model-AI-Gov\">AI governance framework<\/a>. The framework for AI governance changes relevant ethical principles into practices that can be implemented when deploying artificial intelligence (AI) systems in an organization. The purpose of this is to implement an operational model to put these ethical principles in action. Following are the two main objectives of Singapore’s AI governance framework:<\/p>\n\n\n\n<ul><li>Create an Assessment Guide that helps organizations determine if they have developed AI systems in line with the relevant ethical and governance practices and measures<\/li><li>Promote the adoption of AI by increasing the trust and confidence of consumers in providing their personal data for AI<\/li><\/ul>\n\n\n\n<p>The AI governance framework should be a model for other governments as well as private entities to ensure that AI systems are developed and used as per the relevant ethical principles and governance mechanisms.<\/p>\n\n\n\n<h2><strong>7 Key Requirements for Trustworthy AI<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Ensuring trustworthy AI should be the basis for developing any AI governance mechanism. What is a trustworthy AI? It is an AI system that is:<\/p>\n\n\n\n<ul><li>Robust<\/li><li>Ethical <\/li><li>Lawful<\/li><\/ul>\n\n\n\n<p>It isn’t enough for an AI system to be trustworthy from a technical perspective. It also needs to be trustworthy from a social and environmental perspective. Another key requirement for trustworthy AI is that an AI system should respect ethical values and principles, making them the cornerstone for developing and using AI. Last but not least, AI systems must be developed and used in a way that does not violate any applicable laws or regulations.<\/p>\n\n\n\n<p>These are some of the basic qualities that make up a trustworthy AI. However, the key requirements for trustworthy AI are different from these basic qualities. These requirements are explained below.<\/p>\n\n\n\n<h3><strong>1.&nbsp;<\/strong><strong>Human Agency and Oversight<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Human beings must be empowered by AI systems; this is a major quality of AI that makes it trustworthy. Basically, AI should allow human users to make informed decisions while fostering their basic rights. Another important thing to ensure is that the appropriate oversight mechanisms are in place. This can be achieved through human-in-command, human-on-the-loop, and human-in-the-loop approaches.<\/p>\n\n\n\n<h3><strong>2.&nbsp;<\/strong><strong>Technical Robustness and Safety<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Another requirement for trustworthy AI is that AI systems must be secure and resilient. Safety in AI means that there must be a backup plan in case something goes wrong. Additionally, the AI must be reliable, accurate, and reproducible. This can help to prevent or minimize unintentional harm caused by it, which will make it trustworthy.<\/p>\n\n\n\n<h3><strong>3.&nbsp;<\/strong><strong>Privacy and Data Governance<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Respect for data protection and privacy is one of the key qualities of a trustworthy AI. Additionally, a trustworthy AI ensures adequate mechanisms for data governance; these mechanisms are provisioned after ensuring data quality and integrity as well as its legitimate access.<\/p>\n\n\n\n<h3><strong>4.&nbsp;<\/strong><strong>Transparency<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Transparency of AI systems, data, and business models is needed to ensure a trustworthy AI. This can be achieved with mechanisms that are designed to ensure traceability. Another important step is explaining AI systems and the decisions made by them in a language that can be easily understood by the user or stakeholder. It is also important to inform them about the capabilities and limitations of the AI system.<\/p>\n\n\n\n<h3><strong>5.&nbsp;<\/strong><strong>Diversity, Non-Discrimination, and Fairness<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Since this can lead to many negative implications, AI systems must not have any bias. Examples of some AI biases that can have negative implications on the society are the aggravation of discrimination and the exclusion of vulnerable groups.<\/p>\n\n\n\n<p>Not only should AI systems foster diversity by being accessible to all, but they should also involve all key stakeholders throughout their entire lifecycle.<\/p>\n\n\n\n<h3><strong>6.&nbsp;<\/strong><strong>Social and Environment Wellbeing<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The first requirement for trustworthy AI puts great emphasis on this issue. It is important to develop AI systems for the benefit of all people and not just a select few. When we say all people, we not only include those present today but our future generations as well.<\/p>\n\n\n\n<p>Therefore, AI systems must be developed to be sustainable and environmentally-friendly. In addition to humans, other living beings in the environment must be considered to understand the true social and social impact of AI development and use.<\/p>\n\n\n\n<h3><strong>7.&nbsp;<\/strong><strong>Accountability<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The seventh and final requirement for trustworthy AI is accountability. &nbsp;To ensure the accountability of AI, governments and organizations need to put mechanisms that are dedicated to this purpose. This accountability is not just limited to the AI system. Instead, it extends to the outcomes produced by the system. A key role in these accountability processes is played by auditability; this is because auditability allows for data, algorithms, and design processes to be assessed. <\/p>\n\n\n\n<p>By fulfilling the above-mentioned requirements, governments and organizations can ensure a trustworthy AI.<\/p>\n\n\n\n<h2><strong>Using International Standards as a Tool for AI Governance<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>For many decades, the governing bodies responsible for the implementation and adoption of international standards have played a key role in getting private entities to adopt and abide by the governance standards.<\/p>\n\n\n\n<p>Some examples of these governing bodies are IEEE, IEC, and ISO; these governing bodies don’t work like a dictatorship. Instead, they develop standards using a consensus process that involves consulting the government, businesses, academia, and other key stakeholders.<\/p>\n\n\n\n<p>In the past, international standards for governance have ensured worldwide interoperability. Today, international AI governance standards are helping to encourage governments to get into the act. An example of this is the US Executive Order on AI that prioritizes the development of AI governance standards. Additionally, the US government is developing an engagement strategy for these standards.<\/p>\n\n\n\n<p>Unlike the past, China has also agreed to take part in the AI governance efforts. In 2018, a standards strategy that prioritized the development of international standards was published by the Chinese government. In the same year, a <a href=\"https:\/\/www.newamerica.org\/cybersecurity-initiative\/digichina\/blog\/chinese-interests-take-big-seat-ai-governance-table\/\">standards sub-committee for Artificial Intelligence (SC 42)<\/a>&nbsp;was created by the ISO and IEC’s Joint Technical Committee for IT.<\/p>\n\n\n\n<p>The leadership of this sub-committee was contested by both the US and China, ultimately leading to a compromise. A Huawei-based US employee chairs the SC 42, and the secretariat of the committee is based in the US. However, Beijing was the site of the first-ever meeting of the committee. Currently, standards development is underway at SC42. At the same time, a series of standards are being developed by the IEEE to address algorithmic bias, transparency, and fail-safe design.<\/p>\n\n\n\n<h2><strong>Final Word<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Establishing governance mechanisms is needed not just to ensure a trustworthy AI system, but it also needed for getting accurate, reliable outcomes from the systems that are free from all kinds of bias.<\/p>\n\n\n\n<p>In this post, we discussed what is AI governance, the AI governance challenge, how to govern AI, the seven key requirements for trustworthy AI, and how international standards can be used as an AI governance tool.<\/p>\n\n\n\n<p>This article wraps up our Ethical AI 101 series. Please don&#8217;t hesitate to <a href=\"https:\/\/achievion.com\/contact\">contact us<\/a> if you have any questions on this topic or need help with delivering successful AI projects that adhere to 10 principles of ethical AI.<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":2965,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[85],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2947"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=2947"}],"version-history":[{"count":3,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2947\/revisions"}],"predecessor-version":[{"id":2964,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2947\/revisions\/2964"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/2965"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=2947"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=2947"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=2947"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}