{"id":1046,"date":"2017-06-01T16:04:26","date_gmt":"2017-06-01T20:04:26","guid":{"rendered":"http:\/\/achievion.com\/?p=1046"},"modified":"2017-06-05T21:03:24","modified_gmt":"2017-06-06T01:03:24","slug":"what-are-progressive-web-applications","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/what-are-progressive-web-applications.html","title":{"rendered":"What Are Progressive Web Applications?"},"content":{"rendered":"<p>Progressive web apps are the latest attempt to bridge the gap between the mobile web, native apps, and web applications. However, if you think this is something new, <span style=\"font-weight: 400;\">progressive web apps are not actually new. The majority of mobile browsers have offered the ability to bookmark a website to the phone&#8217;s screen since 2011 (<\/span><a href=\"https:\/\/www.androidpit.com\/how-to-add-bookmark-android-home-screen\"><span style=\"font-weight: 400;\">2013 for Chrome Android<\/span><\/a><span style=\"font-weight: 400;\">). In fact, <\/span><a href=\"https:\/\/app.ft.com\/\"><span style=\"font-weight: 400;\">The Financial Times<\/span><\/a><span style=\"font-weight: 400;\"> has been using a progressive web app to deliver mobile content since 2012.<\/span><\/p>\n<p>Here are some additional examples of progressive web apps and what they are used for:<\/p>\n<p>1. <a href=\"https:\/\/qrcodescan.in\/\">QR Code Scanner<\/a> &#8211; QR Code Scanner is a progressive web application that allows users to scan QR codes from anywhere.<br \/>\n2. <a href=\"https:\/\/www.englishaccentsmap.com\/\">English Accents Map<\/a> &#8211; Watch English accents videos and get an insight into the different ways the language is used by native speakers around the world.<br \/>\n3. <a href=\"https:\/\/www.currency-x.com\/\">Currency-x.com<\/a> &#8211; Currency calculator offering the latest exchange rates.<\/p>\n<p><span style=\"font-weight: 400;\">As you can see, progressive apps have a variety of use cases and are designed with users&#8217; convenience in mind. In this brief guide, we&#8217;ll go over everything you need to know about progressive web apps, with detailed characteristics and benefits so that you can decide if a progressive web app is right for your business. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Why We Need Progressive Web Apps<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The general consensus is that apps are fast and websites are slow. Everybody, including the average web user, already understands that this problem is due to the fact that mobile web applications and websites simply aren&#8217;t built for smartphones and other mobile devices. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a result, Facebook and Google first attempted to patch this problem by launch projects aimed at attacking the speed of web pages loading on mobile devices with Facebook introducing <\/span><a href=\"https:\/\/instantarticles.fb.com\/\"><span style=\"font-weight: 400;\">Facebook Instant Articles<\/span><\/a><span style=\"font-weight: 400;\"> in 2015 and Google introducing <\/span><a href=\"https:\/\/www.ampproject.org\/\"><span style=\"font-weight: 400;\">The Accelerated Mobile Pages Project (AMP)<\/span><\/a><span style=\"font-weight: 400;\">, which launched in 2016.<\/span><\/p>\n<p>While some news organizations and other companies have embraced these solutions, they have not yet enjoyed widespread adoption. This is due to the fact that they offer little to no support for web features other than content, such as forms and scripts.<\/p>\n<p>As app technology evolves, progressive web apps may finally provide the solution to bridge the gap between the performance of native apps and the web. With this solution, we may finally have a way to produce web apps that are both fast and reliable and are also ready for the mobile-first age.<\/p>\n<h2><span style=\"font-weight: 400;\">Progressive Web App Characteristics<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A progressive web app combines the best features of web and mobile apps. Put simply, it is a website that is built using web technologies that enable it to work just like an app. With progressive web apps, users can receive push notifications, install them to their home screens, and even work offline. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To be considered as a progressive web app, an application must have the following characteristics:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Progressive.<\/b><span style=\"font-weight: 400;\"> A progressive web app must work on any device and offer cross-browser support.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>App-like UX.<\/b><span style=\"font-weight: 400;\"> Every click of a button or link should result in an immediate response. Actions should be accompanied by placeholder loading screens as users wait for a response from the network.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Installable.<\/b><span style=\"font-weight: 400;\"> Users should be able to install it on their device&#8217;s home screen.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>SEO-friendly.<\/b><span style=\"font-weight: 400;\"> It should appear in the search engines with appropriate metadata provided.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Shareable.<\/b><span style=\"font-weight: 400;\"> Users should be able to share the app via a single URL. Individual pages should be deep-linkable.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Responsive.<\/b><span style=\"font-weight: 400;\"> It should offer a responsive design to ensure that it works on any device.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Offline Access.<\/b><span style=\"font-weight: 400;\"> It should offer offline or low connectivity access.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Secure.<\/b><span style=\"font-weight: 400;\"> Progressive web apps should always be hosted over HTTPS and prevent mixed content.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The most important thing to know about progressive web apps is that they do not require installation. Progressive apps are not available in Google Play or the iTunes App store. To download a progressive web app, all you need to do is visit its website it and add it to your home screen as a shortcut.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Application Shell Architecture and Service Workers<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">For speed and functionality, progressive web apps rely on two features: Application Shell Architecture and Service Workers. Service Workers are the foundation of Application Shell Architecture. <\/span><\/p>\n<p><a href=\"https:\/\/developers.google.com\/web\/updates\/2015\/11\/app-shell?hl=en\"><span style=\"font-weight: 400;\">Service Workers<\/span><\/a><span style=\"font-weight: 400;\"> help to increase web app performance by caching and delivering content, allowing for instant loading. Service Workers are also what make it possible for progressive web apps to function offline. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Application Shell is served by the Service Worker. Combining these features enables users to see the shell of the app before the content itself loads, thus delivering faster load times. In fact, during testing Google developers found that combining Application Shell Architecture and Service Workers drastically reduced the time it took for sites to load over mobile connections, reducing it to just 0.5 seconds per request. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If your site is very small, you probably don&#8217;t need to make use of an application shell. However, if you are building a complex app, it makes sense to use this technology for better performance.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Progressive Web App Benefits<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Progressive web apps provide features that can help to aid the growth of your business or organization. Building a progressive web app offers many benefits, namely:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Featured on the home screen.<\/b><span style=\"font-weight: 400;\"> When you offer a high-quality progressive web app, users will feel compelled to add it to their home screens.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Increased engagement.<\/b><span style=\"font-weight: 400;\"> Using a progressive web app can deliver higher engagement as users spend more time on your site.<\/span><\/li>\n<li style=\"font-weight: 400;\"><b>Higher conversion rates.<\/b><span style=\"font-weight: 400;\"> Delivering an amazing user experience translates to higher conversion rates and potentially more sales for your business. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The most common app development plan for a business is to build a native Android or iOS, in addition to a website. However, progressive web apps can potentially replace the functions of both native apps and websites given the ability of progressive web apps to work well across platforms.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Conclusion<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Progressive web apps are starting to gain more traction as users download fewer and fewer native apps. With support for native features, such as working offline, clipboard access, launching in full screen, and more, adoption of progressive web apps for business is only expected to grow. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are some exciting developments on the horizon the world of web apps, thanks to increasing support for new technologies and added features. If you are considering a web app for your business, now is a great time to explore the potential of progressive web apps. <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">Take 30 minutes with us<\/span><\/a><span style=\"font-weight: 400;\"> to discuss your web development next project. <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1059,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[25,62],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1046"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1046"}],"version-history":[{"count":13,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1046\/revisions"}],"predecessor-version":[{"id":1060,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1046\/revisions\/1060"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1059"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1046"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1046"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1046"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}