{"id":1297,"date":"2017-11-15T14:19:00","date_gmt":"2017-11-15T19:19:00","guid":{"rendered":"http:\/\/achievion.com\/?p=1297"},"modified":"2017-12-01T21:41:37","modified_gmt":"2017-12-02T02:41:37","slug":"top-7-ethereum-decentralized-apps","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/top-7-ethereum-decentralized-apps.html","title":{"rendered":"Top 7 Ethereum Decentralized Apps"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">The development of Ethereum Dapps exploded in 2017. As startups began to explore the potential that the Ethereum platform offers thanks to its blockchain technology which permits Dapps to be built on top of it, the number of projects has grown exponentially. Currently, Ethereum’s digital currency called ether also holds the second largest market capitalization behind bitcoin.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ethereum’s potential as a platform for building Dapps has also fueled a rush in startups raising money via ICOs. In fact, several startups have already raised hundreds of millions of dollars to support the development of their Dapps on the Ethereum blockchain. One example, <\/span><a href=\"https:\/\/www.bancor.network\/#\/\"><span style=\"font-weight: 400;\">Bancor<\/span><\/a><span style=\"font-weight: 400;\">, managed to raise approximately $153 million in ether, the digital currency of the Ethereum Blockchain network, during its ICO in June 2017. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Why Is Ethereum So Powerful?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Ethereum is leading the pack when it comes to Dapps simply because the Ethereum system can support decentralized smart contracts. Smart contracts are designed to verify or assist in the negotiation or performance of a contract. Thanks to blockchain technology this is done in a manner that is transparent and unhackable.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Although the overwhelming majority of Dapps are still under development, there are some projects that have managed to attract viable user bases. Here is a quick overview of the top 7 Ethereum Dapps at the moment and the services that they provide.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Alice<\/span><\/h2>\n<p><a href=\"http:\/\/alice.si\/\"><span style=\"font-weight: 400;\">Alice<\/span><\/a><span style=\"font-weight: 400;\"> is a social funding and impact management platform that is designed to improve transparency in philanthropy. The goal of the platform is to incentivize social organizations, such as charities, NGOs, and social enterprises to run projects on the Alice platform, which is built on the Ethereum blockchain.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With the performance of each project being publicly available, ultimately funders can identify and give directly to those social projects that are actually doing the most good. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Mist<\/span><\/h2>\n<p><a href=\"https:\/\/github.com\/ethereum\/mist\/\"><span style=\"font-weight: 400;\">Mist Browser<\/span><\/a><span style=\"font-weight: 400;\"> is extremely popular because it functions as the end-user interface for Ethereum, which makes it the tool of choice to browse and use Dapps. It is also specifically designed for non-technical users.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Mist Browser also comes with Mist Wallet, which is the official Ethereum wallet client. It supports two types of wallet solutions allowing users to set up a simple wallet, as well as, a multisignature wallet for extra security. While it is designed to be easy to use, it does have a significant drawback given the fact that users must first download the entire Ethereum blockchain before the wallet can be used.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">BITNATION<\/span><\/h2>\n<p><a href=\"https:\/\/bitnation.co\/\"><span style=\"font-weight: 400;\">BITNATION<\/span><\/a><span style=\"font-weight: 400;\"> is a virtual nation that is hosted on the Ethereum blockchain. It has many of the same functions as a traditional, geographical nation in that it has education, insurance, a public notary, diplomacy programs, and identification cards. Users can become citizens or allies, join embassies and consulates or start their own nations. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to founder Susanne Tarkowski Tempelhof, BITNATION wants to become the world&#8217;s first blockchain powered Virtual Nation that can actually replace the real-world nation state system with a voluntary form of governance. As a result, everyone will have the ability to choose the nation that they prefer to be a citizen of.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Everex<\/span><\/h2>\n<p><span style=\"font-weight: 400;\"><a href=\"https:\/\/www.everex.io\/\">Everex<\/a> is a company that delivers microfinance and remittance services. It offers a mobile and a desktop-based digital wallet which allows users to transact in and exchange tokens that are denominated in fiat currencies. There are also no fees for exchanging money and all of the micro-loans and micro-credit issued on the platform are 100% based by Ethereum and Ethereum-based cryptocurrencies.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Bancor <\/span><\/h2>\n<p><a href=\"https:\/\/www.bancor.network\/#\/\"><span style=\"font-weight: 400;\">Bancor<\/span><\/a><span style=\"font-weight: 400;\"> offers two services, The Bancor Network&#x2122; and The Bancor Protocol&#x2122;. The Bancor Network&#x2122; bills itself as a &#8220;Decentralized Liquidity Network&#8221; which allows you to hold any Ethereum token and convert into any other token in the network at a price that is automatically calculated through using a web wallet.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Bancor Protocol&#x2122; offers an upgraded functionality standard for Ethereum tokens, allowing anyone to create a new type of cryptocurrency known as a Smart Token&#x2122;. Some potential use cases for this service include complementary currencies, business loyalty point programs, token baskets, content creators, crowdsales, and token changers.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Etheria<\/span><\/h2>\n<p><a href=\"http:\/\/etheria.world\/\"><span style=\"font-weight: 400;\">Etheria<\/span><\/a><span style=\"font-weight: 400;\"> is a virtual world where players can build things. The game&#8217;s design is reminiscent of Minecraft. However, the benefit of this Dapp is the fact that Etheria is fully based on the Ethereum blockchain. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Users can purchase tiles in Etheria for full Ether. In addition, unlike Minecraft, Etheria can not be hacked which means a person&#8217;s land can never be tampered with or restricted.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Gnosis<\/span><\/h2>\n<p><a href=\"https:\/\/gnosis.pm\/\"><span style=\"font-weight: 400;\">Gnosis<\/span><\/a><span style=\"font-weight: 400;\"> is a platform that was created in order to deliver a decentralized prediction market. With Gnosis, users can vote on almost everything from the weather to sports scores and election results. The goal is to offer a prediction market as a service. It allows users to create events that can be subsequently funded by a single investor or by using crowdfunding. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In theory, the platform could be potentially used for many applications. In addition, it is designed to be customizable by offering an application layer, Gnosis services with fees paid by WIZ tokens, and Gnosis Core.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The Future Is Promising<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">While these are the most popular Dapps right now, just think of the potential there is for the adoption of your own Dapp idea. In fact, these are just a few of the hundreds of Dapps that are currently deployed or under development. To learn about other Dapps projects on the Ethereum Blockchain, <\/span><a href=\"https:\/\/www.stateofthedapps.com\/\"><span style=\"font-weight: 400;\">State of the Dapps<\/span><\/a><span style=\"font-weight: 400;\"> is a not-for-profit curated directory of Dapps that receives regular updates and currently contains a list of 854 Dapps.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">At Achievion, we can help you bring your vision to life through planning and development with the goal of helping you to gain traction for your Dapp quickly. <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">Contact us today<\/span><\/a><span style=\"font-weight: 400;\"> to discuss your project idea and let&#8217;s get started.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1305,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1297"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1297"}],"version-history":[{"count":7,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1297\/revisions"}],"predecessor-version":[{"id":1306,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1297\/revisions\/1306"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1305"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1297"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1297"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1297"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}