{"id":1323,"date":"2017-12-01T15:56:19","date_gmt":"2017-12-01T20:56:19","guid":{"rendered":"http:\/\/achievion.com\/?p=1323"},"modified":"2017-12-18T19:51:25","modified_gmt":"2017-12-19T00:51:25","slug":"use-cases-blockchains-app-development","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/use-cases-blockchains-app-development.html","title":{"rendered":"What Are the Use Cases for Blockchains in App Development?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Blockchain technology is a revolution for both business and government. In fact, major initiatives are being made to take advantage of this decentralized technology that has the potential to increase efficiency, transparency, and security. Here are the potential use cases for blockchain technology across healthcare, finance, government and other industries. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Payments<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">For international payments, blockchain technology can be used to reduce the cost of international transfers by significantly reducing the role of banks in manually settling transactions. In fact, <\/span><a href=\"https:\/\/www.ft.com\/content\/2df2f65c-234f-11e6-9d4d-c11776a5124d\"><span style=\"font-weight: 400;\">Banco Santander<\/span><\/a><span style=\"font-weight: 400;\"> is already exploring ways of integrating blockchain technology in its payments space and has already launched a payments app using services provided by Ripple.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another benefit of using blockchain technology in the finance space is that it could help to decrease fraudulent transactions. Fraudulent transactions are difficult problem for the banking industry with one report indicating that identify theft and fraud accounted for $16 billion in lost revenues in 2016.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Regulatory Compliance <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Blockchain technology is capable of ensuring the integrity of the records it contains because account records cannot be altered once they appear on a blockchain. Ultimately, the use of blockchain technology could eliminate the need for auditors.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Blockchain is ideal for helping financial institutions comply with Know Your Customer (KYC) requirements, the process by which a financial institution identifies and verifies the identity of its clients. According to a survey done by <\/span><a href=\"https:\/\/www.thomsonreuters.com\/en\/press-releases\/2016\/may\/thomson-reuters-2016-know-your-customer-surveys.html\"><span style=\"font-weight: 400;\">Thomson Reuters<\/span><\/a><span style=\"font-weight: 400;\">, financial institutions currently spend an average of $60 million on KYC and customer due diligence. Some banks are already spending up to $500 million per year. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to a report by <\/span><a href=\"https:\/\/www.scribd.com\/doc\/313839001\/Profiles-in-Innovation-May-24-2016-1\"><span style=\"font-weight: 400;\">Goldman Sachs<\/span><\/a><span style=\"font-weight: 400;\">, a 10 percent headcount reduction could be achieved by introducing blockchain technology in KYC procedures, resulting in an annual cost-savings of <\/span><a href=\"https:\/\/bitcoinmagazine.com\/articles\/four-key-blockchain-use-cases-banks-fintech-network-report\/\"><span style=\"font-weight: 400;\">$160 million<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Insurance<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Blockchain technology could have a profound impact on the insurance industry thanks to one of the greatest assets of blockchain technology: smart contracts. According to <\/span><a href=\"https:\/\/www2.deloitte.com\/content\/dam\/Deloitte\/ch\/Documents\/innovation\/ch-en-innovation-deloitte-blockchain-app-in-insurance.pdf\"><span style=\"font-weight: 400;\">Deloitte<\/span><\/a><span style=\"font-weight: 400;\">, smart contracts powered by a blockchain could provide insurers and customers with a means of managing claims that is transparent to ensure that only valid claims are paid.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As an example, the blockchain would reject multiple claims for an accident because the network would already be aware of the fact that the a claim for the accident was already attempted. Smart contracts could also aid in the enforcement of claims by automatically triggering payments. In fact, <\/span><a href=\"https:\/\/www.pwc.com\/gx\/en\/financial-services\/publications\/assets\/blockchain-for-reinsurers.pdf\"><span style=\"font-weight: 400;\">PwC<\/span><\/a><span style=\"font-weight: 400;\"> places the potential costs savings of implementing blockchain technology for reinsurers at $5-10 billion. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Supply Chain Management<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The ledger created by the use of a blockchain makes it especially well suited to tracking goods as they move along the supply chain. Entries on the blockchain can be used for managing events, such as placing goods that have just arrived at a port in different shipping containers. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In fact, there already several companies that are offering blockchain supply chain management solutions to their clients. <\/span><a href=\"https:\/\/www.skuchain.com\/\"><span style=\"font-weight: 400;\">Skuchain<\/span><\/a><span style=\"font-weight: 400;\"> offers several products that rely on blockchain technology, including IMT which provides inventory financing, Popcodes a crypto-serialization solution which tracks the flow of goods on a SKU level, and BRACKETS, which are cryptographically secure smart contracts that are designed to govern the entire purchase cycle.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Healthcare <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The earliest use cases for blockchain in the healthcare industry involved the opportunity of helping patients to create health records that are controlled entirely by the individual. This could improve patient safety, matching, and identification, while decreasing administrative requirements. However, healthcare companies are now exploring opportunities for using blockchain technology for improving revenue cycle management, population health management, medication monitoring, payer administration, and more.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Recently, <\/span><a href=\"https:\/\/healthitanalytics.com\/news\/illinois-to-use-blockchain-for-healthcare-credential-management\"><span style=\"font-weight: 400;\">Illinois<\/span><\/a><span style=\"font-weight: 400;\"> became the first state to test out blockchain for the purposes of managing licensure and credentialing for payers and providers.  In a pilot program to be conducted with Hashed Health consortium, state officials plan to create a blockchain-based registry that will maintain a single, trusted record of certifications and credentials.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As another example, <\/span><a href=\"https:\/\/www.forbes.com\/sites\/jessedamiani\/2017\/11\/06\/simplyvital-health-blockchain-revolutionize-healthcare\/\"><span style=\"font-weight: 400;\">SimplyVital Health<\/span><\/a><span style=\"font-weight: 400;\"> has developed two products: ConnectingCare and Health Nexus. ConnectingCare is designed to help healthcare providers gain insight into what happens to patients after they leave the hospital, creating an audit trail. Health Nexus is a secure platform that allows healthcare providers to share data. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It also creates the opportunity for individuals to monetize their medical data by selling it to interested parties. The company also recently launched a token sale for Health Cash (HLTH) to support the growth of the Health Nexus ecosystem. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Real Estate<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Real estate has traditionally be an industry that has been slow to adopt technological innovation. Now blockchain technology is introducing new ways to facilitate real estate and rental property transactions. <\/span><a href=\"https:\/\/ico.atlant.io\/signup?\"><span style=\"font-weight: 400;\">ATLANT<\/span><\/a><span style=\"font-weight: 400;\">, a company which recently launched its own ICO, is a platform that tokenizes real property so that the assets can be traded like stocks on an exchange and transactions can be done online. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Blockchain also has the potential to lower the barriers to real estate investing by making it easier for investors to pool funds to acquire properties. As a decentralized technology, the blockchain can also help to maintain the integrity of real estate transactions given the wire fraud is one of the biggest threats that the real estate industry currently faces, with cyber criminals having stolen or attempted to steal <\/span><a href=\"http:\/\/safeharbortc.com\/2017\/11\/29\/wire-fraud-is-the-fastest-growing-real-estate-cybercrime-in-the-u-s\/\"><span style=\"font-weight: 400;\">$1 billion in 2017<\/span><\/a><span style=\"font-weight: 400;\">, up from $19 million in 2016.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Energy<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">According to a study done by <\/span><a href=\"https:\/\/www.pwc.com\/gx\/en\/industries\/assets\/pwc-blockchain-opportunity-for-energy-producers-and-consumers.pdf\"><span style=\"font-weight: 400;\">PwC<\/span><\/a><span style=\"font-weight: 400;\">, blockchain technology could be used to execute energy supply transactions, manage assets, document ownership, emission allowances, renewable energy certificates. It could also be used in providing a basis for metering, billing, and clearing processes.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Government<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Governments are involved in record management, taxation, legislation, compliance, and regulatory matters. These are all transactions that could be made more transparent by implementing blockchain technology. In addition, implementing blockchain technology would nearly eliminate the risk of identity theft and improve cybersecurity because it removes the risk of a single point of failure.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Help Organizations Implement Blockchain Technology<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">With so many opportunities for blockchain technology from business to government, Achievion can help you devise a plan to execute your application vision. From strategy planning to development, we can advise you on how to create new blockchain solutions to help companies and governments manage their operations more effectively. <\/span><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">Schedule a free consultation<\/span><\/a><span style=\"font-weight: 400;\"> with us today and let’s get started.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1336,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1323"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1323"}],"version-history":[{"count":6,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1323\/revisions"}],"predecessor-version":[{"id":1335,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1323\/revisions\/1335"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1336"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1323"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1323"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1323"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}