{"id":1403,"date":"2018-01-02T13:10:54","date_gmt":"2018-01-02T18:10:54","guid":{"rendered":"http:\/\/achievion.com\/?p=1403"},"modified":"2018-02-07T14:16:31","modified_gmt":"2018-02-07T19:16:31","slug":"ethereum-ultimate-beginners-guide","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/ethereum-ultimate-beginners-guide.html","title":{"rendered":"What is Ethereum? The Ultimate Beginners’ Guide"},"content":{"rendered":"<div class=\"page\" title=\"Page 1\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p>With the second largest market cap in the cryptocurrency world, Ethereum has drawn a lot of attention from investors and crypto enthusiasts alike.<\/p>\n<p>This relatively new cryptocurrency not only presents a significant change to the status quo, it also allows for the quick development and deployment of new applications. Ethereum essentially enables dozens of new and extremely innovative cryptocurrencies to exist.<\/p>\n<p>While Ethereum’s utility is obvious to programmers and the tech world at large, many people who are less tech-savvy have trouble understanding it. We’ve designed this guide to appeal to both crowds and expose anyone from complete crypto beginners and intermediates to this potentially game-changing cryptocurrency.<\/p>\n<h2>Ethereum vs. Bitcoin<\/h2>\n<p>If you’re interested in Ethereum, chances are you have some sort of foundational knowledge of <a href=\"https:\/\/coincentral.com\/what-is-bitcoin\/\">Bitcoin<\/a>. All cryptocurrencies inevitably get compared to Bitcoin, and it frankly makes understanding them much easier. Bitcoin launched in 2009 as the world’s first cryptocurrency, with the single goal of creating a decentralized universal currency. This currency would not require any intermediary financial institutions, but would still ensure safe and valid transactions. This was made possible by a revolutionary technology called the “<b>blockchain<\/b>.”<\/p>\n<p>The blockchain is a digital ledger, continuously recording and verifying records. It’s used to track and verify Bitcoin transactions. Since the global network of communicating nodes maintains the blockchain, it’s pretty much incorruptible. As new blocks are added to the network, they are constantly validated.<\/p>\n<p>Similar to Bitcoin, Ethereum is a distributed public blockchain network. While both Ethereum and Bitcoin are cryptocurrencies that can be traded among users, there are many substantial differences between the two.<\/p>\n<p>Bitcoin, for example, utilizes  blockchain to track ownership of the digital currency, making it an extremely effective peer to peer electronic cash system. Ethereum, on the other hand, <b>focuses on running the programming code of an application<\/b>. Application developers largely use it to pay for services and transaction fees on the Ethereum network.<\/p>\n<p>Both Bitcoin and Ethereum are “decentralized,” meaning they have no central control or issuing authority. Respective miners run each network by validating transactions to earn either bitcoin (for Bitcoin) or ether (for Ethereum).<\/p>\n<p>If you’re still having trouble making the distinction, the words of<a href=\"http:\/\/gavwood.com\/\" rel=\"noopener\"> Dr. Gavin Wood<\/a>—one of Ethereum’s Co-Founders—might help:<\/p>\n<p><img loading=\"lazy\" class=\"lazyloading\" src=\"https:\/\/coincentral.com\/wp-content\/uploads\/2017\/08\/gavin-wood-150x150.jpg\" alt=\"Dr. Gavin Woode, Ethereum Co-Founder\" width=\"150\" height=\"150\" data-was-processed=\"true\" \/><\/p>\n<p>“Bitcoin is first and foremost a currency; this is one particular application of a blockchain. However, it is far from the only application. To take a past example of a similar situation, e-mail is one particular use of the internet, and for sure helped popularise it, but there are many others.”<\/p>\n<h4>Dr. Gavin Wood, Ethereum Co-Founder<\/h4>\n<p>Ethereum is simply the application of blockchain for a completely different purpose.<\/p>\n<h2><b>What is Ethereum?<\/b><\/h2>\n<p>Simply put, Ethereum is a blockchain-based decentralized platform on which decentralized applications (Dapps) can be built.<\/p>\n<ul>\n<li>    Remember, blockchain is the structure the vast majority of cryptocurrencies run on. It’s a database with no central server that keeps track of every transaction and exchange.<\/li>\n<li>    We’ll jump into decentralized apps—referred to as dapps–in greater detail later, but just know they are applications that serve a certain purpose to a user. Fasten your seatbelts, some of these dapps are amazing.<\/li>\n<\/ul>\n<p>Ethereum’s appeal is that it is built in a way that enables developers to create smart contracts. <b>Smart contracts<\/b> are scripts that automatically execute tasks when certain conditions are met. For example, a smart contract could technically say, “pay Jane $10 if she submits a 1000 word article on goats by September 15, 2018,” and it would pay Jane once the conditions are met.<\/p>\n<p>These smart contracts are executed by the Turing-complete Ethereum Virtual Machine (EVM), run by an international public network of nodes.<\/p>\n<p>The cryptocurrency of the Ethereum network is called <b>ether<\/b>. Ether serves two different functions:<\/p>\n<ul>\n<li>   <b>Compensate the mining full nodes that power its network. <\/b>This keeps things running smoothly at an administrative level.<\/li>\n<li>   <b>Pay people under smart contract conditions.<\/b> This is what motivates users to work on the Ethereum platform.<\/li>\n<\/ul>\n<p>If you’re still a little confused, don’t worry. The underlying technology is complicated even at a surface level. By the end of this guide, you’ll have a better understanding of Ethereum than 99.999% of people out there… and that’s a pretty good start! We’ll go over things such as how Ethereum functions, Ethereum’s history, and some of the exciting dapps running on the Ethereum platform.<\/p>\n<h2><b>Welcome to a Wild Ride: Ethereum<\/b><\/h2>\n<p>In 2011, a 17 year old Russian-Canadian boy named Vitalik Buterin learned about Bitcoin from his father.<\/p>\n<p>In 2013, after visiting developers across the world who shared an enthusiasm for programming, Buterin published a white-paper proposing Ethereum.<\/p>\n<p>In 2014, Buterin dropped out of the University of Waterloo after receiving the<a href=\"http:\/\/thielfellowship.org\/\" rel=\"noopener\"> Thiel Fellowship<\/a> of $100,000 to work on Ethereum full-time.<\/p>\n<p>In 2015, the Ethereum system went live.<\/p>\n<p>In 2017, Ethereum hit a cap rate of $36 billion dollars.<\/p>\n<p>Whether you’re looking at this from an investment standpoint, tech perspective, or witness to history; Ethereum is extremely exciting. Buterin’s goal was to bring the same decentralization from Bitcoin to more than just currency. This could be accomplished by building a fully-fledged Turing-complete programming language into the Ethereum blockchain.<\/p>\n<p>The<a href=\"https:\/\/github.com\/ethereum\/wiki\/wiki\/White-Paper\" rel=\"noopener\"> Ethereum white paper<\/a> goes into detail for some of the potential use cases, all of which could be built through decentralized apps on the Ethereum network. The list goes on and on:<\/p>\n<ul>\n<li>    Token Systems<\/li>\n<li>    Financial Derivatives<\/li>\n<li>    Identity and Reputation Systems<\/li>\n<li>    File Storage<\/li>\n<li>    Banking<\/li>\n<li>    Centralized Autonomous Organizations<\/li>\n<li>    Insurance<\/li>\n<li>    Data Feeds<\/li>\n<li>    Cloud Computing<\/li>\n<li>    Prediction Markets<\/li>\n<\/ul>\n<p>By building these apps on the Ethereum network, these dapps can utilize Ethereum’s blockchain instead of having to create their own.<\/p>\n<h2><b>The Ethereum Virtual Machine<\/b><\/h2>\n<p>Early blockchain applications like Bitcoin only allowed users a set of predefined operations. For example, Bitcoin was created exclusively to operate as a cryptocurrency.<\/p>\n<p>Unlike these early blockchain projects, Ethereum allows users to create their own operations.  The <b>Ethereum Virtual Machine <\/b>(EVM) makes this possible. As Ethereum’s runtime environment, the EVM executes <b>smart contracts<\/b>. Since every Ethereum node runs the EVM, applications built on it reap the benefits of being decentralized without having to build their own blockchain.<\/p>\n<h2><b>Smart Contracts<\/b><\/h2>\n<p>Smart contracts are strings of computer code capable of automatically executing when certain predetermined conditions are met. Instead of requiring a single central authority to say “yay” or “nay,” these contracts are self-operated. This not only makes the entire process more effective, it also makes it more fair and objective.<\/p>\n<p>For example, a simple smart contract use case would be:<\/p>\n<ul>\n<li>    <b>Jim wants to bet Sarah 100 Ether<\/b> (ETH) that the price of ETH will be above $1000 on August 30th, 2018.<\/li>\n<li>    They agree on a data feed to be used to determine the ETH price.<\/li>\n<li>    They each escrow 100 ETH to a smart contract, with the winner taking the full 200 ETH.<\/li>\n<li>    On August 30th, 2018 the data feed is queried and the contract immediately executes <b>sending money to the winner.<\/b><\/li>\n<\/ul>\n<p>Using the smart contract, there’s no need for Jim and Sarah to trust each other. They just have to trust the data feed. Keep in mind that this is only a very simple example. Many smart contracts are extremely complex and can work wonders. The takeaway: Smart contracts can automate a variety of tasks, without requiring intermediaries. <b>All a smart contract needs is the arbitrary rules written into it. <\/b><\/p>\n<p>Now, let’s move on to the Dapps.<\/p>\n<h2><b>Decentralized Apps (Dapps)<\/b><\/h2>\n<p>Most of us have a pretty good understanding of what an application (app) is. An application is formally defined as a program or piece of software designed and written to fulfill a particular purpose of the user. We use apps every day: Apps allow us to check our bank balance, scroll through a live feed of pictures, or even launch a Flappy Bird into oblivion.<\/p>\n<p>Now take this definition and ~*~decentralize~*~ it. Dapps serve similar functions, but run on an entire network of nodes rather than a central source. The fact that they are decentralized gives dapps an enormous advantage over traditional apps.<\/p>\n<p>You know when Instagram is down <b>because the server is down<\/b>? This doesn’t happen with dapps. How about when Zomato <b>got hacked<\/b> and exposed the information of 17 million people? This doesn’t happen either.<\/p>\n<p>Moreover, Dapps are:<\/p>\n<ul>\n<li>    <b>Open Source<\/b> – Dapps allow users to view the app code on both the frontend and backend. No sketchy “allow us to use your location” nonsense unless otherwise stated.<\/li>\n<li>    <b>Autonomous <\/b>– Dapps automatically act by the rules encoded into them. No room for outside corruption.<\/li>\n<li>    <b>Secure<\/b> – Data and protocols are stored on the blockchain cryptographically. No hacks.<\/li>\n<li>    <b>100% Uptime <\/b>– The blockchain is always running, meaning zero downtime for dapps. No crashes.<\/li>\n<li>    <b>Easier to Implement<\/b> – Developers wanting to take advantage of blockchain technology do not need to create a new blockchain. The framework is there, saving dapp creators a ton of time and effort spent creating a potentially subpar framework. In order to run on this decentralized network, dapps just pay transaction fees.<\/li>\n<\/ul>\n<p>In many cases, front-end users can’t even distinguish dapps from regular apps. Dapps typically use HTML\/JavaScript web applications to communicate with the blockchain, appearing the same to users as many applications you’re already using today.<\/p>\n<h2><b>Ethereum Dapps Use Cases<\/b><\/h2>\n<p>Fasten your seatbelts and get your Twitter-fingers ready, it’s finally time for the most exciting part of this guide. Ethereum’s intersection with the real world is paved with innovation and disruption. There are already a huge number of projects, both live and in development, built on the Ethereum network. Here are just some of the most successful and promising of these dapps.<\/p>\n<p><img loading=\"lazy\" class=\"lazyloading\" src=\"https:\/\/coincentral.com\/wp-content\/uploads\/2017\/08\/golem-300x185.png\" alt=\"Ethereum Guide Golem Dapp\" width=\"300\" height=\"185\" data-was-processed=\"true\" \/><\/p>\n<p><a href=\"https:\/\/golem.network\/\" rel=\"noopener\"><b>Golem<\/b><\/a>: The Golem project aims to make a global supercomputer easily accessible to anyone.  It’s essentially the first decentralized sharing economy of computing power. As a global market, users would be able to make money by “renting” out their idle computing power, or spend money to have access to a supercomputer. Hold up, have you ever used a supercomputer? Supercomputers cost between a million dollars and a good fraction of a billion dollars. The modern Tianhe-2 Supercomputer has the power of roughly 18,400 Playstation 4s. Golem’s goal is to make this sort of power easily accessible anywhere in the world at an infinitesimal cost.<\/p>\n<p><img loading=\"lazy\" class=\"lazyloading\" src=\"https:\/\/coincentral.com\/wp-content\/uploads\/2017\/08\/augur-300x172.jpg\" alt=\"What is Ethereum's Augur Dapp\" width=\"300\" height=\"172\" data-was-processed=\"true\" \/><\/p>\n<p><a href=\"https:\/\/augur.net\/\" rel=\"noopener\"><b>Augur<\/b><\/a><b>: <\/b>Augur’s goal is to utilize a decentralized network to create a powerful forecasting tool using prediction markets. Augur would reward users for correctly predicting future events. While at a surface level it may just seem like a decentralized betting platform (which is still worth a lot), Augur could potentially provide provide powerful predictive data for virtually any industry. Prediction markets are more accurate at forecasting than individual experts, traditional opinion polling, and surveys.<\/p>\n<p><img loading=\"lazy\" class=\"lazyloading\" src=\"https:\/\/coincentral.com\/wp-content\/uploads\/2017\/08\/civic-300x194.jpg\" alt=\"Ethereum's Civic Dapp\" width=\"300\" height=\"194\" data-was-processed=\"true\" \/><\/p>\n<p><a href=\"https:\/\/www.civic.com\/\" rel=\"noopener\"><b>Civic<\/b><\/a>: Civic aims to protect user’s identities and provide blockchain-based, secure, low-cost, on-demand access to identity verification. This would not only prevent and provide users with assistance for identity fraud, but it would also remove the need for constant personal information and background verification checks. Think about how many times you’ve left your social security number with someone’s assistant and you can see the benefits of Civic.<\/p>\n<p><img loading=\"lazy\" class=\"lazyloading\" src=\"https:\/\/coincentral.com\/wp-content\/uploads\/2017\/08\/omisego-300x194.jpg\" alt=\"Ethereum's Omisego dapp\" width=\"300\" height=\"194\" data-was-processed=\"true\" \/><\/p>\n<p><a href=\"https:\/\/omg.omise.co\/\" rel=\"noopener\"><b>OmiseGO<\/b><\/a><b>: <\/b>OmiseGO vision is to solve the problems and inefficiencies of financial institutions, processors, and gateways by enabling decentralized exchange on a public blockchain at a lower cost and high volume. This means anyone will be able to conduct financial transactions such as payments, payroll deposits, B2B commerce, supply-chain finance, asset management, and loyalty programs without having to rely on a single server… and without exorbitant fees! The system is built in a way that allows the best currency (whether fiat or decentralized) to win.<\/p>\n<p><img loading=\"lazy\" class=\"lazyloading\" src=\"https:\/\/coincentral.com\/wp-content\/uploads\/2017\/08\/storj-300x169.jpg\" alt=\"Ethereum Storj Dapp\" width=\"300\" height=\"169\" data-was-processed=\"true\" \/><\/p>\n<p><a href=\"https:\/\/storj.io\/\" rel=\"noopener\"><b>Storj:<\/b><\/a> Storj’s aim is to make it possible for users to rent out their excess hard drive space in exchange for the crypto STORJ. Users could therefore also use Storj to rent additional hard drive space.<\/p>\n<p>These are only a handful of different dapps all running on the Ethereum platform. What really stands out with dapps is how their founder are able to “raise” real capital by selling tokens. Whereas traditional apps have to seek outside investment or IPO, a dapp can simply “ICO” and raise the capital they need to build their company. While this removes friction from the financing processes, it has unfortunately also made it possible for many sub-par dapps to ICO and take advantage of eager speculators.<\/p>\n<p>For more dapps, check out the<a href=\"https:\/\/dapps.ethercasts.com\/\" rel=\"noopener\"> State of the Dapps<\/a>. You find some <a href=\"https:\/\/coincentral.com\/upcoming-icos\/\">upcoming ICOs here<\/a>.<\/p>\n<h3><b>Ethereum vs Bitcoin: Continued<\/b><\/h3>\n<p>Now that you have a decent understanding of what Ethereum is and how it functions, it’s useful to revisit how it compares to Bitcoin at a technical level. While the two cryptocurrencies serve different purposes, Ethereum provides a number of benefits over Bitcoin:<\/p>\n<ul>\n<li>   <b>Shorter Block Times<\/b> – On Ethereum, blocks are mined roughly every 15 seconds compared to Bitcoin’s 10-minutes rate.  This shorter time allows the blockchain to more quickly start confirming transaction data, although it also means more orphaned blocks.<\/li>\n<li>   <b>More Sophisticated Fee Structure<\/b> – Ethereum transaction fees are based off storage needs and network usage. Bitcoin transactions are limited by block size and compete with each other.<\/li>\n<li>   <b>More Sophisticated Mining<\/b> – Bitcoin mining currently requires ASICs (Application-Specific Integrated Circuits), necessitating a large amount of capital investment to mine.  Ethereum’s mining algorithm was designed with ASIC-resistance in mind, thus leveling the playing field and aiding in the decentralization of mining.<\/li>\n<\/ul>\n<p>Ethereum arguably currently functions better than Bitcoin as a currency. With Ethereum, you can reliably send transactions faster,<a href=\"https:\/\/bitinfocharts.com\/comparison\/transactionfees-btc-eth.html\" rel=\"noopener\"> pay lower transaction fees<\/a>, and mine at a more profitable rate (although it still has its downfalls for miners).<\/p>\n<p><em><a href=\"https:\/\/coincentral.com\/?p=4132&amp;preview=true\">Read: Is Ethereum Mining Profitable?<\/a><\/em><\/p>\n<p>However, Bitcoin does have a relatively more stable price—and therefore functions as a better value storage option—from a trading and value storage perspective. Ethereum is much younger but has covered a substantial amount of ground in recent years. Although Ethereum certainly shows promise as a currency, its true potential lies in features nonexistent in Bitcoin’s code.<\/p>\n<h3><b>The DAO: Trouble in Paradise<\/b><\/h3>\n<p>The most famous DAO was simply known as The DAO. The nearly identical name causes a lot of confusion for people and gives DAOs a bad reputation.<\/p>\n<p>The DAO was a decentralized autonomous organization primarily functioning as its own investor-directed venture capital fund. It didn’t have the conventional management structure or board of directors, was not tied to any particular government, and instead ran on open source code. The DAO was set up to give funders the power to vote for which dapps deserved investment through DAO tokens.<\/p>\n<p>Dapps had somewhat of an approval process:<\/p>\n<ol>\n<li>   Get whitelisted by reputable figureheads in the Ethereum community<\/li>\n<li>   Get voted on by those who held DAO tokens<\/li>\n<li>   Get an approval of 20% in the vote in order to receive a share of DAO funds they required to get started.<\/li>\n<\/ol>\n<p>The DAO is most famous for the largest crowdfunding campaign in history, raising over $150 million in ether from more than 11,000 investors. The DAO is also most infamous for getting hacked for $50 million. This hack inevitably caused a split in the Ethereum community, creating what we now know as Ethereum (ETH) and Ethereum Classic (ETC).<\/p>\n<p><img loading=\"lazy\" class=\"lazyloading\" src=\"https:\/\/coincentral.com\/wp-content\/uploads\/2017\/08\/etheruem-classic.png\" alt=\"Ethereum Classic\" width=\"764\" height=\"318\" data-was-processed=\"true\" \/><\/p>\n<p>The hack happened because of The DAO’s “Split Function.” Funders who wanted to exit The DAO could use its “Split Function,” which would give them back the ether they had invested. The only stipulation was that existing funders had to hold their ether for 28 days before they could withdraw them.<\/p>\n<p>On June 17th 2016, an unknown person or group of people took advantage of a lapse in the Split Function’s security with a simple recursive function. This frustratingly easy hack allowed the hacker(s) to repeat their request to withdraw the same DAO tokens multiple times before the system registered it as $50 million.<\/p>\n<p>The news of this hack created chaos in the Ethereum community. While this hack had nothing to do with the Ethereum platform and everything to do with The DAO platform, many members of the Ethereum community were invested in The DAO. The community as a whole had 28 days to come up with a solution, which ended up being to “fork”—stop the current blockchain entirely and create something new from scratch.<\/p>\n<p>The new Ethereum (ETH) is the result of the fork, and is essentially the blockchain before the hack. The old Ethereum (Ethereum Classic – ETC) is still running the original blockchain with the hack included. The vast majority of the Ethereum community including the Ethereum founders pivoted along with ETH, with a small minority staying loyal to the original blockchain.<\/p>\n<h2><b>Future Updates to Ethereum<\/b><\/h2>\n<p>The future for Ethereum is bright, but it is not without its potential uncertainty.<\/p>\n<p>A notable event on the horizon is the Metropolis hard fork that is set to occur in late September. This hard fork indicates some major upgrades for the platform including:<\/p>\n<ul>\n<li>Increased anonymity with new zero-knowledge proofs, or “zk-SNARKs.” This means users will be able to conduct transactions at much more secure levels of anonymity than ever before.<\/li>\n<li>Smart contracts and programming will be much easier to work with. Gas is also going to be adjusted for bill setting.<\/li>\n<li>Masking will increase security on the network. Users will be able to determine the address for which they have a private key, and this will protect them from quantum computer hacking.<\/li>\n<li>A “difficulty bomb” will be included in the upgraded, meaning mining will become much more difficult. This is a significant step as Ethereum transitions from proof-of-work (PoW) to proof-of-sake (PoS).<\/li>\n<\/ul>\n<p>We won’t know how this hard fork will affect the price of Ethereum as markets could adjust in a variety of ways. If the upgrades attract more users, the price could rise. However, if mining becomes more difficult and slows, the price could fall. The next upgrade after Metropolis is referred to as Serenity, which should increase stability and<a href=\"https:\/\/cointelegraph.com\/news\/is-ethereum-getting-ready-for-mass-adoption\" rel=\"noopener\"> encourage more investment<\/a>.<\/p>\n<h2>Final Thoughts<\/h2>\n<p>While there is a lot of speculative interest around Ethereum, it’s important to note that the Ethereum and dapp communities are very much focused on building a tangible future. Ethereum is a phenomenal application of the blockchain and has made it possible for hundreds of projects to exist.<\/p>\n<p><img loading=\"lazy\" class=\"lazyloading\" src=\"https:\/\/coincentral.com\/wp-content\/uploads\/2017\/08\/vitalik-1-150x150.jpg\" alt=\"Vitalik Buterin Ethereum Founder\" width=\"150\" height=\"150\" data-was-processed=\"true\" \/><\/p>\n<p>“Blockchain solves the problem of manipulation. When I speak about it in the West, people say they trust Google, Facebook, or their banks. But the rest of the world doesn’t trust organizations and corporations that much — I mean Africa, India, the Eastern Europe, or Russia. It’s not about the places where people are really rich. Blockchain’s opportunities are the highest in the countries that haven’t reached that level yet.”<\/p>\n<h4>Vitalik Buterin, Ethereum Founder<\/h4>\n<p>The primary goal of Ethereum’s founders isn’t to create a cryptocurrency that makes speculators a ton of money; it’s to change the world. The Ethereum community attracts ideological supporters in the same way Bitcoin and other cryptocurrencies do, but it’s use cases give it life far beyond that of other coins.<\/p>\n<h2>Want to Invest in Ethereum?<\/h2>\n<p>The easiest way to invest in Ethereum is by using a cryptocurrency exchange. We’ve compiled a <a href=\"https:\/\/coincentral.com\/how-to-buy-ethereum\/\">list of the best exchanges where you can buy Ethereum<\/a>.  On this page you can find key details of these exchanges, as well as links to their individual reviews and user guides.<\/p>\n<p>If you’re new to the world of cryptocurrency, <a href=\"https:\/\/coincentral.com\/coinbase-review\/\">Coinbase <\/a>offers one of the simplest ways to buy, sell, and store Ethereum.<\/p>\n<p>This <a href=\"https:\/\/coincentral.com\/what-is-ethereum\/\">article<\/a> by Alex Moskov was originally published at CoinCentral.com<\/p>\n<\/div>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":4,"featured_media":1413,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1403"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1403"}],"version-history":[{"count":10,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1403\/revisions"}],"predecessor-version":[{"id":1414,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1403\/revisions\/1414"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1413"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1403"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1403"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1403"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}