{"id":1546,"date":"2018-04-23T01:39:41","date_gmt":"2018-04-23T05:39:41","guid":{"rendered":"http:\/\/achievion.com\/?p=1546"},"modified":"2018-05-01T08:58:15","modified_gmt":"2018-05-01T12:58:15","slug":"top-5-popular-blockchains-pros-cons","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/top-5-popular-blockchains-pros-cons.html","title":{"rendered":"The Top 5 Most Popular Blockchains: Pros and Cons"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Blockchain is commonly associated with Bitcoin since it was the earliest use of blockchain. As the technology has evolved, the number of different blockchains with use case specific features has increased dramatically.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A blockchain is basically a ledger technology that is made up of blocks where transactions are permanently recorded. Although Satoshi Nakamoto originally referenced blockchain as “a block of chains,” blockchain has become the accepted term for the technology. Blockchain technology&#8217;s main benefit lies in the fact that it enables multi-party transactions, which adds decentralization capabilities, as well as, security.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Across the globe, blockchain technology is rapidly being adopted for use in business for both B2B and B2C applications. According to <\/span><a href=\"https:\/\/www.vccircle.com\/global-spending-on-blockchain-solutions-to-reach-2-1-bn-in-2018-idc-report\/\"><span style=\"font-weight: 400;\">International Data Corporation (IDC)<\/span><\/a><span style=\"font-weight: 400;\">, a market research firm, global spending on blockchain solutions will reach $2.1 billion by the end of 2018. From startups to established tech giants, companies of all sizes are working to develop specialized blockchains to meet the specific needs of businesses in various industries.<\/span><\/p>\n<p>Here are the top 5 most popular blockchains along with the pros, cons, and use cases for each blockchain.<\/p>\n<h2><span style=\"font-weight: 400;\">1. Bitcoin<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Bitcoin has benefited greatly as the earliest and first blockchain to be used. It was created by an unknown person or group of individuals known as <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Satoshi_Nakamoto\"><span style=\"font-weight: 400;\">Satoshi Nakamoto<\/span><\/a><span style=\"font-weight: 400;\"> who remained active in the development of Bitcoin up until December 2010. The blockchain uses Bitcoin (BTC) as its virtual currency and includes a variety of technologies such as digital signature, has, public-key cryptography, Proof of Work consensus algorithm, P2P, and mining that make it possible for users of the blockchain to extract Bitcoins.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">What Are the Benefits of Bitcoin?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Bitcoin blockchain’s benefits are namely the same benefits that have been touted for all blockchains. Bitcoin’s blockchain provides a decentralized public ledger of all transactions that occur on the blockchain. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">What Are Bitcoin&#8217;s Limitations?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Although, Bitcoin has achieved the status of the most used cryptocurrency, its blockchain suffers from scalability issues that have prevented it from reaching its full potential. With a block size limit of just 1 MB, the blockchain is highly limited in the number of transactions that can take place at once which has lead to significant delays.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In fact the Bitcoin bull market of 2017, Bitcoin transactions took as long as <\/span><a href=\"https:\/\/cointelegraph.com\/bitcoin-cash-for-beginners\/what-is-bitcoin-cash\"><span style=\"font-weight: 400;\">4 days to complete<\/span><\/a><span style=\"font-weight: 400;\"> with transaction fees averaging around $28. Transactions are also not instant which makes Bitcoin virtually useless as a solution for micropayments.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Bitcoin Use Cases<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">When Bitcoin initially began to gain traction, using it as a store of value was one of the original use cases. It had been considered as the digital equivalent of gold. But given that many other altcoins have now emerged, with many improving upon the Bitcoin blockchain’s inherent flaws, the future of Bitcoin and its blockchain really depends on Bitcoin’s ability to remain popular as a stable cryptocurrency among the masses.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Bitcoin may instead be useful as an efficient settlement system since there is less need for increased transaction capacity. In the future, Lightning Network may arise on top of Bitcoin as means of providing a permanent ledger solution using Bitcoin&#8217;s blockchain as the infrastructure for the settlement.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">2. Ethereum<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Ethereum Network was conceptualized by <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Vitalik_Buterin\"><span style=\"font-weight: 400;\">Vitalik Buterin<\/span><\/a><span style=\"font-weight: 400;\">, a software developer who worked with Bitcoin, in 2013. Ethereum is the second most popular blockchain which has the potential to surpass Bitcoin thanks to its use of smart contracts. Ethereum&#8217;s virtual currency is Ether (ETH). However, Ethereum wallets also have the ability to hold ERC-20 tokens.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Advantages of Ethereum<\/span><\/h3>\n<p>These are the most significant advantages of Ethereum:<\/p>\n<h4><span style=\"font-weight: 400;\">Decentralized applications (dApps) and Smart Contracts<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Unlike the Bitcoin blockchain, Ethereum can be used as a platform for other products and services. dApps can built on Ethereum. The Ethereum blockchain can also be used to execute smart contracts.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">Democratic Autonomous Organisations (DAOs)<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">A DAO is an organization that uses smart contracts. A DAO&#8217;s transaction record and program rules are maintained on a blockchain. The benefits of a DAO include the ability to provide a secure digital ledger for tracking financial interactions, prevention against forgery in the execution of smart contracts with timestamping. Essentially, a DAO eliminates the need for a mutually trusted third-party in transactions.<\/span><\/p>\n<h4><span style=\"font-weight: 400;\">ERC-20 Tokens<\/span><\/h4>\n<p><span style=\"font-weight: 400;\">ERC stands for Ethereum Request for Comments. ERC-20 tokens are issued by companies who create their own projects on the Ethereum. ERC-20 tokens use the Ethereum blockchain and they can be branded to specific Ethereum projects. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">They can also be customized to enable automatic buying and selling, enable auto refill, change the number of tokens in circulation, freeze tokens as required by a regulatory body or to prevent use by specific token owners, and to tie the token to the supply of Ether in order to issue the tokens as a Block Reward for mining Ether. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Disadvantages of Ethereum<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">One disadvantage of the Ethereum blockchain is that it is impossible to change a smart contract once it becomes active on the Ethereum network. As a result, you will need to take extra care in making sure that a contract states exactly what you want it to state given that provisions can not be added later.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition, while the Ethereum blockchain does take away the need for a third-party intermediary in transactions from an operational standpoint, it does not absolve the involved parties of legal and financial compliance obligations. These issues may still need to be resolved by consulting with attorneys and regulatory bodies.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Use Cases for Ethereum<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Ethereum has many real world use cases including:<\/span><\/p>\n<p><b>Legal Contracts. <\/b><span style=\"font-weight: 400;\">The Ethereum blockchain can be used to host legal documents, including certificates and contracts. In fact, Propy Inc. recently partnered with the City Clerk&#8217;s Office in South Burlington, Vt., to record the <\/span><a href=\"http:\/\/rismedia.com\/2018\/03\/13\/cryptocurrency-first-us-real-estate-deed-recorded-using-ethereum\/\"><span style=\"font-weight: 400;\">first U.S. real estate deed using only blockchain technology<\/span><\/a><span style=\"font-weight: 400;\">. Instead of using the city&#8217;s recording system, the company used Ethereum.<\/span><\/p>\n<p><b>Financial Services. <\/b><span style=\"font-weight: 400;\">The Ethereum Network can be used to deliver financial services to its users, including microcredit, check cashing, and investing services. A service called <\/span><a href=\"https:\/\/www.iconomi.net\/\"><span style=\"font-weight: 400;\">ICONOMI<\/span><\/a><span style=\"font-weight: 400;\"> Digital Assets Management Platform allows anyone from beginners to blockchain experts to invest in and manage digital assets.<\/span><\/p>\n<p><b>Hosting and Cloud Storage. <\/b><span style=\"font-weight: 400;\">The Ethereum Network is ideal for hosting and storage solutions. <\/span><a href=\"https:\/\/storj.io\/\"><span style=\"font-weight: 400;\">Storj<\/span><\/a><span style=\"font-weight: 400;\"> is one of Ethereum&#8217;s most successful projects to date providing decentralized cloud storage to users.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">3. Ripple Consensus Network<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Ripple is a real-time gross settlement system (RTGS), currency exchange, and remittance network which was created by the <\/span><a href=\"https:\/\/ripple.com\/\"><span style=\"font-weight: 400;\">Ripple<\/span><\/a><span style=\"font-weight: 400;\"> company and released in 2012. It has a native cryptocurrency known as XRP (ripples). This blockchain was initially designed in order to enable secure, instantly and nearly free global financial transactions of any size with no chargebacks.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Pros of Ripple<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Ripple has established itself as a tool for connecting banks and other payment processors. Since it was designed specifically for that purpose, it has escaped the negative labels that Bitcoin and other altcoins have attracted due to their lack of regulation and transparency when it comes to compliance with Know Your Customer (KYC), Anti-money laundering (AML), and Suspicious Activity Reporting rules. Due to its strong connection with large financial institutions, Ripple also benefits from long term stability as banks are unlikely to invest in a technology that does not have a strong outlook. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The main advantage of the XRP Ledger lies in its ability to process large volumes of transactions at an incredible speed at a very low cost in comparison to other blockchains. Ripple can process <\/span><a href=\"https:\/\/ripple.com\/xrp\/\"><span style=\"font-weight: 400;\">1,500 transactions per second<\/span><\/a><span style=\"font-weight: 400;\"> and can scale to handle the same throughput as Visa at 50,000 transactions per second with a cost of only a minimum of ten drops, which is ten one-millionths of one XRP. The XRP Ledger can also process transactions &#8220;off-ledger&#8221; and then communication an overall net payment which allows small transactions to share a transaction fee. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Cons of Ripple<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">One major disadvantage of XRP Ledger is that even though it is an open source protocol, it is pretty much controlled by Ripple Labs. That means that users do not have equal rights which should be the case within a system that is truly decentralized. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Secondly, in order to use Ripple, a company must also become a gateway. A gateway serves as a connection between Ripple users and the Ripple network. To become a gateway, companies must first comply with a large number of regulations, which only select businesses, such as large financial institutions, are capable of meeting.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Use Cases for Ripple<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">While Ripple seeks to become the worldwide standard for real-time payments, there are also some other potential use cases for the XRP Ledger:<\/span><\/p>\n<p><strong>Escrow. <\/strong><span style=\"font-weight: 400;\">While XRP Ledger has its own native escrow function, an application called <\/span><a href=\"https:\/\/www.reservoirlite.com\/\"><span style=\"font-weight: 400;\">Reservoir Lite,<\/span><\/a><span style=\"font-weight: 400;\"> which was developed by <\/span><a href=\"https:\/\/www.secureblockchains.com\/\"><span style=\"font-weight: 400;\">Secure Block Chains,<\/span><\/a><span style=\"font-weight: 400;\"> allows users to create escrow transactions by reserving their own XRP for a specific time frame. They charge a fee for the escrow creation.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<p><strong>Tipping. <\/strong><a href=\"https:\/\/www.xrptipbot.com\/\">XRP Tip Bot<\/a> is an application that was designed by Twitter user <a href=\"https:\/\/twitter.com\/wietsewind\">Wietse Wind<\/a> which allows users to tip with XRP on Reddit, Twitter, and Discord.<\/p>\n<h2><span style=\"font-weight: 400;\">4. Hyperledger<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Started in 2015 by the Linux Foundation, <\/span><a href=\"https:\/\/www.hyperledger.org\/\"><span style=\"font-weight: 400;\">Hyperledger<\/span><\/a><span style=\"font-weight: 400;\"> launched in 2016. The Hyperledger Project was designed as an &#8220;umbrella&#8221; project for open source blockchain and smart contract technologies. It is intended to support industry-specific blockchain projects by catering to top technological, financial, and supply chain businesses.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Hyperledger allows for several business-related blockchain technologies. It supports five distinct frameworks, namely Fabric, Burrow, Sawtooth, Iroha, and Indy. It also has a suite of tools that are used for deploying and maintaining blockchains, collaboration, and examining ledger data, among other functions. These tools are Quilt, Explorer, Cello, and Composer. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Advantages of Hyperledger<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">While Ethereum continues to develop as a platform for B2C dApps, Hyperledger’s architecture is expected to attract businesses who are looking to develop enterprise applications. Unlike Ethereum, Hyperledger lacks a built-in cryptocurrency and does not require mining.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to <\/span><a href=\"https:\/\/www.hyperledger.org\/announcements\/2017\/07\/11\/hyperledger-announces-production-ready-hyperledger-fabric-1-0\"><span style=\"font-weight: 400;\">Sam Pospischil<\/span><\/a><span style=\"font-weight: 400;\"> of Everledger, one of the Hyperledger consortium members, Fabric is tailored to the needs of business customers who must work within standardized enterprise trust systems. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Hyperledger’s main advantage lies in the fact that it is a platform for permissioned networks, which are a hybrid of a public and private blockchains. That gives businesses the ability to offer confidential transactions by giving select parties access via encryption keys. Hyperledger also enables fine-grained access control over consensus.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Hyperledger also solves performance scalability and privacy concerns by providing a toolbox that allows for significant customization of enterprise solutions.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Drawbacks of Hyperledger<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">With the support of IBM, Intel and Cisco, Hyperledger benefits from a strong backing from top tech companies. That can be both an advantage and a disadvantage. While it gives a level of stability to the blockchain, some companies may be hesitant to build on a platform that is dominated by established tech giants.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Use Cases for Hyperledger<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Hyperledger has many real world use cases including:<\/span><\/p>\n<p><b>Finance. <\/b><span style=\"font-weight: 400;\">Hyperledger can be used to streamline the settlement of transactions, improved liquidity, and provide increased transparency.<\/span><\/p>\n<p><b>Healthcare. <\/b><span style=\"font-weight: 400;\">Hyperledger can be used to reduce costs, improve patient care, and make data more accessible.<\/span><\/p>\n<p><b>Supply Chain.<\/b><span style=\"font-weight: 400;\"> With Hyperledger, businesses can develop projects that help to reduce the prevalence of counterfeit goods and enable tracking of parts and service provenance.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">5. Lisk<\/span><\/h2>\n<p><a href=\"https:\/\/lisk.io\/\"><span style=\"font-weight: 400;\">Lisk<\/span><\/a><span style=\"font-weight: 400;\"> is a blockchain platform that is especially designed for JavaScript developers. It was designed as a way to make it easy for web developers to create dApps. It was launched in 2016 by Max Kordek and Oliver Beddows. The blockchain uses <a href=\"https:\/\/lisk.support\/lisk-news\/what-gives-lsk-token-value\/\">Lisk (LSK)<\/a> as its virtual currency.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Pros of Lisk<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">One of the biggest challenges that developers face in building blockchains is that there is a lot of confusion about which language to use. With the majority of web developers being well-versed in Javascript already, List eliminates this programming barrier by offering a software developers kit (SDK) based on JavaScript. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition, Lisk also enables developers to see greater returns from the projects they develop unlike centralized platforms such as Google Play and Apple&#8217;s App Store which exert a significant amount of control over publishers while also taking their revenues. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Finally, Lisk&#8217;s unique sidechains are blockchains that link to the mainchain without disrupting the performance and speed of the mainchain. The Lisk team is responsible for maintaining the mainchain while developers are given complete control over their own sidechains.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Cons of Lisk<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The only drawback of Lisk ecosystem is the extended block time which can occasionally lead to delays in confirming transactions. This results from the failure of a delegate to forge a block within 17 minutes which moves the block to the next round and extends its time by 10 seconds.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Use Cases for Lisk<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Lisk has a number of real world use cases including:<\/span><\/p>\n<p><b>Javascript-based dApps.<\/b><span style=\"font-weight: 400;\"> With Lisk, developers can use it to launch their own sidechains and then use them to build independent social networks, messenger applications, games, and more. <\/span><\/p>\n<p><b>Decentralized App Directory.<\/b><span style=\"font-weight: 400;\"> You can search for any dApp within the Lisk ecosystem in the same way as you would with an app store.<\/span><\/p>\n<p><b>Blockchain services. <\/b><span style=\"font-weight: 400;\">Developers can create specific blockchain services, such as identity as a service, decentralized hosting, smart contract execution, and Oracles as a service.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Next Steps<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">If you&#8217;re trying to decide which blockchain will work best for your next project, you might be wondering what the next steps are. Ultimately, there&#8217;s no one single blockchain that can solve every problem. Achievion can help you figure it all out with expert advice.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We can help you determine whether blockchain is a good fit for you and which blockchain is right for your project. We’ll discuss a range of solutions, as well as, the pros and cons of the most popular blockchains as they apply to your specific application.<\/span><\/p>\n<p><a href=\"http:\/\/achievion.com\/contact\"><span style=\"font-weight: 400;\">Contact us today for a free consultation<\/span><\/a><span style=\"font-weight: 400;\"> and let&#8217;s discuss the details of your next project. <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1591,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1546"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=1546"}],"version-history":[{"count":42,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1546\/revisions"}],"predecessor-version":[{"id":1589,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/1546\/revisions\/1589"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/1591"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=1546"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=1546"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=1546"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}