{"id":2033,"date":"2018-12-14T13:06:58","date_gmt":"2018-12-14T18:06:58","guid":{"rendered":"https:\/\/achievion.com\/?p=2033"},"modified":"2019-05-29T06:51:23","modified_gmt":"2019-05-29T10:51:23","slug":"improving-food-safety-with-blockchain","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/improving-food-safety-with-blockchain.html","title":{"rendered":"Improving Food Safety with Blockchain"},"content":{"rendered":"<p>To most people or the common man, the process of getting food is rather simple. If you want food, you go to the grocery store and pick up the items to cook or eat, or you simply go to a restaurant and order the meal you want. However, the reality is that the food supply system is far more complicated.<\/p>\n<p>In the U.S, each one of us has an interaction with the food industry in one way or the other, which makes it an integral part of the country’s health and economy. The problem is that the complex nature of the food supply system gives rise to several challenges, with food safety being on top of that list. One of the most important aspects of a food business, proper food safety can be ensured with the right technology and training to protect the consumers’ health.<\/p>\n<p>Everything needs to be right when it comes to food safety. One mistake and there could be an outbreak of food-borne illness. Although there is no ‘surefire’ solution to food safety yet, several technologies have exhibited great potential to solve one of the biggest challenges facing the food industry today. A technology that has been in the news more than the others for its impact on food safety is blockchain. Here, we discuss the current challenges in the food safety and how the blockchain technology can help overcome it.<\/p>\n<h2><strong><b>The Current Challenges in Food Safety<\/b><\/strong><\/h2>\n<p>Often, the food we depend on for survival and good health are contaminated with germs that can cause sickness or even death. Every few years, new challenges arise in food safety due to changes in food production and supply, changes in the environment that lead to food contamination, changes in tests that diagnose food-borne illnesses, and other reasons. Following are the key challenges in food safety faced by the food industry today:<\/p>\n<h3><b>1. <\/b><strong><b>Food Always Carries a Certain Level of Risk<\/b><\/strong><\/h3>\n<p>With local, state, federal and even international regulations governing the manufacturing and distribution of food, the food industry is among the world’s most heavily-regulated industries. But, even that does not prevent food-related incidents from occurring each year, and they number in the thousands.<\/p>\n<p>Food always carries a certain level of risk. Whenever you consume food, there is a risk that you can fall sick due to the food contents being contaminated and this is proven by the statistics regarding the number of people in the U.S that fall sick each year. Over <a href=\"https:\/\/www.cdc.gov\/foodsafety\/foodborne-germs.html\"><u>45 million people<\/u><\/a> in the U.S contact a food-borne illness annually. More than a 120,000 of these get hospitalized and about three thousand die due the severity of their illness.<\/p>\n<p>The above numbers make it critical for the food industry to take all the measures possible to minimize the exposure of consumers to the contaminants in food, which in turn will help alleviate the constant risk carried by the food.<\/p>\n<h3><b>2. <\/b><strong><b>Complex Supply Chains<\/b><\/strong><\/h3>\n<p>As mentioned earlier, the food supply system is incredibly complex. This can make it difficult for stakeholders to respond quickly to a challenge in food safety. For example, if an outbreak of a foodborne illness was specifically linked to tomatoes, it would become critical to determine where the contamination originated so that the situation can be rectified.<\/p>\n<p>The problem is that the food supply chain comprises of many stages and the contamination could have originated at any of them. The outbreak could have originated during shipping, at the warehouse or handling facility, where the plant was grown, or at another point in the food supply chain. Unless there is a system in place to track the food at every point in the supply chain, determining the source of the contamination can be difficult, if not impossible. And, when you consider that processed food product consists of multiple ingredients, the challenge of tracing food contamination seems even tougher.<\/p>\n<h3><b>3. <\/b><strong><b>Natural Disasters<\/b><\/strong><\/h3>\n<p>From Hurricane Harvey to Irma and more, the U.S coast has experienced many natural disasters in the past few years that has left life of the common man disrupted. A major challenge following these natural disasters has been food safety management. If a Hurricane Harvey like disaster was to occur again, then it would take a food process operation in the vicinity several weeks or even months to bring the facility back on line.<\/p>\n<p>With the current processes in place, not only will be the production of food be suspended after the disaster, but questions will also be raised about the safety of previously processed food and food ingredients in the supply chain. A comprehensive food safety assessment may be needed to ensure the food and food ingredients are free of contamination, which could be expensive and time-consuming.<\/p>\n<h3><b>4. <\/b><strong><b>Validation<\/b><\/strong><\/h3>\n<p>Validation confirms with a certain degree of confidence the effectiveness of a food safety plan’s preventive control measure in alleviating the food safety hazard that has been identified to an acceptable level. Since it is a relatively new concept for the food industry, validation is causing a bit of a confusion for food safety specialists as well as regulatory operatives.<\/p>\n<h2><strong><b>How Blockchain Technology Can Improve Food Safety<\/b><\/strong><\/h2>\n<p>A breakthrough technology for food safety, blockchain can improve food safety in several different ways and following are some of them.<\/p>\n<h3><b>1. <\/b><strong><b>Traceability<\/b><\/strong><\/h3>\n<p>An open blockchain can provide every detail in a product’s lifecycle. The blockchain technology makes it possible for anyone with a computer to keep track of a product’s entire supply chain in seconds rather than the hours, days, and weeks it previously took to do the same.<\/p>\n<h3><b>2. <\/b><strong><b>Full Disclosure<\/b><\/strong><\/h3>\n<p>For several reasons, food processers, except for some producers, are reluctant to fully disclose the details pertaining to products. As the technology develops, blockchain could provide retailers, producers, and processers protocols that they are comfortable using and which encourages them to provide effective and complete supply chain traceability.<\/p>\n<h3><b>3. <\/b><strong><b>Streamlined Supply Chain<\/b><\/strong><\/h3>\n<p>Blockchain eliminates intermediaries by connecting the seller directly to the buyer, which, in theory at least, streamlines the supply chain and lowers cost.<\/p>\n<h3><b>4. <\/b><strong><b>Waste Reduction<\/b><\/strong><\/h3>\n<p>Walmart—the multinational retail giant, is working on developing blockchain technology that the company believes could help it to better track product expiry dates and thus reduce waste in stores. It could also help reduce the products that are often needlessly destroyed in recalls.<\/p>\n<h2><strong><b>How Walmart, IBM, and Nestle are Working Towards a Blockchain-Based Food Safety Solution<\/b><\/strong><\/h2>\n<p>Nestle, along with Walmart and eight other big-named companies, are<a href=\"https:\/\/disruptive.asia\/ibm-blockchain-trial-food-supply-chains\/\"><u> partnering<\/u><\/a> with IBM to implement a blockchain-based food safety solution. The initiative looks to enable the blockchain technology for tracking the entire food supply chain. Launched in the 2017, the initiative is called IBM Food Trust partnership and it looks to use IBM’s blockchain platform to allow companies to ensure traceability throughout the value chain. This could be a massive step towards overcoming many of the challenges in food safety faced today.<\/p>\n<h2><strong><b>Final Word<\/b><\/strong><\/h2>\n<p>At Achievion, we can leverage blockchain technology to build sophisticated mobile and web applications, which includes blockchain solutions for food safety.  Get in touch to know more.<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":2050,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[82],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2033"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=2033"}],"version-history":[{"count":3,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2033\/revisions"}],"predecessor-version":[{"id":2664,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2033\/revisions\/2664"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/2050"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=2033"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=2033"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=2033"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}