{"id":2045,"date":"2018-12-21T15:37:50","date_gmt":"2018-12-21T20:37:50","guid":{"rendered":"https:\/\/achievion.com\/?p=2045"},"modified":"2018-12-21T15:39:32","modified_gmt":"2018-12-21T20:39:32","slug":"what-are-neural-networks-and-how-are-they-such-a-game-changer","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/what-are-neural-networks-and-how-are-they-such-a-game-changer.html","title":{"rendered":"What Are Neural Networks and How Are They Such a Game Changer?"},"content":{"rendered":"\n<p>Artificial Neural Networks were originally based on the model of how human brain works and makes sense of objects and environment. Today, the models based on neural network are being used in a variety of industry and offer groundbreaking solutions as they can give machines the capability to think and take decision like humans.<\/p>\n\n\n\n<h2><strong>What are Artificial Neural Networks (ANN) – Their History and How They Work<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Much of the development in Artificial Intelligence so far involves creation and testing of statistical models and algorithms. These can be anything from regression and correlation models to structured if-else trees nested within one another.<\/p>\n\n\n\n<p>However, there is another area of development where researchers have been paying a lot of attention in recent times. This is for a technology called artificial neural networks or ANN. This technology is based on a rough model of how the human brain is structured and works. <\/p>\n\n\n\n<p>The human brain is connected through microscopic units called neurons. Interaction between neurons causes everything from lifting a hand, drawing a picture to easting, breathing, feeling sad and happy or remembering people.<\/p>\n\n\n\n<p>Artificial neurons inside an AI system are units of calculation. These neurons are connected by synapses that are just weighted values. These neurons are capable of performing complex calculations that are multiplied by a weight as it travels through the artificial neural network.<\/p>\n\n\n\n<p>The result is that AI becomes capable of performing calculation with sensory data such as visual or audio information instead of mathematical algorithms.<\/p>\n\n\n\n<h2><strong>History of ANN<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>The idea of ANN has been around for a long time. Theories about creating something similar to human brains with the same perceptions, senses and feelings is more than a thousand years old.<\/p>\n\n\n\n<p>In recent time, ANNs were first conceptualized in the 1960’s and called perceptrons. Neurophysiologist Warren McCulloch and mathematician Walter Pitts wrote a paper on how they would work.<\/p>\n\n\n\n<p>They called their artificial neurons perceptrons that would be strengthened each time they are used and become capable of recognizing patterns.<\/p>\n\n\n\n<p>In the following years, the ideas were picked up by John von Neumann who suggested imitating simple neurons in the human brain by using telegraph relays or vacuum tubes. Neumann was fascinated with the eyes of a fly. Changes in the external environment tell it to flee immediately. He built a similar hardware system. A single layer perceptron would compute a weighted sum of inputs, compare it to a monitoring threshold and returns one of two possible values as outcome.<\/p>\n\n\n\n<p>The ideas lost interest among the research community for two decades until they were later picked up by the American Institute of Physics. &nbsp;It gained popularity with the development of computer hardware and internet technology. Today, it is seen as an important component of developing human-like AI technology.<\/p>\n\n\n\n<h2><strong>The Deep Learning Applications That Make Neural Networks a Game Changer<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Researcher in the technology claim that most ANN research and practical applications fall into three main categories<\/p>\n\n\n\n<ul><li>Pattern recognition and classification<\/li><li>Prediction, forecasting and data analysis<\/li><li>Output control and Optimization<\/li><\/ul>\n\n\n\n<p>A good example of classification is visual or audio recognition of an object by AI just be listening to its sound or examining its image.<\/p>\n\n\n\n<p>ANN can also be used in making predictions by analyzing a series of historical data and trends.<\/p>\n\n\n\n<p>Optimization involves finding solution for a set of complex problems by determining the shortest and most efficient method and solutions.<\/p>\n\n\n\n<h3><strong>1.&nbsp;<\/strong><strong>Automated Driving<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>ANN is being tested to build self-driving cars that will be able to predict the shortest route from point A to B and avoid collision by determining the driving pattern of other vehicles and pedestrians. <\/p>\n\n\n\n<p>Automated vehicles that drive perfectly can be trained through layers of neural networks. Researchers believe that such vehicles will take significantly lower number of neural layers than they previously believed would be required for automated cars.<\/p>\n\n\n\n<h3><strong>2.&nbsp;<\/strong><strong>Aerospace and Defense<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Technologies are being developed in aeronautics that will help address a wide range of complex problems. ANN can be used in aircraft design process, flight control, fuel efficiency and controlling unsteady dynamic effects from environmental pressure. <\/p>\n\n\n\n<p>The technology also has significant application in the defense sector. ANN models produce reasonable outputs when presented with a steady stream of input. Robots built on neural networks will be capable of recognizing military objective, using computer vision, understand speech and process natural language.<\/p>\n\n\n\n<h3><strong>3.&nbsp;<\/strong><strong>Medical Research<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Neural networks have been in use for medical research for a long time. They are now being tested to model the human cardiovascular system, digestive tract disorders and organ degradation.<\/p>\n\n\n\n<p>A number of researchers are collecting data on human heart conditions and use it to compare with real time physiological measurements taken from the patient. Researchers believe that if this routine is carried out regularly, doctors will be able to determine problems at an earlier stage, allowing them to combat disease much more effectively.<\/p>\n\n\n\n<h3><strong>4.&nbsp;<\/strong><strong>Industrial Automation<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Neural networks can exponentially increase the ability of machines to gain new knowledge through machine learning. The technology allows machines to compare and analyze information on the spot through data and sensor measurement. <\/p>\n\n\n\n<p>Businesses like Siemens and Tesla motors have been using the technology to significantly improve their production and manufacturing facility.<\/p>\n\n\n\n<h3><strong>5.&nbsp;<\/strong><strong>Electronics<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Electronics industry is expected to be the major beneficiary of development in neural networks. As the size of chips and processors keeps getting smaller and smaller, it will no longer be possible for humans to design more efficient components in the future because of the required level of precision.<\/p>\n\n\n\n<p>Computer programs and precise machines that are capable of designing accurate components at microscopic level will take over the design and production of such electronics from humans.<\/p>\n\n\n\n<h2><strong>Final Word<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Neural networks are the building blocks of thinking, memory, understanding, comparing and decision making. While the human capacity to think and be creative is limited by evolution, the ability of neural networks can continue to increase with every generation. The pace at which the technology is growing suggests that Artificial Neural Networks will be the future in the field of AI.<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":2054,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[85],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2045"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=2045"}],"version-history":[{"count":2,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2045\/revisions"}],"predecessor-version":[{"id":2055,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2045\/revisions\/2055"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/2054"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=2045"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=2045"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=2045"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}