{"id":2805,"date":"2019-07-19T16:31:01","date_gmt":"2019-07-19T20:31:01","guid":{"rendered":"https:\/\/achievion.com\/?p=2805"},"modified":"2019-09-04T13:14:20","modified_gmt":"2019-09-04T17:14:20","slug":"understanding-the-ethical-ai-and-explainable-ai-concepts","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/understanding-the-ethical-ai-and-explainable-ai-concepts.html","title":{"rendered":"Ethical AI 101: Understanding the Ethical AI Concepts"},"content":{"rendered":"\n<p>According to the <a href=\"https:\/\/www.edelman.com\/sites\/g\/files\/aatuss191\/files\/2019-02\/2019_Edelman_Trust_Barometer_Global_Report.pdf\">2019 Edelman Trust Barometer<\/a>, more than 80% of consumers are more loyal to companies that they found to be ethical. Moreover, more than <a href=\"https:\/\/c1.sfdcstatic.com\/content\/dam\/web\/en_us\/www\/documents\/research\/salesforce-research-ethical-leadership-and-business.pdf\">90%<\/a>&nbsp;of the consumers who took the Ethical Leadership and Business survey conducted by Salesforce say that companies must make sure that the impact they have on society is a positive one.<\/p>\n\n\n\n<p>The sentiments of consumers about business ethics are the basis for Ethical AI, a relatively new concept that takes on the ethics involved in the use of artificial intelligence (AI) by both individuals and businesses.<\/p>\n\n\n\n<p>In this article, we are going to look at the importance of Ethical AI, its 10 principles, and the&nbsp;real-world applications of the&nbsp;concept. <\/p>\n\n\n\n<h2><strong>Ethical AI: Why It’s Needed<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Today, the ability to use AI ethically can be a competitive differentiator simply because the ability to do things ethically has proven to generate trust not just from customers but also from partners and the public at large.<\/p>\n\n\n\n<p>Currently, the artificial intelligence (AI) field is progressing at a rapid pace. We have AI algorithms that are helping to take fraud detection, ad targeting, voice-recognition systems, spell-checkers, etc. to the next level. However,&nbsp;an area of AI that needs addressing&nbsp;is the ethics involved in the use of AI. The Ethical AI concept is important because it addresses the underlying issues in the use of AI such as safety, bias, transparency, fairness, and accountability.<\/p>\n\n\n\n<p>According to a <a href=\"https:\/\/www.theguardian.com\/sustainable-business\/2015\/may\/05\/millennials-employment-employers-values-ethics-jobs\">2015 research<\/a>, more than 40% of millennials want to associate with a company that has positive impact on the world. Additionally, a major reason for the demise of many big-named companies, chief among them&nbsp;Enron, was that they had <a href=\"https:\/\/www.britannica.com\/topic\/Enron-What-Happened-1517868\">poor ethics<\/a>. Ethics is critical to the success of any organization and anyone who says otherwise is not in sync with reality.<\/p>\n\n\n\n<p>This is the reason the Ethical AI concept has been introduced. The concept takes on the AI issues of safety, bias, transparency, fairness, accountability, etc. to ensure that artificial intelligence (AI) is used in an ethical way that has a positive impact on society and the world at large. This is achieved with the <a href=\"http:\/\/www.thefutureworldofwork.org\/opinions\/10-principles-for-ethical-ai\/\">10 principles for AI<\/a>&nbsp;given provided by UNI Global Union, a global union federation for skills and services headquartered in Nyon, Switzerland. The 10 principles for Ethical AI are discussed next.<\/p>\n\n\n\n<h2><strong>The 10 Principles for Ethical AI<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>In order to meet their concrete demands for AI application and transparency, UNI Global Union provides workers and unions with <a href=\"http:\/\/www.thefutureworldofwork.org\/opinions\/10-principles-for-ethical-ai\/\">10 principles for Ethical AI<\/a>. <\/p>\n\n\n\n<p>While the 10 principles for Ethical AI are targeted towards the above-mentioned personnel, they can be applied to all businesses, data, and AI systems across the globe. The purpose of the 10 principles is to protect the interests of workers and ensure a healthy balance of power in the workplace. Without any further ado, let’s get to the 10 principles for Ethical AI provided by UNI Global Union.<\/p>\n\n\n\n<h3><strong>1.&nbsp;<\/strong><strong>Demanding Transparent AI Systems<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The purpose of this principle is to ensure that artificial intelligence (AI) systems are transparent enough for anyone to know how and why a decision was made by the system. This Ethical AI principle is a prerequisite for ensuring that the other 9 principles are observed.<\/p>\n\n\n\n<h3><strong>2.&nbsp;<\/strong><strong>Equipping AI Systems with an ‘Ethical Black Box’<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>This principle says that a device that can record information about a particular AI system in an ‘ethical black box’ form should be used to facilitate complete transparency in the said system. In addition to containing relevant data that ensures the system’s transparency and accountability, the ‘ethical black box’ should contain all the information relating to the system’s ethical considerations.<\/p>\n\n\n\n<h3><strong>3.&nbsp;<\/strong><strong>Ensuring AI Serves People and Planet<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The principle emphasizing following the code of ethics involved in the development, application, and use of artificial intelligence (AI). The purpose of this is to ensure that an AI system is compatible with and increases fundamental human rights, gender&nbsp;and cultural diversity, privacy, freedom, integrity, and human dignity.&nbsp;Additionally, the principle looks to ensure that AI system plays their role in protecting and improving the ecosystems and biodiversity of our planet.<\/p>\n\n\n\n<h3><strong>4.&nbsp;<\/strong><strong>Adopting a Human-In-Command Approach<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>This principle emphasizes the safe, responsible, and useful development of AI. This development ensures the legal status of AI systems as a tool over which certain authorized personnel has control and they are held responsible for it.<\/p>\n\n\n\n<p>The principle demands that an AI system should be developed and operated in a way which complies with the existing laws. Additionally, it makes a case for workers to have the right to not only access but also manage and control the data generated by an AI system. <\/p>\n\n\n\n<h3><strong>5.&nbsp;<\/strong><strong>Ensuring an Unbiased AI<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The original purpose of AI was to eliminate the element of bias in processes. Therefore, it would have been a surprise if ensuring an unbiased AI wasn’t part of the Principles for Ethical AI. The principle demands that an AI system is controlled for harmful or negative human-bias during development and maintenance to ensure that the system is free from all kinds of bias—race, age, gender, sexual orientation, etc.—when in operation.<\/p>\n\n\n\n<h3><strong>6.&nbsp;<\/strong><strong>Sharing the AI System’s Benefits<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The principle demands that AI systems empower and benefit as many people as possible. Additionally, it asks for AI to generate economic prosperity to be equally and broadly distributed so that it benefits humans across the globe. To achieve this objective, the principle recommends giving due attention to global and national policies that are designed to bridge the social, technological, and economic divide.<\/p>\n\n\n\n<h3><strong>7.&nbsp;<\/strong><strong>Securing a Just Transition and Ensuring Support for Fundamental Freedoms and Rights<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>It is inevitable that many workers today will be displaced, as improved AI systems get adopted by organizations across the globe. To make sure that this transition is just, it is critical to put in place organizational policies that ensure the process of accountability in relation to the displacement of workers and work tasks created by AI. <\/p>\n\n\n\n<p>An example of this policy would be the possibility to change jobs internally and retraining programs. The government also has a responsibility to retrain the displaced workforce and help them find new employment if required.<\/p>\n\n\n\n<h3><strong>8.&nbsp;<\/strong><strong>Establishing Global Governance Mechanisms<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>Establishing Ethical AI and Decent Work governance bodies that comprise of multiple stakeholders is recommended by UNI to manage issues in Ethical AI on both regional and global levels. Ideally, these governance bodies should include owners, employers, developers, AI designers, trade unions, researchers, chief security officers (CSOs), and lawyers.<\/p>\n\n\n\n<p>In addition to the above, establishing monitoring procedures and whistleblowing mechanisms is recommended to ensure the transition to and implementation of ethical AI. Moreover, it is advised that the governing bodies are given enough flexibility to suggest procedures and processes that ensure compliance with Ethical AI.<\/p>\n\n\n\n<h3><strong>9.&nbsp;<\/strong><strong>Banning the Attribution of Responsibility to Robots<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>This principle says that AI robots should be designed and operated in a way which ensures privacy, fundamental rights and freedoms, and compliance with existing laws. This is a legal responsibility because robots are held liable by law for their acts.<\/p>\n\n\n\n<h3><strong>10.&nbsp;<\/strong><strong>Banning AI Arms Race<\/strong><strong><\/strong><\/h3>\n\n\n\n<p>The AI arms race is a hotly debated topic today. For this reason, UNI felt the need to introduce a principle that clearly asks for banning AI-based technology or lethal autonomous weapons that have the potential to kickstart an AI arms race.<\/p>\n\n\n\n<p>There you have it—the 10 principles for Ethical AI that look to ensure the ethical use of AI so that the technology has a positive impact on society and the world at large.<\/p>\n\n\n\n<h2><strong>Real-<\/strong><strong>World Examples of Ethical AI: Ethical AI in Action<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>Since Ethical AI is a relatively new concept, there are not many real-world examples of its application. However, there are a couple of real-world cases of Ethical AI in action and we want to tell you about them. <\/p>\n\n\n\n<p>The first real-world example of Ethical AI in action is <a href=\"#7adb5979b672\">Farmers Insurance<\/a>, an insurance company based in California, that has established two boards to look over AI applications or AI-enabled products. The purpose of this is to aid the establishment of an ethical framework that provides direction regarding how to deal with issues of ethics in the development, application, and use of AI systems.<\/p>\n\n\n\n<p>The other example of Ethical AI in action is <a href=\"https:\/\/www.wsj.com\/articles\/bank-of-americas-workers-prepare-for-the-bots-1529460300\">Bank of America<\/a>. The Banking giant finds that it would probably become necessary in the future for banks to have people who have the skills to help customers with digital banking. To meet its future needs as well as Ethical AI responsibility, BOA has started to train some of its employees who feel threatened that AI and automation will force them into unemployment in the future.<\/p>\n\n\n\n<h2><strong>Concluding Remarks<\/strong><strong><\/strong><\/h2>\n\n\n\n<p>This article is the first one in the Ethical AI series that we are going to be publishing over the next several months. <a href=\"http:\/\/linkedin.com\/company\/achievion-solutions\">Follow our page on LinkedIn<\/a> or subscribe for our Blog to receive new articles as they get published. <\/p>\n\n\n\n<p>Another concept that is closely related to the Ethical AI concept, particularly the Ethical AI principles relating to transparent AI systems and Ethical Black Box, is the Explainable AI concept. In the next article of the series, we will be discussing the Explainable AI concept, a hotly debated topic in recent years, and the complexity in achieving its goal. <\/p>\n\n\n\n<p>Ethical AI is an important concept to keep in mind when developing, implementing, or using an AI system. At Achievion, we take great pride in the fact that the AI software and apps built by us are developed keeping in mind the ethical dilemmas that may come in its implementation and use. <\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":2821,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[85],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2805"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=2805"}],"version-history":[{"count":6,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2805\/revisions"}],"predecessor-version":[{"id":2843,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/2805\/revisions\/2843"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/2821"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=2805"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=2805"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=2805"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}