{"id":580,"date":"2016-09-28T10:54:18","date_gmt":"2016-09-28T07:54:18","guid":{"rendered":"http:\/\/achivion.grafitum.com\/blog\/should-you-convert-your-web-experience-to-mobile-app-copy.html"},"modified":"2018-11-14T15:53:27","modified_gmt":"2018-11-14T20:53:27","slug":"3-potential-pitfalls-of-lift-and-shift-transition","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/3-potential-pitfalls-of-lift-and-shift-transition.html","title":{"rendered":"3 Potential Pitfalls of a Lift and Shift Transition"},"content":{"rendered":"<p>The &#8220;Lift and Shift&#8221; paradigm, moving an application to a cloud provider with very few changes to the application&#8217;s design, seems like a way to deliver savings and move legacy systems into the future. However is that always the best and easiest approach?<\/p>\n<p><!--more--><\/p>\n<p>The &#8220;Lift and Shift&#8221; paradigm, moving an application to a cloud provider with very few changes to the application&#8217;s design, seems like a way to deliver savings and move legacy systems into the future. Additionally, the implementation risks are often believed to be minimal. However, the truth is that a lift and shift transition is not always the best or the easiest option for updating a non-cloud application.<\/p>\n<p>Despite these risks, many businesses have enjoyed great results when it comes to transitioning their business operations to the cloud. A recent study done by <a href=\"http:\/\/www.prweb.com\/releases\/2015\/05\/prweb12744687.htm\" target=\"_blank\" rel=\"nofollow noopener\">Black Book Rankings<\/a>, which looked at healthcare organizations, found that nearly 7 out of 10 physician practices prefer web-based Electronic Health and Medical Record (EHR) systems. Additionally, the adoption rate of cloud-based EHRs in small practices in urban settings has also increased from 60% in 2013, to 82% presently.<\/p>\n<p>It is important to understand that lift and shift transitions of legacy systems to the cloud can have dramatically different outcomes based on the vendors selected, the scope of the project, as well as, a number of other factors. Before you decide whether or not to take the plunge, here are 3 potential pitfalls of a lift and shift transition that you should consider.<\/p>\n<h2>1. The Application Is a Poor Cloud Candidate<\/h2>\n<p>A major factor that companies sometimes fail to consider is whether or not the application is worth upgrading to the cloud in the first place. If the application is a poor cloud candidate, then the requirements needed to upgrade to the cloud are likely to eliminate the economic benefits of replatforming.<\/p>\n<p>You need to evaluate the application’s attributes to determine if it is practical to move the application to the cloud. An application that requires purely online data is most likely to be a good candidate for the cloud. However, if offline data is all that is needed, this is a good sign that the application is not suitable for the cloud.<\/p>\n<p>To provide a few examples of systems that are unlikely to make good candidates for the cloud, you should probably reconsider your decision if:<\/p>\n<ul>\n<li>An application requires <strong>major hardware investments and network architecture upgrades<\/strong> before the application can be brought to the cloud. These are indications that the application might not meet the affordability criteria for a lift and shift transition.<\/li>\n<li>An application runs on proprietary or older operating systems that <strong>don&#8217;t support virtualization<\/strong>. This is an indication that the application might not the meet portability criteria for a lift and shift transition.<\/li>\n<li>There is a legal or business requirement for your server to run in a <strong>specific physical location<\/strong> that is not offered by cloud service providers.<\/li>\n<li>An application <strong>contains highly sensitive data<\/strong> that make auditing and compliance nearly impossible or highly inefficient when your app resides in the cloud in a remote location.<\/li>\n<\/ul>\n<p>The outcome in any of these situations is that performance operational improvements are unlikely to be realized if the application is not a good candidate for the cloud.<\/p>\n<h2>2. The Consequences Are Far Reaching<\/h2>\n<p>The potential consequences of a lift and shift transition are more complex than you might think. You also need to be prepared for any fallout that may occur including:<\/p>\n<h3>Implementation Issues<\/h3>\n<p>Problems with the implementation (especially, outsourcing partners or cloud service vendors) may arise. There may also be shadow IT concerns, including compatibility, integration, security, and support, that you will need to contend with.<\/p>\n<h3>Client Expectations<\/h3>\n<p>Whenever you make considerable changes to your business systems, you should expect that your clients’ expectations will change. Your business processes will likely be modified by the new cloud application. Additionally, your clients may need to be retrained on how to use your services, especially if your business makes use of self-service portals.<\/p>\n<p>As a result, you need to decide in advance how your clients might react to the new changes and make sure that you have budgeted for technical documentation updates, additional support, and any other requirements that will be needed to better serve your clients after the transition has been made.<\/p>\n<h3>Compliance<\/h3>\n<p>In certain industries, compliance issues may arise from the use of a cloud application. If you&#8217;re in the healthcare industry, your cloud service provider (CSP) must also be Health Insurance Portability and Accountability Act (HIPAA) compliant. Additionally, if you store payment information or take online payments, you will need to make sure that the CSP is PCI DSS compliant.<\/p>\n<p>While these are just the two most well-known regulations, you also need to comply with the specific regulations of the countries, states\/provinces and municipalities in which your business operations, data and customers are located.<\/p>\n<h3>Initial Assumptions Have Not Been Proven to Be Correct<\/h3>\n<p>In some cases, the expected efficiencies of a lift and shift transition are not realized due to poor staff or cloud vendor selection. This occurs when ideas that are actually assumptions, rather than proven facts, are written into the plan. By identifying the underlying assumptions of your cloud strategy, you can uncover the weaknesses that could lead to failure.<\/p>\n<h2>3. Cloud-savvy IT Talent Shortage<\/h2>\n<p>After you have moved the system to the cloud, don’t forget about the improvements that you will need to make over time. Implementing changes requires different IT personnel. According to <a href=\"http:\/\/www.networkworld.com\/article\/2857305\/cisco-subnet\/cybersecurity-skills-shortage-panic-in-2015.html\" target=\"_blank\" rel=\"nofollow noopener\">ESG<\/a>, 43% of organizations have a problematic shortage of cloud computing and server virtualization security skills. Therefore, you need to think about the budget, personnel, and resources that will be needed to make improvements to your cloud application and include them as a part of your 5-year funded roadmap.<\/p>\n<h2>Your Journey to Cloud Platform<\/h2>\n<p>Achievion can help you innovate and reap the benefits of cloud migration. Find out how our elastic IaaS solutions can help you shift your IT infrastructure to the cloud so that you can generate more revenue and improve your business operations!<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":506,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[26],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/580"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=580"}],"version-history":[{"count":5,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/580\/revisions"}],"predecessor-version":[{"id":1995,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/580\/revisions\/1995"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/506"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=580"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=580"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=580"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}