{"id":583,"date":"2016-11-03T13:18:44","date_gmt":"2016-11-03T10:18:44","guid":{"rendered":"http:\/\/achivion.grafitum.com\/blog\/3-potential-pitfalls-of-lift-and-shift-transition-copy.html"},"modified":"2018-11-14T15:53:40","modified_gmt":"2018-11-14T20:53:40","slug":"9-metrics-to-use-to-evaluate-the-success-of-your-app","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/9-metrics-to-use-to-evaluate-the-success-of-your-app.html","title":{"rendered":"9 Metrics to Use to Evaluate the Success of Your App"},"content":{"rendered":"<p>If you want your app to become successful, your company needs to set specific business goals when it comes to the performance of your app. Of course, the exact metrics to track will vary depending on your industry. However, there is no doubt that app tracking is important.<\/p>\n<p><!--more--><\/p>\n<p>If you want your app to become successful, your company needs to set specific business goals when it comes to the performance of your app. Of course, the exact metrics to track will vary depending on your industry. However, there is no doubt that app tracking is important.<\/p>\n<p>In fact, the Red Hat <a href=\"https:\/\/www.redhat.com\/en\/resources\/red-hat-mobile-maturity-survey-2015\" target=\"_blank\" rel=\"nofollow noopener\">2015 Mobile Maturity Survey<\/a>, found that out of 85% of organizations that use KPIs to measure the success of their mobile apps, 74% reported having a positive return on their investments in mobile apps. Therefore, if your company is not measuring the success of the apps you have deployed, your company could be falling behind.<\/p>\n<p>It can also help to know these metrics if you plan to sell your business later. In fact, Snapchat, a completely free app, was offered a buyout of $3 billion by Facebook because it reported astonishing engagement numbers (<a href=\"http:\/\/news.cnet.com\/8301-1023_3-57612943-93\/snapchat-surpasses-facebook-in-photo-uploads\/\" target=\"_blank\" rel=\"nofollow noopener\">400 million<\/a> photos shared each day).<\/p>\n<p>Want to know how your app measures up? Here are 9 metrics to use to evaluate the success of your app.<\/p>\n<h2>App Crash Rate<\/h2>\n<p>App crashes are important to keep track of not only for security purposes, but also because they can have a major impact on the user experience of your app for users. You should strive to keep this rate at 1-2% or less with the ultimate goal of virtually eliminating crashes for your app.<\/p>\n<p><em>Calculation:<\/em><\/p>\n<p><em>Crash Rate = (# of crashes \/ # of app sessions) * 100<\/em><\/p>\n<h2>API Latency<\/h2>\n<p>API latency refers to the amount of time that it takes between a user request and the app&#8217;s response. This is an important performance metric for your app that can also affect the user experience.<\/p>\n<h2>Monthly\/Daily Active Users<\/h2>\n<p>There are actually two metrics that are used to count the number of unique users that use your app over a specific timeframe:<\/p>\n<ul>\n<li>The Daily Active Users (DAU) metric tells you just how many people use your app every day. Since it only counts a user once regardless of how many times they access your app, you can start to identify patterns in the amount of engagement your app receives over the course of a week. You may find that people are more active on your app on certain days than other days.<\/li>\n<li>The Monthly Active Users (MAU) tells you how many unique users used your app. The MAU is used to track the usage over a specific month or the prior 30 days.<\/li>\n<\/ul>\n<p>In addition, to identifying usage trends, these metrics will also tell you whether the user base for your app is growing or shrinking.<\/p>\n<h2>Average Session Length<\/h2>\n<p>The average session length, or average session duration, measures the amount of time that people spend using your app. Just like page views when it comes to browsing on the web, the session length helps you to determine just how engaged users are with your app. The higher the average session length, the more your users are engaged.<\/p>\n<p><em>Calculation:<\/em><\/p>\n<p><em>Average Session Length = total session length for all users in a given time period \/ # of sessions<\/em><\/p>\n<h2>Session Interval<\/h2>\n<p>The session interval is the amount of time between two user sessions for your app. This metric shows how frequently your app is being accessed by users and is an indicator of how engaged users are with your app.<\/p>\n<h2>Cost Per Acquisition<\/h2>\n<p>The cost per acquisition (CPA) is the amount that you spend per user to acquire each user. In order to break even or earn a profit on your app, you need to keep track of this metric to ensure that your costs don&#8217;t exceed your revenues from the app. Make sure to include any marketing and advertising expenses that you incur to attract users to your app, including paid ad campaigns, discount offers, referrals, and more.<\/p>\n<p><em>Calculation:<\/em><\/p>\n<p><em>CPA = costs \/ # of acquisitions<\/em><\/p>\n<h2>Retention Rate<\/h2>\n<p>It&#8217;s great to see some users download your app for the first time. But you won&#8217;t be happy if they don&#8217;t stick around. Try to increase the retention rate of your app, specifically focusing on the 1-day, 7-day, and 30-day retention rates.<\/p>\n<p><em>Calculation:<\/em><\/p>\n<p><em>Retention Rate = # of people who use your app within a set time period \/ # of people who used your app within a previously set time period<\/em><\/p>\n<h2>Churn Rate<\/h2>\n<p>The churn rate refers to the percentage of users that uninstalled your app. It is the opposite of the retention rate. This is an important metric to track because users that have stopped using your app that were previously engaged are often the most difficult to recover.<\/p>\n<p>In fact, the churn actually starts when the user begins to trail off from using to app until the time when they realize that they are paying for or have downloaded an app that they really don&#8217;t need and don&#8217;t ever use.<\/p>\n<p><em>Calculation:<\/em><\/p>\n<p><em>Churn Rate = 1 – retention rate<\/em><\/p>\n<h2>App Rating<\/h2>\n<p>While it may seem trivial to worry about what rating your app is given in the app stores, this metric is actually one of the strongest indicators of user satisfaction with your app. The rating of your app plays a major role in determine whether or not users will download your app versus a competitor&#8217;s app.<\/p>\n<p>Given that a list of the <a href=\"http:\/\/qz.com\/253527\/these-are-the-25-most-popular-mobile-apps-in-america\/\" target=\"_blank\" rel=\"nofollow noopener\">top 25 most-used apps<\/a> reflects the most mature tech companies, including Facebook and Google, it is up to you to grab the attention of your users away from these other apps so that they spend more time using your app.<\/p>\n<p>A good place to start is by looking at what these <a href=\"blog\/5-characteristics-of-great-apps\" target=\"_blank\" rel=\"noopener\">top apps offer that makes them so successful<\/a>, earning them the highest ratings in the app stores.<\/p>\n<h2>Analytics Tools You Should Know About<\/h2>\n<p>If you are ready to get started with tracking your app, these are the top analytics tools that will give you the detailed data you need to help you understand how and why people are using your app.<\/p>\n<h3>Flurry Analytics<\/h3>\n<p><a href=\"https:\/\/developer.yahoo.com\/analytics\/\" target=\"_blank\" rel=\"nofollow noopener\">Flurry Analytics<\/a>, part of the Yahoo Mobile Developer Suite, is a comprehensive analytics tool that can help you discover how people are using your app. Flurry provides easy to understand reporting on app usage, audience, technical, and events. You can even see user paths and create funnels.<\/p>\n<h3>Universal Analytics<\/h3>\n<p><a href=\"https:\/\/developers.google.com\/analytics\/solutions\/mobile\" target=\"_blank\" rel=\"nofollow noopener\">Google Mobile App Analytics<\/a>, which is part of Google’s Universal Analytics, provides metrics to help you analyze your app’s performance. You can view reports on acquisitions, audience\/users, behavior and engagement, and conversions.<\/p>\n<h3>Apple App Analytics<\/h3>\n<p><a href=\"https:\/\/developer.apple.com\/app-store\/app-analytics\/\" target=\"_blank\" rel=\"nofollow noopener\">App Analytics<\/a> provides three sets of data regarding the App Store, sales, and usage. While the data provided will allow you to explore your app&#8217;s attribution analytics, it is quite limited when it comes to app usage data.<\/p>\n<h2>Why App Metrics Matter<\/h2>\n<p>Not only does measuring the success of your app help you to determine whether your app development budget was used effectively, it also lets you know whether your employees and customers are happy with the solution that you developed. Tracking your app will ensure that you deliver the best product possible in a marketplace that is already highly competitive.<\/p>\n<p>Want to learn more about how to build a winning app for your business? Achievion can help you turn your app into a success. Take 30 minutes to learn about how we create highly polished apps for startups and enterprise clients.<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":504,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[25],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/583"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=583"}],"version-history":[{"count":5,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/583\/revisions"}],"predecessor-version":[{"id":1996,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/583\/revisions\/1996"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/504"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=583"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=583"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=583"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}