{"id":590,"date":"2016-11-30T13:23:06","date_gmt":"2016-11-30T10:23:06","guid":{"rendered":"http:\/\/achivion.grafitum.com\/blog\/7-features-to-include-in-your-app-to-attract-new-users-copy.html"},"modified":"2018-11-14T15:54:01","modified_gmt":"2018-11-14T20:54:01","slug":"how-to-incorporate-customer-feedback-into-saas-development-process","status":"publish","type":"post","link":"https:\/\/achievion.com\/blog\/how-to-incorporate-customer-feedback-into-saas-development-process.html","title":{"rendered":"How to Incorporate Customer Feedback Into the SaaS Development Process"},"content":{"rendered":"<p>As you build your SaaS app, it’s inevitable that your customers will have feedback about your app. However, with so many different opinions about the features that your app should offer, things can quickly spiral out of your control. Follow these steps to create a great app that will make everyone happy!<\/p>\n<p><!--more--><\/p>\n<p>As you build your SaaS app, it’s inevitable that your customers will have feedback about your app. However, with so many different opinions about the features that your app should offer, things can quickly spiral out of your control.<\/p>\n<p>Given that <a href=\"http:\/\/www.huffingtonpost.com\/vala-afshar\/50-important-customer-exp_b_8295772.html\" target=\"_blank\" rel=\"nofollow noopener\">67% of customers mention bad experiences<\/a> as a reason for churn, but only 1 out of 26 unhappy customers complain, it is pretty obvious why you might feel pressured to implement features suggested by your customers that you are unsure about.<\/p>\n<p>Fortunately, there are ways to effectively incorporate customer feedback into the app development process that won&#8217;t cause you to lose the vision that caused you to create the app in the first place.<\/p>\n<p>If you want to your app to be successful, you need to stay focus on what’s important and that means following a clear process that doesn’t involve automatically giving in to your biggest customers or the loudest opinions about how your SaaS app should be designed.<\/p>\n<p>Follow these steps to create a great app that will make everyone happy!<\/p>\n<h2>1. Figure Out What Tools Are Most Important<\/h2>\n<p>If you want all of your customers to absolutely love your SaaS app, your goal shouldn&#8217;t be to incorporate every single suggestion that you receive. In fact, you should be more focused on aligning your technology stack so that can be adapted to the needs of your customers.<\/p>\n<p>This involves a careful selection of open-source technologies, backend technologies, and cloud service providers (PaaS and IaaS). The best tools for your technology stack have vibrant development communities and utilize agile development practices.<\/p>\n<p>When you have the right technology in place already, you can act faster on the feedback that you receive. It also means that you can set up a continuous loop of customer feedback and product delivery that keeps your business ahead of the competition and allows your business to grow faster.<\/p>\n<h2>2. Find Out Why Users Are Requesting New Features<\/h2>\n<p>Feature requests are not exactly what they seem to be on the surface. In fact, they are often a symptom of a deeper problem with your app. If you want to effectively incorporate feedback into the SaaS development process, you need to work with your customers and your internal teams to try to uncover the real reasons for a feature request.<\/p>\n<p>In many cases, feature requests are actually a result of information that is missing from your app or a misunderstanding about how to use existing features. If you want to get some real insight into the source of a feature request, allow users of all different experience levels to test your SaaS app and ask them why they think that customers are asking for the feature to be implemented. The answers you receive may surprise you.<\/p>\n<h2>3. Prioritize Customer Feedback<\/h2>\n<p>As you sort through the customer feedback that you’ve received, you need to prioritize customer feedback in terms of its importance to your bottom line. An easy way to do this is by segmenting feedback from free users versus paying customers.<\/p>\n<p>Implementing a feature that 1,000 long-term free customers want will earn you a grand total of $0. However, implementing a feature that 500 paying customers want will earn you a nice stack of cash, especially if you can use the new feature as an upsell for your SaaS app.<\/p>\n<p>See the difference? While the free customers may not like the new feature, that doesn’t really matter much given the fact that they aren’t paying for your app in the first place!<\/p>\n<p>You should also keep in mind that what customers say they want and what they actually do are two different things. Therefore, make sure to compare what your sales team says versus what your customers say before deciding which new features to implement. The sales team’s feedback should be of a higher priority than what your customers say directly.<\/p>\n<p>According to Pacific Crest in their <a href=\"http:\/\/tomtunguz.com\/images\/2015-PC-Survey.pdf\" target=\"_blank\" rel=\"nofollow noopener\">Private SaaS Company Survey Results<\/a>, roughly 60% of SaaS companies in their survey had annual churn in the &lt; 10% range, with 45% of those at 6% or under. For freemium apps, paying customers are often responsible for the majority of the revenue the SaaS company earns. If you want to keep your paying customers you need to talk to your sales team.<\/p>\n<p>The sales team will likely have better ideas of what features help to <a href=\"blog\/why-you-need-to-develop-buyer-personas-for-saas-app\" target=\"_blank\" rel=\"noopener\">attract and retain paying customers<\/a> and you can use your app’s analytics data to confirm whether or not the feedback of your sales team translates to a real impact on how your app is used.<\/p>\n<p>If you want to make the most of the time and opportunities that are available, <a href=\"http:\/\/www.timeanalyzer.com\/lib\/priority.htm\" target=\"_blank\" rel=\"nofollow noopener\">The Action Priority Matrix<\/a> is a simple diagramming technique that can help you decide which features to prioritize (and which ones you should forget about):<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" style=\"vertical-align: middle; display: block; margin-left: auto; margin-right: auto;\" src=\"http:\/\/www.timeanalyzer.com\/lib\/priority.gif\" width=\"302\" height=\"302\" \/><br \/>\n<em>Image Credit: http:\/\/www.timeanalyzer.com\/lib\/priority.gif<\/em><\/p>\n<p>To explain how this diagram works:<\/p>\n<ul>\n<li><strong>Quick Wins<\/strong> are those features that will provide you with a great return for the least amount of effort.<\/li>\n<li><strong>Major Projects<\/strong> are those features that will provide good returns but will take a long time to complete.<\/li>\n<li><strong>Fill Ins<\/strong> are the features that you should implement if there is spare time. However, you should forget about them if better opportunities come along.<\/li>\n<li><strong>Hard Slogs<\/strong> are the features you should avoid completely. Not only are they likely to offer few returns, they take up the time that could be better used on other feature implementation projects.<\/li>\n<\/ul>\n<p>To use the Action Priority Matrix:<\/p>\n<ol>\n<li>List the features that you would like to implement and then score them on impact from 0 (for no impact) to 10 (maximum impact) and the amount of effort required to implement them from 0 (no effort) to 10 (major effort).<\/li>\n<li>Then, plot the features on the Action Priority Matrix and select or drop features accordingly to their locations on the plot.<\/li>\n<li>You can also rank the features based on financial return or the number of days\/weeks required for implementation to tie the projects to the real opportunity costs for your business.<\/li>\n<\/ol>\n<h2>4. Make Customer Feedback Available to All Development Teams<\/h2>\n<p>Make customer feedback including real-time product usage data, ongoing customer surveys, reviews, suggestions, and complaints available to everyone in your organization, as well as, the members of your outsourced SaaS development team. This allows teams to use agile methods to turn this feedback into new changes for your SaaS app in just a matter of days and weeks, as opposed to the months and years that it would otherwise take.<\/p>\n<p>In addition, having a transparent development process makes it easier for you to track progress and manage your customers expectations in a more realistic way. It also helps you to keep users updated as the changes are implemented.<\/p>\n<p>Even if you don’t implement the feature in the way that it was originally imagined, a clear process helps your internal team and your customers feel like they had a genuine opportunity to have an impact on the feature development process.<\/p>\n<h2>Conclusion<\/h2>\n<p>SaaS app success is the result of a delicate balance between managing technology and customer expectations.<\/p>\n<p>If you want to maximize your revenues and keep your user base satisfied overall, you need to make the decisions that are best for the growth of your business, which may not always be what your customers are demanding at any given moment in time.<\/p>\n<p>At Achievion, we’ve worked with business of all sizes ranging, from startups to enterprise level organizations, to develop <a href=\"#success-stories\">winning SaaS applications<\/a>. If you&#8217;re ready to start your project, contact us today to schedule your <a href=\"home#contact-us\">free 30 minute consultation<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":502,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[26],"_links":{"self":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/590"}],"collection":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/comments?post=590"}],"version-history":[{"count":4,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/590\/revisions"}],"predecessor-version":[{"id":1997,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/posts\/590\/revisions\/1997"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media\/502"}],"wp:attachment":[{"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/media?parent=590"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/categories?post=590"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/achievion.com\/wp-json\/wp\/v2\/tags?post=590"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}